MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
/*******************************************************************************
* FILENAME: cydevice.h
* OBSOLETE: Do not use this file. Use the _trm version instead.
* PSoC Creator 1.0 Production
*
* DESCRIPTION:
* This file provides all of the address values for the entire PSoC device.
*
********************************************************************************
* Copyright 2008-2010, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#if !defined(CYDEVICE_H)
#define CYDEVICE_H
#include <cytypes.h>
#define CYDEV_FLASH_BASE 0x00000000u
#define CYDEV_FLASH_SIZE 0x00040000u
#define CYDEV_FLASH_DATA_MBASE 0x00000000u
#define CYDEV_FLASH_DATA_MSIZE 0x00040000u
#define CYDEV_SRAM_BASE 0x1fff8000u
#define CYDEV_SRAM_SIZE 0x00010000u
#define CYDEV_SRAM_CODE64K_MBASE 0x1fff8000u
#define CYDEV_SRAM_CODE64K_MSIZE 0x00004000u
#define CYDEV_SRAM_CODE32K_MBASE 0x1fffc000u
#define CYDEV_SRAM_CODE32K_MSIZE 0x00002000u
#define CYDEV_SRAM_CODE16K_MBASE 0x1fffe000u
#define CYDEV_SRAM_CODE16K_MSIZE 0x00001000u
#define CYDEV_SRAM_CODE_MBASE 0x1fff8000u
#define CYDEV_SRAM_CODE_MSIZE 0x00008000u
#define CYDEV_SRAM_DATA_MBASE 0x20000000u
#define CYDEV_SRAM_DATA_MSIZE 0x00008000u
#define CYDEV_SRAM_DATA16K_MBASE 0x20001000u
#define CYDEV_SRAM_DATA16K_MSIZE 0x00001000u
#define CYDEV_SRAM_DATA32K_MBASE 0x20002000u
#define CYDEV_SRAM_DATA32K_MSIZE 0x00002000u
#define CYDEV_SRAM_DATA64K_MBASE 0x20004000u
#define CYDEV_SRAM_DATA64K_MSIZE 0x00004000u
#define CYDEV_CLKDIST_BASE 0x40004000u
#define CYDEV_CLKDIST_SIZE 0x00000110u
#define CYDEV_CLKDIST_CR 0x40004000u
#define CYDEV_CLKDIST_LD 0x40004001u
#define CYDEV_CLKDIST_WRK0 0x40004002u
#define CYDEV_CLKDIST_WRK1 0x40004003u
#define CYDEV_CLKDIST_MSTR0 0x40004004u
#define CYDEV_CLKDIST_MSTR1 0x40004005u
#define CYDEV_CLKDIST_BCFG0 0x40004006u
#define CYDEV_CLKDIST_BCFG1 0x40004007u
#define CYDEV_CLKDIST_BCFG2 0x40004008u
#define CYDEV_CLKDIST_UCFG 0x40004009u
#define CYDEV_CLKDIST_DLY0 0x4000400au
#define CYDEV_CLKDIST_DLY1 0x4000400bu
#define CYDEV_CLKDIST_DMASK 0x40004010u
#define CYDEV_CLKDIST_AMASK 0x40004014u
#define CYDEV_CLKDIST_DCFG0_BASE 0x40004080u
#define CYDEV_CLKDIST_DCFG0_SIZE 0x00000003u
#define CYDEV_CLKDIST_DCFG0_CFG0 0x40004080u
#define CYDEV_CLKDIST_DCFG0_CFG1 0x40004081u
#define CYDEV_CLKDIST_DCFG0_CFG2 0x40004082u
#define CYDEV_CLKDIST_DCFG1_BASE 0x40004084u
#define CYDEV_CLKDIST_DCFG1_SIZE 0x00000003u
#define CYDEV_CLKDIST_DCFG1_CFG0 0x40004084u
#define CYDEV_CLKDIST_DCFG1_CFG1 0x40004085u
#define CYDEV_CLKDIST_DCFG1_CFG2 0x40004086u
#define CYDEV_CLKDIST_DCFG2_BASE 0x40004088u
#define CYDEV_CLKDIST_DCFG2_SIZE 0x00000003u
#define CYDEV_CLKDIST_DCFG2_CFG0 0x40004088u
#define CYDEV_CLKDIST_DCFG2_CFG1 0x40004089u
#define CYDEV_CLKDIST_DCFG2_CFG2 0x4000408au
#define CYDEV_CLKDIST_DCFG3_BASE 0x4000408cu
#define CYDEV_CLKDIST_DCFG3_SIZE 0x00000003u
#define CYDEV_CLKDIST_DCFG3_CFG0 0x4000408cu
#define CYDEV_CLKDIST_DCFG3_CFG1 0x4000408du
#define CYDEV_CLKDIST_DCFG3_CFG2 0x4000408eu
#define CYDEV_CLKDIST_DCFG4_BASE 0x40004090u
#define CYDEV_CLKDIST_DCFG4_SIZE 0x00000003u
#define CYDEV_CLKDIST_DCFG4_CFG0 0x40004090u
#define CYDEV_CLKDIST_DCFG4_CFG1 0x40004091u
#define CYDEV_CLKDIST_DCFG4_CFG2 0x40004092u
#define CYDEV_CLKDIST_DCFG5_BASE 0x40004094u
#define CYDEV_CLKDIST_DCFG5_SIZE 0x00000003u
#define CYDEV_CLKDIST_DCFG5_CFG0 0x40004094u
#define CYDEV_CLKDIST_DCFG5_CFG1 0x40004095u
#define CYDEV_CLKDIST_DCFG5_CFG2 0x40004096u
#define CYDEV_CLKDIST_DCFG6_BASE 0x40004098u
#define CYDEV_CLKDIST_DCFG6_SIZE 0x00000003u
#define CYDEV_CLKDIST_DCFG6_CFG0 0x40004098u
#define CYDEV_CLKDIST_DCFG6_CFG1 0x40004099u
#define CYDEV_CLKDIST_DCFG6_CFG2 0x4000409au
#define CYDEV_CLKDIST_DCFG7_BASE 0x4000409cu
#define CYDEV_CLKDIST_DCFG7_SIZE 0x00000003u
#define CYDEV_CLKDIST_DCFG7_CFG0 0x4000409cu
#define CYDEV_CLKDIST_DCFG7_CFG1 0x4000409du
#define CYDEV_CLKDIST_DCFG7_CFG2 0x4000409eu
#define CYDEV_CLKDIST_ACFG0_BASE 0x40004100u
#define CYDEV_CLKDIST_ACFG0_SIZE 0x00000004u
#define CYDEV_CLKDIST_ACFG0_CFG0 0x40004100u
#define CYDEV_CLKDIST_ACFG0_CFG1 0x40004101u
#define CYDEV_CLKDIST_ACFG0_CFG2 0x40004102u
#define CYDEV_CLKDIST_ACFG0_CFG3 0x40004103u
#define CYDEV_CLKDIST_ACFG1_BASE 0x40004104u
#define CYDEV_CLKDIST_ACFG1_SIZE 0x00000004u
#define CYDEV_CLKDIST_ACFG1_CFG0 0x40004104u
#define CYDEV_CLKDIST_ACFG1_CFG1 0x40004105u
#define CYDEV_CLKDIST_ACFG1_CFG2 0x40004106u
#define CYDEV_CLKDIST_ACFG1_CFG3 0x40004107u
#define CYDEV_CLKDIST_ACFG2_BASE 0x40004108u
#define CYDEV_CLKDIST_ACFG2_SIZE 0x00000004u
#define CYDEV_CLKDIST_ACFG2_CFG0 0x40004108u
#define CYDEV_CLKDIST_ACFG2_CFG1 0x40004109u
#define CYDEV_CLKDIST_ACFG2_CFG2 0x4000410au
#define CYDEV_CLKDIST_ACFG2_CFG3 0x4000410bu
#define CYDEV_CLKDIST_ACFG3_BASE 0x4000410cu
#define CYDEV_CLKDIST_ACFG3_SIZE 0x00000004u
#define CYDEV_CLKDIST_ACFG3_CFG0 0x4000410cu
#define CYDEV_CLKDIST_ACFG3_CFG1 0x4000410du
#define CYDEV_CLKDIST_ACFG3_CFG2 0x4000410eu
#define CYDEV_CLKDIST_ACFG3_CFG3 0x4000410fu
#define CYDEV_FASTCLK_BASE 0x40004200u
#define CYDEV_FASTCLK_SIZE 0x00000026u
#define CYDEV_FASTCLK_IMO_BASE 0x40004200u
#define CYDEV_FASTCLK_IMO_SIZE 0x00000001u
#define CYDEV_FASTCLK_IMO_CR 0x40004200u
#define CYDEV_FASTCLK_XMHZ_BASE 0x40004210u
#define CYDEV_FASTCLK_XMHZ_SIZE 0x00000004u
#define CYDEV_FASTCLK_XMHZ_CSR 0x40004210u
#define CYDEV_FASTCLK_XMHZ_TST 0x40004211u
#define CYDEV_FASTCLK_XMHZ_CFG0 0x40004212u
#define CYDEV_FASTCLK_XMHZ_CFG1 0x40004213u
#define CYDEV_FASTCLK_PLL_BASE 0x40004220u
#define CYDEV_FASTCLK_PLL_SIZE 0x00000006u
#define CYDEV_FASTCLK_PLL_CFG0 0x40004220u
#define CYDEV_FASTCLK_PLL_CFG1 0x40004221u
#define CYDEV_FASTCLK_PLL_P 0x40004222u
#define CYDEV_FASTCLK_PLL_Q 0x40004223u
#define CYDEV_FASTCLK_PLL_TST 0x40004224u
#define CYDEV_FASTCLK_PLL_SR 0x40004225u
#define CYDEV_SLOWCLK_BASE 0x40004300u
#define CYDEV_SLOWCLK_SIZE 0x0000000bu
#define CYDEV_SLOWCLK_ILO_BASE 0x40004300u
#define CYDEV_SLOWCLK_ILO_SIZE 0x00000002u
#define CYDEV_SLOWCLK_ILO_CR0 0x40004300u
#define CYDEV_SLOWCLK_ILO_CR1 0x40004301u
#define CYDEV_SLOWCLK_X32_BASE 0x40004308u
#define CYDEV_SLOWCLK_X32_SIZE 0x00000003u
#define CYDEV_SLOWCLK_X32_CR 0x40004308u
#define CYDEV_SLOWCLK_X32_CFG 0x40004309u
#define CYDEV_SLOWCLK_X32_TST 0x4000430au
#define CYDEV_BOOST_BASE 0x40004320u
#define CYDEV_BOOST_SIZE 0x00000005u
#define CYDEV_BOOST_CR0 0x40004320u
#define CYDEV_BOOST_CR1 0x40004321u
#define CYDEV_BOOST_CR2 0x40004322u
#define CYDEV_BOOST_CR3 0x40004323u
#define CYDEV_BOOST_SR 0x40004324u
#define CYDEV_PWRSYS_BASE 0x40004330u
#define CYDEV_PWRSYS_SIZE 0x00000002u
#define CYDEV_PWRSYS_CR0 0x40004330u
#define CYDEV_PWRSYS_CR1 0x40004331u
#define CYDEV_PM_BASE 0x40004380u
#define CYDEV_PM_SIZE 0x00000057u
#define CYDEV_PM_TW_CFG0 0x40004380u
#define CYDEV_PM_TW_CFG1 0x40004381u
#define CYDEV_PM_TW_CFG2 0x40004382u
#define CYDEV_PM_WDT_CFG 0x40004383u
#define CYDEV_PM_WDT_CR 0x40004384u
#define CYDEV_PM_INT_SR 0x40004390u
#define CYDEV_PM_MODE_CFG0 0x40004391u
#define CYDEV_PM_MODE_CFG1 0x40004392u
#define CYDEV_PM_MODE_CSR 0x40004393u
#define CYDEV_PM_WAKEUP_CFG0 0x40004398u
#define CYDEV_PM_WAKEUP_CFG1 0x40004399u
#define CYDEV_PM_ACT_BASE 0x400043a0u
#define CYDEV_PM_ACT_SIZE 0x0000000cu
#define CYDEV_PM_ACT_CFG0 0x400043a0u
#define CYDEV_PM_ACT_CFG1 0x400043a1u
#define CYDEV_PM_ACT_CFG2 0x400043a2u
#define CYDEV_PM_ACT_CFG3 0x400043a3u
#define CYDEV_PM_ACT_CFG4 0x400043a4u
#define CYDEV_PM_ACT_CFG5 0x400043a5u
#define CYDEV_PM_ACT_CFG6 0x400043a6u
#define CYDEV_PM_ACT_CFG7 0x400043a7u
#define CYDEV_PM_ACT_CFG8 0x400043a8u
#define CYDEV_PM_ACT_CFG9 0x400043a9u
#define CYDEV_PM_ACT_CFG10 0x400043aau
#define CYDEV_PM_ACT_CFG11 0x400043abu
#define CYDEV_PM_STBY_BASE 0x400043b0u
#define CYDEV_PM_STBY_SIZE 0x0000000cu
#define CYDEV_PM_STBY_CFG0 0x400043b0u
#define CYDEV_PM_STBY_CFG1 0x400043b1u
#define CYDEV_PM_STBY_CFG2 0x400043b2u
#define CYDEV_PM_STBY_CFG3 0x400043b3u
#define CYDEV_PM_STBY_CFG4 0x400043b4u
#define CYDEV_PM_STBY_CFG5 0x400043b5u
#define CYDEV_PM_STBY_CFG6 0x400043b6u
#define CYDEV_PM_STBY_CFG7 0x400043b7u
#define CYDEV_PM_STBY_CFG8 0x400043b8u
#define CYDEV_PM_STBY_CFG9 0x400043b9u
#define CYDEV_PM_STBY_CFG10 0x400043bau
#define CYDEV_PM_STBY_CFG11 0x400043bbu
#define CYDEV_PM_AVAIL_BASE 0x400043c0u
#define CYDEV_PM_AVAIL_SIZE 0x00000017u
#define CYDEV_PM_AVAIL_CR0 0x400043c0u
#define CYDEV_PM_AVAIL_CR1 0x400043c1u
#define CYDEV_PM_AVAIL_CR2 0x400043c2u
#define CYDEV_PM_AVAIL_CR3 0x400043c3u
#define CYDEV_PM_AVAIL_CR4 0x400043c4u
#define CYDEV_PM_AVAIL_CR5 0x400043c5u
#define CYDEV_PM_AVAIL_CR6 0x400043c6u
#define CYDEV_PM_AVAIL_SR0 0x400043d0u
#define CYDEV_PM_AVAIL_SR1 0x400043d1u
#define CYDEV_PM_AVAIL_SR2 0x400043d2u
#define CYDEV_PM_AVAIL_SR3 0x400043d3u
#define CYDEV_PM_AVAIL_SR4 0x400043d4u
#define CYDEV_PM_AVAIL_SR5 0x400043d5u
#define CYDEV_PM_AVAIL_SR6 0x400043d6u
#define CYDEV_PICU_BASE 0x40004500u
#define CYDEV_PICU_SIZE 0x000000a0u
#define CYDEV_PICU_INTTYPE_BASE 0x40004500u
#define CYDEV_PICU_INTTYPE_SIZE 0x00000080u
#define CYDEV_PICU_INTTYPE_PICU0_BASE 0x40004500u
#define CYDEV_PICU_INTTYPE_PICU0_SIZE 0x00000008u
#define CYDEV_PICU_INTTYPE_PICU0_INTTYPE0 0x40004500u
#define CYDEV_PICU_INTTYPE_PICU0_INTTYPE1 0x40004501u
#define CYDEV_PICU_INTTYPE_PICU0_INTTYPE2 0x40004502u
#define CYDEV_PICU_INTTYPE_PICU0_INTTYPE3 0x40004503u
#define CYDEV_PICU_INTTYPE_PICU0_INTTYPE4 0x40004504u
#define CYDEV_PICU_INTTYPE_PICU0_INTTYPE5 0x40004505u
#define CYDEV_PICU_INTTYPE_PICU0_INTTYPE6 0x40004506u
#define CYDEV_PICU_INTTYPE_PICU0_INTTYPE7 0x40004507u
#define CYDEV_PICU_INTTYPE_PICU1_BASE 0x40004508u
#define CYDEV_PICU_INTTYPE_PICU1_SIZE 0x00000008u
#define CYDEV_PICU_INTTYPE_PICU1_INTTYPE0 0x40004508u
#define CYDEV_PICU_INTTYPE_PICU1_INTTYPE1 0x40004509u
#define CYDEV_PICU_INTTYPE_PICU1_INTTYPE2 0x4000450au
#define CYDEV_PICU_INTTYPE_PICU1_INTTYPE3 0x4000450bu
#define CYDEV_PICU_INTTYPE_PICU1_INTTYPE4 0x4000450cu
#define CYDEV_PICU_INTTYPE_PICU1_INTTYPE5 0x4000450du
#define CYDEV_PICU_INTTYPE_PICU1_INTTYPE6 0x4000450eu
#define CYDEV_PICU_INTTYPE_PICU1_INTTYPE7 0x4000450fu
#define CYDEV_PICU_INTTYPE_PICU2_BASE 0x40004510u
#define CYDEV_PICU_INTTYPE_PICU2_SIZE 0x00000008u
#define CYDEV_PICU_INTTYPE_PICU2_INTTYPE0 0x40004510u
#define CYDEV_PICU_INTTYPE_PICU2_INTTYPE1 0x40004511u
#define CYDEV_PICU_INTTYPE_PICU2_INTTYPE2 0x40004512u
#define CYDEV_PICU_INTTYPE_PICU2_INTTYPE3 0x40004513u
#define CYDEV_PICU_INTTYPE_PICU2_INTTYPE4 0x40004514u
#define CYDEV_PICU_INTTYPE_PICU2_INTTYPE5 0x40004515u
#define CYDEV_PICU_INTTYPE_PICU2_INTTYPE6 0x40004516u
#define CYDEV_PICU_INTTYPE_PICU2_INTTYPE7 0x40004517u
#define CYDEV_PICU_INTTYPE_PICU3_BASE 0x40004518u
#define CYDEV_PICU_INTTYPE_PICU3_SIZE 0x00000008u
#define CYDEV_PICU_INTTYPE_PICU3_INTTYPE0 0x40004518u
#define CYDEV_PICU_INTTYPE_PICU3_INTTYPE1 0x40004519u
#define CYDEV_PICU_INTTYPE_PICU3_INTTYPE2 0x4000451au
#define CYDEV_PICU_INTTYPE_PICU3_INTTYPE3 0x4000451bu
#define CYDEV_PICU_INTTYPE_PICU3_INTTYPE4 0x4000451cu
#define CYDEV_PICU_INTTYPE_PICU3_INTTYPE5 0x4000451du
#define CYDEV_PICU_INTTYPE_PICU3_INTTYPE6 0x4000451eu
#define CYDEV_PICU_INTTYPE_PICU3_INTTYPE7 0x4000451fu
#define CYDEV_PICU_INTTYPE_PICU4_BASE 0x40004520u
#define CYDEV_PICU_INTTYPE_PICU4_SIZE 0x00000008u
#define CYDEV_PICU_INTTYPE_PICU4_INTTYPE0 0x40004520u
#define CYDEV_PICU_INTTYPE_PICU4_INTTYPE1 0x40004521u
#define CYDEV_PICU_INTTYPE_PICU4_INTTYPE2 0x40004522u
#define CYDEV_PICU_INTTYPE_PICU4_INTTYPE3 0x40004523u
#define CYDEV_PICU_INTTYPE_PICU4_INTTYPE4 0x40004524u
#define CYDEV_PICU_INTTYPE_PICU4_INTTYPE5 0x40004525u
#define CYDEV_PICU_INTTYPE_PICU4_INTTYPE6 0x40004526u
#define CYDEV_PICU_INTTYPE_PICU4_INTTYPE7 0x40004527u
#define CYDEV_PICU_INTTYPE_PICU5_BASE 0x40004528u
#define CYDEV_PICU_INTTYPE_PICU5_SIZE 0x00000008u
#define CYDEV_PICU_INTTYPE_PICU5_INTTYPE0 0x40004528u
#define CYDEV_PICU_INTTYPE_PICU5_INTTYPE1 0x40004529u
#define CYDEV_PICU_INTTYPE_PICU5_INTTYPE2 0x4000452au
#define CYDEV_PICU_INTTYPE_PICU5_INTTYPE3 0x4000452bu
#define CYDEV_PICU_INTTYPE_PICU5_INTTYPE4 0x4000452cu
#define CYDEV_PICU_INTTYPE_PICU5_INTTYPE5 0x4000452du
#define CYDEV_PICU_INTTYPE_PICU5_INTTYPE6 0x4000452eu
#define CYDEV_PICU_INTTYPE_PICU5_INTTYPE7 0x4000452fu
#define CYDEV_PICU_INTTYPE_PICU6_BASE 0x40004530u
#define CYDEV_PICU_INTTYPE_PICU6_SIZE 0x00000008u
#define CYDEV_PICU_INTTYPE_PICU6_INTTYPE0 0x40004530u
#define CYDEV_PICU_INTTYPE_PICU6_INTTYPE1 0x40004531u
#define CYDEV_PICU_INTTYPE_PICU6_INTTYPE2 0x40004532u
#define CYDEV_PICU_INTTYPE_PICU6_INTTYPE3 0x40004533u
#define CYDEV_PICU_INTTYPE_PICU6_INTTYPE4 0x40004534u
#define CYDEV_PICU_INTTYPE_PICU6_INTTYPE5 0x40004535u
#define CYDEV_PICU_INTTYPE_PICU6_INTTYPE6 0x40004536u
#define CYDEV_PICU_INTTYPE_PICU6_INTTYPE7 0x40004537u
#define CYDEV_PICU_INTTYPE_PICU12_BASE 0x40004560u
#define CYDEV_PICU_INTTYPE_PICU12_SIZE 0x00000008u
#define CYDEV_PICU_INTTYPE_PICU12_INTTYPE0 0x40004560u
#define CYDEV_PICU_INTTYPE_PICU12_INTTYPE1 0x40004561u
#define CYDEV_PICU_INTTYPE_PICU12_INTTYPE2 0x40004562u
#define CYDEV_PICU_INTTYPE_PICU12_INTTYPE3 0x40004563u
#define CYDEV_PICU_INTTYPE_PICU12_INTTYPE4 0x40004564u
#define CYDEV_PICU_INTTYPE_PICU12_INTTYPE5 0x40004565u
#define CYDEV_PICU_INTTYPE_PICU12_INTTYPE6 0x40004566u
#define CYDEV_PICU_INTTYPE_PICU12_INTTYPE7 0x40004567u
#define CYDEV_PICU_INTTYPE_PICU15_BASE 0x40004578u
#define CYDEV_PICU_INTTYPE_PICU15_SIZE 0x00000008u
#define CYDEV_PICU_INTTYPE_PICU15_INTTYPE0 0x40004578u
#define CYDEV_PICU_INTTYPE_PICU15_INTTYPE1 0x40004579u
#define CYDEV_PICU_INTTYPE_PICU15_INTTYPE2 0x4000457au
#define CYDEV_PICU_INTTYPE_PICU15_INTTYPE3 0x4000457bu
#define CYDEV_PICU_INTTYPE_PICU15_INTTYPE4 0x4000457cu
#define CYDEV_PICU_INTTYPE_PICU15_INTTYPE5 0x4000457du
#define CYDEV_PICU_INTTYPE_PICU15_INTTYPE6 0x4000457eu
#define CYDEV_PICU_INTTYPE_PICU15_INTTYPE7 0x4000457fu
#define CYDEV_PICU_STAT_BASE 0x40004580u
#define CYDEV_PICU_STAT_SIZE 0x00000010u
#define CYDEV_PICU_STAT_PICU0_BASE 0x40004580u
#define CYDEV_PICU_STAT_PICU0_SIZE 0x00000001u
#define CYDEV_PICU_STAT_PICU0_INTSTAT 0x40004580u
#define CYDEV_PICU_STAT_PICU1_BASE 0x40004581u
#define CYDEV_PICU_STAT_PICU1_SIZE 0x00000001u
#define CYDEV_PICU_STAT_PICU1_INTSTAT 0x40004581u
#define CYDEV_PICU_STAT_PICU2_BASE 0x40004582u
#define CYDEV_PICU_STAT_PICU2_SIZE 0x00000001u
#define CYDEV_PICU_STAT_PICU2_INTSTAT 0x40004582u
#define CYDEV_PICU_STAT_PICU3_BASE 0x40004583u
#define CYDEV_PICU_STAT_PICU3_SIZE 0x00000001u
#define CYDEV_PICU_STAT_PICU3_INTSTAT 0x40004583u
#define CYDEV_PICU_STAT_PICU4_BASE 0x40004584u
#define CYDEV_PICU_STAT_PICU4_SIZE 0x00000001u
#define CYDEV_PICU_STAT_PICU4_INTSTAT 0x40004584u
#define CYDEV_PICU_STAT_PICU5_BASE 0x40004585u
#define CYDEV_PICU_STAT_PICU5_SIZE 0x00000001u
#define CYDEV_PICU_STAT_PICU5_INTSTAT 0x40004585u
#define CYDEV_PICU_STAT_PICU6_BASE 0x40004586u
#define CYDEV_PICU_STAT_PICU6_SIZE 0x00000001u
#define CYDEV_PICU_STAT_PICU6_INTSTAT 0x40004586u
#define CYDEV_PICU_STAT_PICU12_BASE 0x4000458cu
#define CYDEV_PICU_STAT_PICU12_SIZE 0x00000001u
#define CYDEV_PICU_STAT_PICU12_INTSTAT 0x4000458cu
#define CYDEV_PICU_STAT_PICU15_BASE 0x4000458fu
#define CYDEV_PICU_STAT_PICU15_SIZE 0x00000001u
#define CYDEV_PICU_STAT_PICU15_INTSTAT 0x4000458fu
#define CYDEV_PICU_SNAP_BASE 0x40004590u
#define CYDEV_PICU_SNAP_SIZE 0x00000010u
#define CYDEV_PICU_SNAP_PICU0_BASE 0x40004590u
#define CYDEV_PICU_SNAP_PICU0_SIZE 0x00000001u
#define CYDEV_PICU_SNAP_PICU0_SNAP 0x40004590u
#define CYDEV_PICU_SNAP_PICU1_BASE 0x40004591u
#define CYDEV_PICU_SNAP_PICU1_SIZE 0x00000001u
#define CYDEV_PICU_SNAP_PICU1_SNAP 0x40004591u
#define CYDEV_PICU_SNAP_PICU2_BASE 0x40004592u
#define CYDEV_PICU_SNAP_PICU2_SIZE 0x00000001u
#define CYDEV_PICU_SNAP_PICU2_SNAP 0x40004592u
#define CYDEV_PICU_SNAP_PICU3_BASE 0x40004593u
#define CYDEV_PICU_SNAP_PICU3_SIZE 0x00000001u
#define CYDEV_PICU_SNAP_PICU3_SNAP 0x40004593u
#define CYDEV_PICU_SNAP_PICU4_BASE 0x40004594u
#define CYDEV_PICU_SNAP_PICU4_SIZE 0x00000001u
#define CYDEV_PICU_SNAP_PICU4_SNAP 0x40004594u
#define CYDEV_PICU_SNAP_PICU5_BASE 0x40004595u
#define CYDEV_PICU_SNAP_PICU5_SIZE 0x00000001u
#define CYDEV_PICU_SNAP_PICU5_SNAP 0x40004595u
#define CYDEV_PICU_SNAP_PICU6_BASE 0x40004596u
#define CYDEV_PICU_SNAP_PICU6_SIZE 0x00000001u
#define CYDEV_PICU_SNAP_PICU6_SNAP 0x40004596u
#define CYDEV_PICU_SNAP_PICU12_BASE 0x4000459cu
#define CYDEV_PICU_SNAP_PICU12_SIZE 0x00000001u
#define CYDEV_PICU_SNAP_PICU12_SNAP 0x4000459cu
#define CYDEV_PICU_SNAP_PICU15_BASE 0x4000459fu
#define CYDEV_PICU_SNAP_PICU15_SIZE 0x00000001u
#define CYDEV_PICU_SNAP_PICU15_SNAP 0x4000459fu
#define CYDEV_MFGCFG_BASE 0x40004600u
#define CYDEV_MFGCFG_SIZE 0x000000edu
#define CYDEV_MFGCFG_ANAIF_BASE 0x40004600u
#define CYDEV_MFGCFG_ANAIF_SIZE 0x00000028u
#define CYDEV_MFGCFG_ANAIF_CMP0_BASE 0x40004600u
#define CYDEV_MFGCFG_ANAIF_CMP0_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_CMP0_TR 0x40004600u
#define CYDEV_MFGCFG_ANAIF_CMP1_BASE 0x40004601u
#define CYDEV_MFGCFG_ANAIF_CMP1_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_CMP1_TR 0x40004601u
#define CYDEV_MFGCFG_ANAIF_CMP2_BASE 0x40004602u
#define CYDEV_MFGCFG_ANAIF_CMP2_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_CMP2_TR 0x40004602u
#define CYDEV_MFGCFG_ANAIF_CMP3_BASE 0x40004603u
#define CYDEV_MFGCFG_ANAIF_CMP3_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_CMP3_TR 0x40004603u
#define CYDEV_MFGCFG_ANAIF_DAC0_BASE 0x40004608u
#define CYDEV_MFGCFG_ANAIF_DAC0_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_DAC0_TR 0x40004608u
#define CYDEV_MFGCFG_ANAIF_DAC1_BASE 0x40004609u
#define CYDEV_MFGCFG_ANAIF_DAC1_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_DAC1_TR 0x40004609u
#define CYDEV_MFGCFG_ANAIF_DAC2_BASE 0x4000460au
#define CYDEV_MFGCFG_ANAIF_DAC2_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_DAC2_TR 0x4000460au
#define CYDEV_MFGCFG_ANAIF_DAC3_BASE 0x4000460bu
#define CYDEV_MFGCFG_ANAIF_DAC3_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_DAC3_TR 0x4000460bu
#define CYDEV_MFGCFG_ANAIF_NPUMP_DSM_BASE 0x40004610u
#define CYDEV_MFGCFG_ANAIF_NPUMP_DSM_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_NPUMP_DSM_TR0 0x40004610u
#define CYDEV_MFGCFG_ANAIF_NPUMP_ABUF_BASE 0x40004612u
#define CYDEV_MFGCFG_ANAIF_NPUMP_ABUF_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_NPUMP_ABUF_TR0 0x40004612u
#define CYDEV_MFGCFG_ANAIF_SAR0_BASE 0x40004614u
#define CYDEV_MFGCFG_ANAIF_SAR0_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_SAR0_TR0 0x40004614u
#define CYDEV_MFGCFG_ANAIF_SAR1_BASE 0x40004616u
#define CYDEV_MFGCFG_ANAIF_SAR1_SIZE 0x00000001u
#define CYDEV_MFGCFG_ANAIF_SAR1_TR0 0x40004616u
#define CYDEV_MFGCFG_ANAIF_ABUF0_BASE 0x40004620u
#define CYDEV_MFGCFG_ANAIF_ABUF0_SIZE 0x00000002u
#define CYDEV_MFGCFG_ANAIF_ABUF0_TR0 0x40004620u
#define CYDEV_MFGCFG_ANAIF_ABUF0_TR1 0x40004621u
#define CYDEV_MFGCFG_ANAIF_ABUF1_BASE 0x40004622u
#define CYDEV_MFGCFG_ANAIF_ABUF1_SIZE 0x00000002u
#define CYDEV_MFGCFG_ANAIF_ABUF1_TR0 0x40004622u
#define CYDEV_MFGCFG_ANAIF_ABUF1_TR1 0x40004623u
#define CYDEV_MFGCFG_ANAIF_ABUF2_BASE 0x40004624u
#define CYDEV_MFGCFG_ANAIF_ABUF2_SIZE 0x00000002u
#define CYDEV_MFGCFG_ANAIF_ABUF2_TR0 0x40004624u
#define CYDEV_MFGCFG_ANAIF_ABUF2_TR1 0x40004625u
#define CYDEV_MFGCFG_ANAIF_ABUF3_BASE 0x40004626u
#define CYDEV_MFGCFG_ANAIF_ABUF3_SIZE 0x00000002u
#define CYDEV_MFGCFG_ANAIF_ABUF3_TR0 0x40004626u
#define CYDEV_MFGCFG_ANAIF_ABUF3_TR1 0x40004627u
#define CYDEV_MFGCFG_PWRSYS_BASE 0x40004680u
#define CYDEV_MFGCFG_PWRSYS_SIZE 0x00000009u
#define CYDEV_MFGCFG_PWRSYS_HIB_TR0 0x40004680u
#define CYDEV_MFGCFG_PWRSYS_HIB_TR1 0x40004681u
#define CYDEV_MFGCFG_PWRSYS_I2C_TR 0x40004682u
#define CYDEV_MFGCFG_PWRSYS_SLP_TR 0x40004683u
#define CYDEV_MFGCFG_PWRSYS_BUZZ_TR 0x40004684u
#define CYDEV_MFGCFG_PWRSYS_WAKE_TR0 0x40004685u
#define CYDEV_MFGCFG_PWRSYS_WAKE_TR1 0x40004686u
#define CYDEV_MFGCFG_PWRSYS_BREF_TR 0x40004687u
#define CYDEV_MFGCFG_PWRSYS_BG_TR 0x40004688u
#define CYDEV_MFGCFG_ILO_BASE 0x40004690u
#define CYDEV_MFGCFG_ILO_SIZE 0x00000002u
#define CYDEV_MFGCFG_ILO_TR0 0x40004690u
#define CYDEV_MFGCFG_ILO_TR1 0x40004691u
#define CYDEV_MFGCFG_X32_BASE 0x40004698u
#define CYDEV_MFGCFG_X32_SIZE 0x00000001u
#define CYDEV_MFGCFG_X32_TR 0x40004698u
#define CYDEV_MFGCFG_IMO_BASE 0x400046a0u
#define CYDEV_MFGCFG_IMO_SIZE 0x00000005u
#define CYDEV_MFGCFG_IMO_TR0 0x400046a0u
#define CYDEV_MFGCFG_IMO_TR1 0x400046a1u
#define CYDEV_MFGCFG_IMO_GAIN 0x400046a2u
#define CYDEV_MFGCFG_IMO_C36M 0x400046a3u
#define CYDEV_MFGCFG_IMO_TR2 0x400046a4u
#define CYDEV_MFGCFG_XMHZ_BASE 0x400046a8u
#define CYDEV_MFGCFG_XMHZ_SIZE 0x00000001u
#define CYDEV_MFGCFG_XMHZ_TR 0x400046a8u
#define CYDEV_MFGCFG_MLOGIC_BASE 0x400046e0u
#define CYDEV_MFGCFG_MLOGIC_SIZE 0x0000000du
#define CYDEV_MFGCFG_MLOGIC_DMP_BASE 0x400046e2u
#define CYDEV_MFGCFG_MLOGIC_DMP_SIZE 0x00000001u
#define CYDEV_MFGCFG_MLOGIC_DMP_DMY 0x400046e2u
#define CYDEV_MFGCFG_MLOGIC_SEG_BASE 0x400046e4u
#define CYDEV_MFGCFG_MLOGIC_SEG_SIZE 0x00000002u
#define CYDEV_MFGCFG_MLOGIC_SEG_CR 0x400046e4u
#define CYDEV_MFGCFG_MLOGIC_SEG_CFG0 0x400046e5u
#define CYDEV_MFGCFG_MLOGIC_DBG_BASE 0x400046e8u
#define CYDEV_MFGCFG_MLOGIC_DBG_SIZE 0x00000001u
#define CYDEV_MFGCFG_MLOGIC_DBG_DBE 0x400046e8u
#define CYDEV_MFGCFG_MLOGIC_CPU_BASE 0x400046eau
#define CYDEV_MFGCFG_MLOGIC_CPU_SIZE 0x00000001u
#define CYDEV_MFGCFG_MLOGIC_CPU_SCR 0x400046eau
#define CYDEV_MFGCFG_MLOGIC_REV_BASE 0x400046ecu
#define CYDEV_MFGCFG_MLOGIC_REV_SIZE 0x00000001u
#define CYDEV_MFGCFG_MLOGIC_REV_ID 0x400046ecu
#define CYDEV_RESET_BASE 0x400046f0u
#define CYDEV_RESET_SIZE 0x0000000cu
#define CYDEV_RESET_IPOR_CR0 0x400046f0u
#define CYDEV_RESET_IPOR_CR1 0x400046f1u
#define CYDEV_RESET_IPOR_CR2 0x400046f2u
#define CYDEV_RESET_IPOR_CR3 0x400046f3u
#define CYDEV_RESET_CR0 0x400046f4u
#define CYDEV_RESET_CR1 0x400046f5u
#define CYDEV_RESET_CR2 0x400046f6u
#define CYDEV_RESET_CR3 0x400046f7u
#define CYDEV_RESET_SR0 0x400046f8u
#define CYDEV_RESET_SR1 0x400046f9u
#define CYDEV_RESET_SR2 0x400046fau
#define CYDEV_RESET_TR 0x400046fbu
#define CYDEV_SPC_BASE 0x40004700u
#define CYDEV_SPC_SIZE 0x00000100u
#define CYDEV_SPC_FM_EE_CR 0x40004700u
#define CYDEV_SPC_FM_EE_WAKE_CNT 0x40004701u
#define CYDEV_SPC_EE_SCR 0x40004702u
#define CYDEV_SPC_EE_ERR 0x40004703u
#define CYDEV_SPC_CPU_DATA 0x40004720u
#define CYDEV_SPC_DMA_DATA 0x40004721u
#define CYDEV_SPC_SR 0x40004722u
#define CYDEV_SPC_CR 0x40004723u
#define CYDEV_SPC_DMM_MAP_BASE 0x40004780u
#define CYDEV_SPC_DMM_MAP_SIZE 0x00000080u
#define CYDEV_SPC_DMM_MAP_SRAM_MBASE 0x40004780u
#define CYDEV_SPC_DMM_MAP_SRAM_MSIZE 0x00000080u
#define CYDEV_CACHE_BASE 0x40004800u
#define CYDEV_CACHE_SIZE 0x0000009cu
#define CYDEV_CACHE_CC_CTL 0x40004800u
#define CYDEV_CACHE_ECC_CORR 0x40004880u
#define CYDEV_CACHE_ECC_ERR 0x40004888u
#define CYDEV_CACHE_FLASH_ERR 0x40004890u
#define CYDEV_CACHE_HITMISS 0x40004898u
#define CYDEV_I2C_BASE 0x40004900u
#define CYDEV_I2C_SIZE 0x000000dcu
#define CYDEV_I2C_XCFG 0x400049c8u
#define CYDEV_I2C_ADR 0x400049cau
#define CYDEV_I2C_CFG 0x400049d6u
#define CYDEV_I2C_CSR 0x400049d7u
#define CYDEV_I2C_D 0x400049d8u
#define CYDEV_I2C_MCSR 0x400049d9u
#define CYDEV_I2C_CLK_DIV 0x400049dbu
#define CYDEV_DEC_BASE 0x40004e00u
#define CYDEV_DEC_SIZE 0x00000015u
#define CYDEV_DEC_CR 0x40004e00u
#define CYDEV_DEC_SR 0x40004e01u
