MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
#define CYDEV_DEC_SHIFT1 0x40004e02u
#define CYDEV_DEC_SHIFT2 0x40004e03u
#define CYDEV_DEC_DR2 0x40004e04u
#define CYDEV_DEC_DR2H 0x40004e05u
#define CYDEV_DEC_DR1 0x40004e06u
#define CYDEV_DEC_OCOR 0x40004e08u
#define CYDEV_DEC_OCORM 0x40004e09u
#define CYDEV_DEC_OCORH 0x40004e0au
#define CYDEV_DEC_GCOR 0x40004e0cu
#define CYDEV_DEC_GCORH 0x40004e0du
#define CYDEV_DEC_GVAL 0x40004e0eu
#define CYDEV_DEC_OUTSAMP 0x40004e10u
#define CYDEV_DEC_OUTSAMPM 0x40004e11u
#define CYDEV_DEC_OUTSAMPH 0x40004e12u
#define CYDEV_DEC_OUTSAMPS 0x40004e13u
#define CYDEV_DEC_COHER 0x40004e14u
#define CYDEV_TMR0_BASE 0x40004f00u
#define CYDEV_TMR0_SIZE 0x0000000bu
#define CYDEV_TMR0_CFG0 0x40004f00u
#define CYDEV_TMR0_CFG1 0x40004f01u
#define CYDEV_TMR0_PER0 0x40004f02u
#define CYDEV_TMR0_PER1 0x40004f03u
#define CYDEV_TMR0_CNT_CMP0 0x40004f04u
#define CYDEV_TMR0_CNT_CMP1 0x40004f05u
#define CYDEV_TMR0_CAP0 0x40004f06u
#define CYDEV_TMR0_CAP1 0x40004f07u
#define CYDEV_TMR0_SR0 0x40004f08u
#define CYDEV_TMR0_RT0 0x40004f09u
#define CYDEV_TMR0_RT1 0x40004f0au
#define CYDEV_TMR1_BASE 0x40004f0cu
#define CYDEV_TMR1_SIZE 0x0000000bu
#define CYDEV_TMR1_CFG0 0x40004f0cu
#define CYDEV_TMR1_CFG1 0x40004f0du
#define CYDEV_TMR1_PER0 0x40004f0eu
#define CYDEV_TMR1_PER1 0x40004f0fu
#define CYDEV_TMR1_CNT_CMP0 0x40004f10u
#define CYDEV_TMR1_CNT_CMP1 0x40004f11u
#define CYDEV_TMR1_CAP0 0x40004f12u
#define CYDEV_TMR1_CAP1 0x40004f13u
#define CYDEV_TMR1_SR0 0x40004f14u
#define CYDEV_TMR1_RT0 0x40004f15u
#define CYDEV_TMR1_RT1 0x40004f16u
#define CYDEV_TMR2_BASE 0x40004f18u
#define CYDEV_TMR2_SIZE 0x0000000bu
#define CYDEV_TMR2_CFG0 0x40004f18u
#define CYDEV_TMR2_CFG1 0x40004f19u
#define CYDEV_TMR2_PER0 0x40004f1au
#define CYDEV_TMR2_PER1 0x40004f1bu
#define CYDEV_TMR2_CNT_CMP0 0x40004f1cu
#define CYDEV_TMR2_CNT_CMP1 0x40004f1du
#define CYDEV_TMR2_CAP0 0x40004f1eu
#define CYDEV_TMR2_CAP1 0x40004f1fu
#define CYDEV_TMR2_SR0 0x40004f20u
#define CYDEV_TMR2_RT0 0x40004f21u
#define CYDEV_TMR2_RT1 0x40004f22u
#define CYDEV_TMR3_BASE 0x40004f24u
#define CYDEV_TMR3_SIZE 0x0000000bu
#define CYDEV_TMR3_CFG0 0x40004f24u
#define CYDEV_TMR3_CFG1 0x40004f25u
#define CYDEV_TMR3_PER0 0x40004f26u
#define CYDEV_TMR3_PER1 0x40004f27u
#define CYDEV_TMR3_CNT_CMP0 0x40004f28u
#define CYDEV_TMR3_CNT_CMP1 0x40004f29u
#define CYDEV_TMR3_CAP0 0x40004f2au
#define CYDEV_TMR3_CAP1 0x40004f2bu
#define CYDEV_TMR3_SR0 0x40004f2cu
#define CYDEV_TMR3_RT0 0x40004f2du
#define CYDEV_TMR3_RT1 0x40004f2eu
#define CYDEV_IO_BASE 0x40005000u
#define CYDEV_IO_SIZE 0x00000200u
#define CYDEV_IO_PC_BASE 0x40005000u
#define CYDEV_IO_PC_SIZE 0x00000080u
#define CYDEV_IO_PC_PRT0_BASE 0x40005000u
#define CYDEV_IO_PC_PRT0_SIZE 0x00000008u
#define CYDEV_IO_PC_PRT0_PC0 0x40005000u
#define CYDEV_IO_PC_PRT0_PC1 0x40005001u
#define CYDEV_IO_PC_PRT0_PC2 0x40005002u
#define CYDEV_IO_PC_PRT0_PC3 0x40005003u
#define CYDEV_IO_PC_PRT0_PC4 0x40005004u
#define CYDEV_IO_PC_PRT0_PC5 0x40005005u
#define CYDEV_IO_PC_PRT0_PC6 0x40005006u
#define CYDEV_IO_PC_PRT0_PC7 0x40005007u
#define CYDEV_IO_PC_PRT1_BASE 0x40005008u
#define CYDEV_IO_PC_PRT1_SIZE 0x00000008u
#define CYDEV_IO_PC_PRT1_PC0 0x40005008u
#define CYDEV_IO_PC_PRT1_PC1 0x40005009u
#define CYDEV_IO_PC_PRT1_PC2 0x4000500au
#define CYDEV_IO_PC_PRT1_PC3 0x4000500bu
#define CYDEV_IO_PC_PRT1_PC4 0x4000500cu
#define CYDEV_IO_PC_PRT1_PC5 0x4000500du
#define CYDEV_IO_PC_PRT1_PC6 0x4000500eu
#define CYDEV_IO_PC_PRT1_PC7 0x4000500fu
#define CYDEV_IO_PC_PRT2_BASE 0x40005010u
#define CYDEV_IO_PC_PRT2_SIZE 0x00000008u
#define CYDEV_IO_PC_PRT2_PC0 0x40005010u
#define CYDEV_IO_PC_PRT2_PC1 0x40005011u
#define CYDEV_IO_PC_PRT2_PC2 0x40005012u
#define CYDEV_IO_PC_PRT2_PC3 0x40005013u
#define CYDEV_IO_PC_PRT2_PC4 0x40005014u
#define CYDEV_IO_PC_PRT2_PC5 0x40005015u
#define CYDEV_IO_PC_PRT2_PC6 0x40005016u
#define CYDEV_IO_PC_PRT2_PC7 0x40005017u
#define CYDEV_IO_PC_PRT3_BASE 0x40005018u
#define CYDEV_IO_PC_PRT3_SIZE 0x00000008u
#define CYDEV_IO_PC_PRT3_PC0 0x40005018u
#define CYDEV_IO_PC_PRT3_PC1 0x40005019u
#define CYDEV_IO_PC_PRT3_PC2 0x4000501au
#define CYDEV_IO_PC_PRT3_PC3 0x4000501bu
#define CYDEV_IO_PC_PRT3_PC4 0x4000501cu
#define CYDEV_IO_PC_PRT3_PC5 0x4000501du
#define CYDEV_IO_PC_PRT3_PC6 0x4000501eu
#define CYDEV_IO_PC_PRT3_PC7 0x4000501fu
#define CYDEV_IO_PC_PRT4_BASE 0x40005020u
#define CYDEV_IO_PC_PRT4_SIZE 0x00000008u
#define CYDEV_IO_PC_PRT4_PC0 0x40005020u
#define CYDEV_IO_PC_PRT4_PC1 0x40005021u
#define CYDEV_IO_PC_PRT4_PC2 0x40005022u
#define CYDEV_IO_PC_PRT4_PC3 0x40005023u
#define CYDEV_IO_PC_PRT4_PC4 0x40005024u
#define CYDEV_IO_PC_PRT4_PC5 0x40005025u
#define CYDEV_IO_PC_PRT4_PC6 0x40005026u
#define CYDEV_IO_PC_PRT4_PC7 0x40005027u
#define CYDEV_IO_PC_PRT5_BASE 0x40005028u
#define CYDEV_IO_PC_PRT5_SIZE 0x00000008u
#define CYDEV_IO_PC_PRT5_PC0 0x40005028u
#define CYDEV_IO_PC_PRT5_PC1 0x40005029u
#define CYDEV_IO_PC_PRT5_PC2 0x4000502au
#define CYDEV_IO_PC_PRT5_PC3 0x4000502bu
#define CYDEV_IO_PC_PRT5_PC4 0x4000502cu
#define CYDEV_IO_PC_PRT5_PC5 0x4000502du
#define CYDEV_IO_PC_PRT5_PC6 0x4000502eu
#define CYDEV_IO_PC_PRT5_PC7 0x4000502fu
#define CYDEV_IO_PC_PRT6_BASE 0x40005030u
#define CYDEV_IO_PC_PRT6_SIZE 0x00000008u
#define CYDEV_IO_PC_PRT6_PC0 0x40005030u
#define CYDEV_IO_PC_PRT6_PC1 0x40005031u
#define CYDEV_IO_PC_PRT6_PC2 0x40005032u
#define CYDEV_IO_PC_PRT6_PC3 0x40005033u
#define CYDEV_IO_PC_PRT6_PC4 0x40005034u
#define CYDEV_IO_PC_PRT6_PC5 0x40005035u
#define CYDEV_IO_PC_PRT6_PC6 0x40005036u
#define CYDEV_IO_PC_PRT6_PC7 0x40005037u
#define CYDEV_IO_PC_PRT12_BASE 0x40005060u
#define CYDEV_IO_PC_PRT12_SIZE 0x00000008u
#define CYDEV_IO_PC_PRT12_PC0 0x40005060u
#define CYDEV_IO_PC_PRT12_PC1 0x40005061u
#define CYDEV_IO_PC_PRT12_PC2 0x40005062u
#define CYDEV_IO_PC_PRT12_PC3 0x40005063u
#define CYDEV_IO_PC_PRT12_PC4 0x40005064u
#define CYDEV_IO_PC_PRT12_PC5 0x40005065u
#define CYDEV_IO_PC_PRT12_PC6 0x40005066u
#define CYDEV_IO_PC_PRT12_PC7 0x40005067u
#define CYDEV_IO_PC_PRT15_BASE 0x40005078u
#define CYDEV_IO_PC_PRT15_SIZE 0x00000008u
#define CYDEV_IO_PC_PRT15_PC0 0x40005078u
#define CYDEV_IO_PC_PRT15_PC1 0x40005079u
#define CYDEV_IO_PC_PRT15_PC2 0x4000507au
#define CYDEV_IO_PC_PRT15_PC3 0x4000507bu
#define CYDEV_IO_PC_PRT15_PC4 0x4000507cu
#define CYDEV_IO_PC_PRT15_PC5 0x4000507du
#define CYDEV_IO_PC_PRT15_PC6 0x4000507eu
#define CYDEV_IO_PC_PRT15_PC7 0x4000507fu
#define CYDEV_IO_DR_BASE 0x40005080u
#define CYDEV_IO_DR_SIZE 0x00000010u
#define CYDEV_IO_DR_PRT0_BASE 0x40005080u
#define CYDEV_IO_DR_PRT0_SIZE 0x00000001u
#define CYDEV_IO_DR_PRT0_DR_ALIAS 0x40005080u
#define CYDEV_IO_DR_PRT1_BASE 0x40005081u
#define CYDEV_IO_DR_PRT1_SIZE 0x00000001u
#define CYDEV_IO_DR_PRT1_DR_ALIAS 0x40005081u
#define CYDEV_IO_DR_PRT2_BASE 0x40005082u
#define CYDEV_IO_DR_PRT2_SIZE 0x00000001u
#define CYDEV_IO_DR_PRT2_DR_ALIAS 0x40005082u
#define CYDEV_IO_DR_PRT3_BASE 0x40005083u
#define CYDEV_IO_DR_PRT3_SIZE 0x00000001u
#define CYDEV_IO_DR_PRT3_DR_ALIAS 0x40005083u
#define CYDEV_IO_DR_PRT4_BASE 0x40005084u
#define CYDEV_IO_DR_PRT4_SIZE 0x00000001u
#define CYDEV_IO_DR_PRT4_DR_ALIAS 0x40005084u
#define CYDEV_IO_DR_PRT5_BASE 0x40005085u
#define CYDEV_IO_DR_PRT5_SIZE 0x00000001u
#define CYDEV_IO_DR_PRT5_DR_ALIAS 0x40005085u
#define CYDEV_IO_DR_PRT6_BASE 0x40005086u
#define CYDEV_IO_DR_PRT6_SIZE 0x00000001u
#define CYDEV_IO_DR_PRT6_DR_ALIAS 0x40005086u
#define CYDEV_IO_DR_PRT12_BASE 0x4000508cu
#define CYDEV_IO_DR_PRT12_SIZE 0x00000001u
#define CYDEV_IO_DR_PRT12_DR_ALIAS 0x4000508cu
#define CYDEV_IO_DR_PRT15_BASE 0x4000508fu
#define CYDEV_IO_DR_PRT15_SIZE 0x00000001u
#define CYDEV_IO_DR_PRT15_DR_ALIAS 0x4000508fu
#define CYDEV_IO_PS_BASE 0x40005090u
#define CYDEV_IO_PS_SIZE 0x00000010u
#define CYDEV_IO_PS_PRT0_BASE 0x40005090u
#define CYDEV_IO_PS_PRT0_SIZE 0x00000001u
#define CYDEV_IO_PS_PRT0_PS_ALIAS 0x40005090u
#define CYDEV_IO_PS_PRT1_BASE 0x40005091u
#define CYDEV_IO_PS_PRT1_SIZE 0x00000001u
#define CYDEV_IO_PS_PRT1_PS_ALIAS 0x40005091u
#define CYDEV_IO_PS_PRT2_BASE 0x40005092u
#define CYDEV_IO_PS_PRT2_SIZE 0x00000001u
#define CYDEV_IO_PS_PRT2_PS_ALIAS 0x40005092u
#define CYDEV_IO_PS_PRT3_BASE 0x40005093u
#define CYDEV_IO_PS_PRT3_SIZE 0x00000001u
#define CYDEV_IO_PS_PRT3_PS_ALIAS 0x40005093u
#define CYDEV_IO_PS_PRT4_BASE 0x40005094u
#define CYDEV_IO_PS_PRT4_SIZE 0x00000001u
#define CYDEV_IO_PS_PRT4_PS_ALIAS 0x40005094u
#define CYDEV_IO_PS_PRT5_BASE 0x40005095u
#define CYDEV_IO_PS_PRT5_SIZE 0x00000001u
#define CYDEV_IO_PS_PRT5_PS_ALIAS 0x40005095u
#define CYDEV_IO_PS_PRT6_BASE 0x40005096u
#define CYDEV_IO_PS_PRT6_SIZE 0x00000001u
#define CYDEV_IO_PS_PRT6_PS_ALIAS 0x40005096u
#define CYDEV_IO_PS_PRT12_BASE 0x4000509cu
#define CYDEV_IO_PS_PRT12_SIZE 0x00000001u
#define CYDEV_IO_PS_PRT12_PS_ALIAS 0x4000509cu
#define CYDEV_IO_PS_PRT15_BASE 0x4000509fu
#define CYDEV_IO_PS_PRT15_SIZE 0x00000001u
#define CYDEV_IO_PS_PRT15_PS_ALIAS 0x4000509fu
#define CYDEV_IO_PRT_BASE 0x40005100u
#define CYDEV_IO_PRT_SIZE 0x00000100u
#define CYDEV_IO_PRT_PRT0_BASE 0x40005100u
#define CYDEV_IO_PRT_PRT0_SIZE 0x00000010u
#define CYDEV_IO_PRT_PRT0_DR 0x40005100u
#define CYDEV_IO_PRT_PRT0_PS 0x40005101u
#define CYDEV_IO_PRT_PRT0_DM0 0x40005102u
#define CYDEV_IO_PRT_PRT0_DM1 0x40005103u
#define CYDEV_IO_PRT_PRT0_DM2 0x40005104u
#define CYDEV_IO_PRT_PRT0_SLW 0x40005105u
#define CYDEV_IO_PRT_PRT0_BYP 0x40005106u
#define CYDEV_IO_PRT_PRT0_BIE 0x40005107u
#define CYDEV_IO_PRT_PRT0_INP_DIS 0x40005108u
#define CYDEV_IO_PRT_PRT0_CTL 0x40005109u
#define CYDEV_IO_PRT_PRT0_PRT 0x4000510au
#define CYDEV_IO_PRT_PRT0_BIT_MASK 0x4000510bu
#define CYDEV_IO_PRT_PRT0_AMUX 0x4000510cu
#define CYDEV_IO_PRT_PRT0_AG 0x4000510du
#define CYDEV_IO_PRT_PRT0_LCD_COM_SEG 0x4000510eu
#define CYDEV_IO_PRT_PRT0_LCD_EN 0x4000510fu
#define CYDEV_IO_PRT_PRT1_BASE 0x40005110u
#define CYDEV_IO_PRT_PRT1_SIZE 0x00000010u
#define CYDEV_IO_PRT_PRT1_DR 0x40005110u
#define CYDEV_IO_PRT_PRT1_PS 0x40005111u
#define CYDEV_IO_PRT_PRT1_DM0 0x40005112u
#define CYDEV_IO_PRT_PRT1_DM1 0x40005113u
#define CYDEV_IO_PRT_PRT1_DM2 0x40005114u
#define CYDEV_IO_PRT_PRT1_SLW 0x40005115u
#define CYDEV_IO_PRT_PRT1_BYP 0x40005116u
#define CYDEV_IO_PRT_PRT1_BIE 0x40005117u
#define CYDEV_IO_PRT_PRT1_INP_DIS 0x40005118u
#define CYDEV_IO_PRT_PRT1_CTL 0x40005119u
#define CYDEV_IO_PRT_PRT1_PRT 0x4000511au
#define CYDEV_IO_PRT_PRT1_BIT_MASK 0x4000511bu
#define CYDEV_IO_PRT_PRT1_AMUX 0x4000511cu
#define CYDEV_IO_PRT_PRT1_AG 0x4000511du
#define CYDEV_IO_PRT_PRT1_LCD_COM_SEG 0x4000511eu
#define CYDEV_IO_PRT_PRT1_LCD_EN 0x4000511fu
#define CYDEV_IO_PRT_PRT2_BASE 0x40005120u
#define CYDEV_IO_PRT_PRT2_SIZE 0x00000010u
#define CYDEV_IO_PRT_PRT2_DR 0x40005120u
#define CYDEV_IO_PRT_PRT2_PS 0x40005121u
#define CYDEV_IO_PRT_PRT2_DM0 0x40005122u
#define CYDEV_IO_PRT_PRT2_DM1 0x40005123u
#define CYDEV_IO_PRT_PRT2_DM2 0x40005124u
#define CYDEV_IO_PRT_PRT2_SLW 0x40005125u
#define CYDEV_IO_PRT_PRT2_BYP 0x40005126u
#define CYDEV_IO_PRT_PRT2_BIE 0x40005127u
#define CYDEV_IO_PRT_PRT2_INP_DIS 0x40005128u
#define CYDEV_IO_PRT_PRT2_CTL 0x40005129u
#define CYDEV_IO_PRT_PRT2_PRT 0x4000512au
#define CYDEV_IO_PRT_PRT2_BIT_MASK 0x4000512bu
#define CYDEV_IO_PRT_PRT2_AMUX 0x4000512cu
#define CYDEV_IO_PRT_PRT2_AG 0x4000512du
#define CYDEV_IO_PRT_PRT2_LCD_COM_SEG 0x4000512eu
#define CYDEV_IO_PRT_PRT2_LCD_EN 0x4000512fu
#define CYDEV_IO_PRT_PRT3_BASE 0x40005130u
#define CYDEV_IO_PRT_PRT3_SIZE 0x00000010u
#define CYDEV_IO_PRT_PRT3_DR 0x40005130u
#define CYDEV_IO_PRT_PRT3_PS 0x40005131u
#define CYDEV_IO_PRT_PRT3_DM0 0x40005132u
#define CYDEV_IO_PRT_PRT3_DM1 0x40005133u
#define CYDEV_IO_PRT_PRT3_DM2 0x40005134u
#define CYDEV_IO_PRT_PRT3_SLW 0x40005135u
#define CYDEV_IO_PRT_PRT3_BYP 0x40005136u
#define CYDEV_IO_PRT_PRT3_BIE 0x40005137u
#define CYDEV_IO_PRT_PRT3_INP_DIS 0x40005138u
#define CYDEV_IO_PRT_PRT3_CTL 0x40005139u
#define CYDEV_IO_PRT_PRT3_PRT 0x4000513au
#define CYDEV_IO_PRT_PRT3_BIT_MASK 0x4000513bu
#define CYDEV_IO_PRT_PRT3_AMUX 0x4000513cu
#define CYDEV_IO_PRT_PRT3_AG 0x4000513du
#define CYDEV_IO_PRT_PRT3_LCD_COM_SEG 0x4000513eu
#define CYDEV_IO_PRT_PRT3_LCD_EN 0x4000513fu
#define CYDEV_IO_PRT_PRT4_BASE 0x40005140u
#define CYDEV_IO_PRT_PRT4_SIZE 0x00000010u
#define CYDEV_IO_PRT_PRT4_DR 0x40005140u
#define CYDEV_IO_PRT_PRT4_PS 0x40005141u
#define CYDEV_IO_PRT_PRT4_DM0 0x40005142u
#define CYDEV_IO_PRT_PRT4_DM1 0x40005143u
#define CYDEV_IO_PRT_PRT4_DM2 0x40005144u
#define CYDEV_IO_PRT_PRT4_SLW 0x40005145u
#define CYDEV_IO_PRT_PRT4_BYP 0x40005146u
#define CYDEV_IO_PRT_PRT4_BIE 0x40005147u
#define CYDEV_IO_PRT_PRT4_INP_DIS 0x40005148u
#define CYDEV_IO_PRT_PRT4_CTL 0x40005149u
#define CYDEV_IO_PRT_PRT4_PRT 0x4000514au
#define CYDEV_IO_PRT_PRT4_BIT_MASK 0x4000514bu
#define CYDEV_IO_PRT_PRT4_AMUX 0x4000514cu
#define CYDEV_IO_PRT_PRT4_AG 0x4000514du
#define CYDEV_IO_PRT_PRT4_LCD_COM_SEG 0x4000514eu
#define CYDEV_IO_PRT_PRT4_LCD_EN 0x4000514fu
#define CYDEV_IO_PRT_PRT5_BASE 0x40005150u
#define CYDEV_IO_PRT_PRT5_SIZE 0x00000010u
#define CYDEV_IO_PRT_PRT5_DR 0x40005150u
#define CYDEV_IO_PRT_PRT5_PS 0x40005151u
#define CYDEV_IO_PRT_PRT5_DM0 0x40005152u
#define CYDEV_IO_PRT_PRT5_DM1 0x40005153u
#define CYDEV_IO_PRT_PRT5_DM2 0x40005154u
#define CYDEV_IO_PRT_PRT5_SLW 0x40005155u
#define CYDEV_IO_PRT_PRT5_BYP 0x40005156u
#define CYDEV_IO_PRT_PRT5_BIE 0x40005157u
#define CYDEV_IO_PRT_PRT5_INP_DIS 0x40005158u
#define CYDEV_IO_PRT_PRT5_CTL 0x40005159u
#define CYDEV_IO_PRT_PRT5_PRT 0x4000515au
#define CYDEV_IO_PRT_PRT5_BIT_MASK 0x4000515bu
#define CYDEV_IO_PRT_PRT5_AMUX 0x4000515cu
#define CYDEV_IO_PRT_PRT5_AG 0x4000515du
#define CYDEV_IO_PRT_PRT5_LCD_COM_SEG 0x4000515eu
#define CYDEV_IO_PRT_PRT5_LCD_EN 0x4000515fu
#define CYDEV_IO_PRT_PRT6_BASE 0x40005160u
#define CYDEV_IO_PRT_PRT6_SIZE 0x00000010u
#define CYDEV_IO_PRT_PRT6_DR 0x40005160u
#define CYDEV_IO_PRT_PRT6_PS 0x40005161u
#define CYDEV_IO_PRT_PRT6_DM0 0x40005162u
#define CYDEV_IO_PRT_PRT6_DM1 0x40005163u
#define CYDEV_IO_PRT_PRT6_DM2 0x40005164u
#define CYDEV_IO_PRT_PRT6_SLW 0x40005165u
#define CYDEV_IO_PRT_PRT6_BYP 0x40005166u
#define CYDEV_IO_PRT_PRT6_BIE 0x40005167u
#define CYDEV_IO_PRT_PRT6_INP_DIS 0x40005168u
#define CYDEV_IO_PRT_PRT6_CTL 0x40005169u
#define CYDEV_IO_PRT_PRT6_PRT 0x4000516au
#define CYDEV_IO_PRT_PRT6_BIT_MASK 0x4000516bu
#define CYDEV_IO_PRT_PRT6_AMUX 0x4000516cu
#define CYDEV_IO_PRT_PRT6_AG 0x4000516du
#define CYDEV_IO_PRT_PRT6_LCD_COM_SEG 0x4000516eu
#define CYDEV_IO_PRT_PRT6_LCD_EN 0x4000516fu
#define CYDEV_IO_PRT_PRT12_BASE 0x400051c0u
#define CYDEV_IO_PRT_PRT12_SIZE 0x00000010u
#define CYDEV_IO_PRT_PRT12_DR 0x400051c0u
#define CYDEV_IO_PRT_PRT12_PS 0x400051c1u
#define CYDEV_IO_PRT_PRT12_DM0 0x400051c2u
#define CYDEV_IO_PRT_PRT12_DM1 0x400051c3u
#define CYDEV_IO_PRT_PRT12_DM2 0x400051c4u
#define CYDEV_IO_PRT_PRT12_SLW 0x400051c5u
#define CYDEV_IO_PRT_PRT12_BYP 0x400051c6u
#define CYDEV_IO_PRT_PRT12_BIE 0x400051c7u
#define CYDEV_IO_PRT_PRT12_INP_DIS 0x400051c8u
#define CYDEV_IO_PRT_PRT12_SIO_HYST_EN 0x400051c9u
#define CYDEV_IO_PRT_PRT12_PRT 0x400051cau
#define CYDEV_IO_PRT_PRT12_BIT_MASK 0x400051cbu
#define CYDEV_IO_PRT_PRT12_SIO_REG_HIFREQ 0x400051ccu
#define CYDEV_IO_PRT_PRT12_AG 0x400051cdu
#define CYDEV_IO_PRT_PRT12_SIO_CFG 0x400051ceu
#define CYDEV_IO_PRT_PRT12_SIO_DIFF 0x400051cfu
#define CYDEV_IO_PRT_PRT15_BASE 0x400051f0u
#define CYDEV_IO_PRT_PRT15_SIZE 0x00000010u
#define CYDEV_IO_PRT_PRT15_DR 0x400051f0u
#define CYDEV_IO_PRT_PRT15_PS 0x400051f1u
#define CYDEV_IO_PRT_PRT15_DM0 0x400051f2u
#define CYDEV_IO_PRT_PRT15_DM1 0x400051f3u
#define CYDEV_IO_PRT_PRT15_DM2 0x400051f4u
#define CYDEV_IO_PRT_PRT15_SLW 0x400051f5u
#define CYDEV_IO_PRT_PRT15_BYP 0x400051f6u
#define CYDEV_IO_PRT_PRT15_BIE 0x400051f7u
#define CYDEV_IO_PRT_PRT15_INP_DIS 0x400051f8u
#define CYDEV_IO_PRT_PRT15_CTL 0x400051f9u
#define CYDEV_IO_PRT_PRT15_PRT 0x400051fau
#define CYDEV_IO_PRT_PRT15_BIT_MASK 0x400051fbu
#define CYDEV_IO_PRT_PRT15_AMUX 0x400051fcu
#define CYDEV_IO_PRT_PRT15_AG 0x400051fdu
#define CYDEV_IO_PRT_PRT15_LCD_COM_SEG 0x400051feu
#define CYDEV_IO_PRT_PRT15_LCD_EN 0x400051ffu
#define CYDEV_PRTDSI_BASE 0x40005200u
#define CYDEV_PRTDSI_SIZE 0x0000007fu
#define CYDEV_PRTDSI_PRT0_BASE 0x40005200u
#define CYDEV_PRTDSI_PRT0_SIZE 0x00000007u
#define CYDEV_PRTDSI_PRT0_OUT_SEL0 0x40005200u
#define CYDEV_PRTDSI_PRT0_OUT_SEL1 0x40005201u
#define CYDEV_PRTDSI_PRT0_OE_SEL0 0x40005202u
#define CYDEV_PRTDSI_PRT0_OE_SEL1 0x40005203u
#define CYDEV_PRTDSI_PRT0_DBL_SYNC_IN 0x40005204u
#define CYDEV_PRTDSI_PRT0_SYNC_OUT 0x40005205u
#define CYDEV_PRTDSI_PRT0_CAPS_SEL 0x40005206u
#define CYDEV_PRTDSI_PRT1_BASE 0x40005208u
#define CYDEV_PRTDSI_PRT1_SIZE 0x00000007u
#define CYDEV_PRTDSI_PRT1_OUT_SEL0 0x40005208u
#define CYDEV_PRTDSI_PRT1_OUT_SEL1 0x40005209u
#define CYDEV_PRTDSI_PRT1_OE_SEL0 0x4000520au
#define CYDEV_PRTDSI_PRT1_OE_SEL1 0x4000520bu
#define CYDEV_PRTDSI_PRT1_DBL_SYNC_IN 0x4000520cu
#define CYDEV_PRTDSI_PRT1_SYNC_OUT 0x4000520du
#define CYDEV_PRTDSI_PRT1_CAPS_SEL 0x4000520eu
#define CYDEV_PRTDSI_PRT2_BASE 0x40005210u
#define CYDEV_PRTDSI_PRT2_SIZE 0x00000007u
#define CYDEV_PRTDSI_PRT2_OUT_SEL0 0x40005210u
#define CYDEV_PRTDSI_PRT2_OUT_SEL1 0x40005211u
#define CYDEV_PRTDSI_PRT2_OE_SEL0 0x40005212u
#define CYDEV_PRTDSI_PRT2_OE_SEL1 0x40005213u
#define CYDEV_PRTDSI_PRT2_DBL_SYNC_IN 0x40005214u
#define CYDEV_PRTDSI_PRT2_SYNC_OUT 0x40005215u
#define CYDEV_PRTDSI_PRT2_CAPS_SEL 0x40005216u
#define CYDEV_PRTDSI_PRT3_BASE 0x40005218u
#define CYDEV_PRTDSI_PRT3_SIZE 0x00000007u
#define CYDEV_PRTDSI_PRT3_OUT_SEL0 0x40005218u
#define CYDEV_PRTDSI_PRT3_OUT_SEL1 0x40005219u
#define CYDEV_PRTDSI_PRT3_OE_SEL0 0x4000521au
#define CYDEV_PRTDSI_PRT3_OE_SEL1 0x4000521bu
#define CYDEV_PRTDSI_PRT3_DBL_SYNC_IN 0x4000521cu
#define CYDEV_PRTDSI_PRT3_SYNC_OUT 0x4000521du
#define CYDEV_PRTDSI_PRT3_CAPS_SEL 0x4000521eu
#define CYDEV_PRTDSI_PRT4_BASE 0x40005220u
#define CYDEV_PRTDSI_PRT4_SIZE 0x00000007u
#define CYDEV_PRTDSI_PRT4_OUT_SEL0 0x40005220u
#define CYDEV_PRTDSI_PRT4_OUT_SEL1 0x40005221u
#define CYDEV_PRTDSI_PRT4_OE_SEL0 0x40005222u
#define CYDEV_PRTDSI_PRT4_OE_SEL1 0x40005223u
#define CYDEV_PRTDSI_PRT4_DBL_SYNC_IN 0x40005224u
#define CYDEV_PRTDSI_PRT4_SYNC_OUT 0x40005225u
#define CYDEV_PRTDSI_PRT4_CAPS_SEL 0x40005226u
#define CYDEV_PRTDSI_PRT5_BASE 0x40005228u
#define CYDEV_PRTDSI_PRT5_SIZE 0x00000007u
#define CYDEV_PRTDSI_PRT5_OUT_SEL0 0x40005228u
#define CYDEV_PRTDSI_PRT5_OUT_SEL1 0x40005229u
#define CYDEV_PRTDSI_PRT5_OE_SEL0 0x4000522au
#define CYDEV_PRTDSI_PRT5_OE_SEL1 0x4000522bu
#define CYDEV_PRTDSI_PRT5_DBL_SYNC_IN 0x4000522cu
#define CYDEV_PRTDSI_PRT5_SYNC_OUT 0x4000522du
#define CYDEV_PRTDSI_PRT5_CAPS_SEL 0x4000522eu
#define CYDEV_PRTDSI_PRT6_BASE 0x40005230u
#define CYDEV_PRTDSI_PRT6_SIZE 0x00000007u
#define CYDEV_PRTDSI_PRT6_OUT_SEL0 0x40005230u
#define CYDEV_PRTDSI_PRT6_OUT_SEL1 0x40005231u
#define CYDEV_PRTDSI_PRT6_OE_SEL0 0x40005232u
#define CYDEV_PRTDSI_PRT6_OE_SEL1 0x40005233u
#define CYDEV_PRTDSI_PRT6_DBL_SYNC_IN 0x40005234u
#define CYDEV_PRTDSI_PRT6_SYNC_OUT 0x40005235u
#define CYDEV_PRTDSI_PRT6_CAPS_SEL 0x40005236u
#define CYDEV_PRTDSI_PRT12_BASE 0x40005260u
#define CYDEV_PRTDSI_PRT12_SIZE 0x00000006u
#define CYDEV_PRTDSI_PRT12_OUT_SEL0 0x40005260u
#define CYDEV_PRTDSI_PRT12_OUT_SEL1 0x40005261u
#define CYDEV_PRTDSI_PRT12_OE_SEL0 0x40005262u
#define CYDEV_PRTDSI_PRT12_OE_SEL1 0x40005263u
#define CYDEV_PRTDSI_PRT12_DBL_SYNC_IN 0x40005264u
#define CYDEV_PRTDSI_PRT12_SYNC_OUT 0x40005265u
#define CYDEV_PRTDSI_PRT15_BASE 0x40005278u
#define CYDEV_PRTDSI_PRT15_SIZE 0x00000007u
#define CYDEV_PRTDSI_PRT15_OUT_SEL0 0x40005278u
#define CYDEV_PRTDSI_PRT15_OUT_SEL1 0x40005279u
#define CYDEV_PRTDSI_PRT15_OE_SEL0 0x4000527au
#define CYDEV_PRTDSI_PRT15_OE_SEL1 0x4000527bu
#define CYDEV_PRTDSI_PRT15_DBL_SYNC_IN 0x4000527cu
#define CYDEV_PRTDSI_PRT15_SYNC_OUT 0x4000527du
#define CYDEV_PRTDSI_PRT15_CAPS_SEL 0x4000527eu
#define CYDEV_EMIF_BASE 0x40005400u
#define CYDEV_EMIF_SIZE 0x00000005u
#define CYDEV_EMIF_NO_UDB 0x40005400u
#define CYDEV_EMIF_WAIT_STATES 0x40005401u
#define CYDEV_EMIF_MEM_DWN 0x40005402u
#define CYDEV_EMIF_MEMCLK_DIV 0x40005403u
#define CYDEV_EMIF_CLOCK_EN 0x40005404u
#define CYDEV_ANAIF_BASE 0x40005800u
#define CYDEV_ANAIF_SIZE 0x000003a9u
#define CYDEV_ANAIF_CFG_BASE 0x40005800u
#define CYDEV_ANAIF_CFG_SIZE 0x00000110u
#define CYDEV_ANAIF_CFG_SC0_BASE 0x40005800u
#define CYDEV_ANAIF_CFG_SC0_SIZE 0x00000003u
#define CYDEV_ANAIF_CFG_SC0_CR0 0x40005800u
#define CYDEV_ANAIF_CFG_SC0_CR1 0x40005801u
#define CYDEV_ANAIF_CFG_SC0_CR2 0x40005802u
#define CYDEV_ANAIF_CFG_SC1_BASE 0x40005804u
#define CYDEV_ANAIF_CFG_SC1_SIZE 0x00000003u
#define CYDEV_ANAIF_CFG_SC1_CR0 0x40005804u
#define CYDEV_ANAIF_CFG_SC1_CR1 0x40005805u
#define CYDEV_ANAIF_CFG_SC1_CR2 0x40005806u
#define CYDEV_ANAIF_CFG_SC2_BASE 0x40005808u
#define CYDEV_ANAIF_CFG_SC2_SIZE 0x00000003u
#define CYDEV_ANAIF_CFG_SC2_CR0 0x40005808u
#define CYDEV_ANAIF_CFG_SC2_CR1 0x40005809u
#define CYDEV_ANAIF_CFG_SC2_CR2 0x4000580au
#define CYDEV_ANAIF_CFG_SC3_BASE 0x4000580cu
#define CYDEV_ANAIF_CFG_SC3_SIZE 0x00000003u
#define CYDEV_ANAIF_CFG_SC3_CR0 0x4000580cu
#define CYDEV_ANAIF_CFG_SC3_CR1 0x4000580du
#define CYDEV_ANAIF_CFG_SC3_CR2 0x4000580eu
#define CYDEV_ANAIF_CFG_DAC0_BASE 0x40005820u
#define CYDEV_ANAIF_CFG_DAC0_SIZE 0x00000003u
#define CYDEV_ANAIF_CFG_DAC0_CR0 0x40005820u
#define CYDEV_ANAIF_CFG_DAC0_CR1 0x40005821u
#define CYDEV_ANAIF_CFG_DAC0_TST 0x40005822u
#define CYDEV_ANAIF_CFG_DAC1_BASE 0x40005824u
#define CYDEV_ANAIF_CFG_DAC1_SIZE 0x00000003u
#define CYDEV_ANAIF_CFG_DAC1_CR0 0x40005824u
#define CYDEV_ANAIF_CFG_DAC1_CR1 0x40005825u
#define CYDEV_ANAIF_CFG_DAC1_TST 0x40005826u
#define CYDEV_ANAIF_CFG_DAC2_BASE 0x40005828u
#define CYDEV_ANAIF_CFG_DAC2_SIZE 0x00000003u
#define CYDEV_ANAIF_CFG_DAC2_CR0 0x40005828u
#define CYDEV_ANAIF_CFG_DAC2_CR1 0x40005829u
#define CYDEV_ANAIF_CFG_DAC2_TST 0x4000582au
#define CYDEV_ANAIF_CFG_DAC3_BASE 0x4000582cu
#define CYDEV_ANAIF_CFG_DAC3_SIZE 0x00000003u
#define CYDEV_ANAIF_CFG_DAC3_CR0 0x4000582cu
#define CYDEV_ANAIF_CFG_DAC3_CR1 0x4000582du
#define CYDEV_ANAIF_CFG_DAC3_TST 0x4000582eu
#define CYDEV_ANAIF_CFG_CMP0_BASE 0x40005840u
#define CYDEV_ANAIF_CFG_CMP0_SIZE 0x00000001u
#define CYDEV_ANAIF_CFG_CMP0_CR 0x40005840u
#define CYDEV_ANAIF_CFG_CMP1_BASE 0x40005841u
#define CYDEV_ANAIF_CFG_CMP1_SIZE 0x00000001u
#define CYDEV_ANAIF_CFG_CMP1_CR 0x40005841u
#define CYDEV_ANAIF_CFG_CMP2_BASE 0x40005842u
#define CYDEV_ANAIF_CFG_CMP2_SIZE 0x00000001u
#define CYDEV_ANAIF_CFG_CMP2_CR 0x40005842u
#define CYDEV_ANAIF_CFG_CMP3_BASE 0x40005843u
#define CYDEV_ANAIF_CFG_CMP3_SIZE 0x00000001u
#define CYDEV_ANAIF_CFG_CMP3_CR 0x40005843u
#define CYDEV_ANAIF_CFG_LUT0_BASE 0x40005848u
#define CYDEV_ANAIF_CFG_LUT0_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_LUT0_CR 0x40005848u
#define CYDEV_ANAIF_CFG_LUT0_MX 0x40005849u
#define CYDEV_ANAIF_CFG_LUT1_BASE 0x4000584au
#define CYDEV_ANAIF_CFG_LUT1_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_LUT1_CR 0x4000584au
#define CYDEV_ANAIF_CFG_LUT1_MX 0x4000584bu
#define CYDEV_ANAIF_CFG_LUT2_BASE 0x4000584cu
#define CYDEV_ANAIF_CFG_LUT2_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_LUT2_CR 0x4000584cu
#define CYDEV_ANAIF_CFG_LUT2_MX 0x4000584du
#define CYDEV_ANAIF_CFG_LUT3_BASE 0x4000584eu
#define CYDEV_ANAIF_CFG_LUT3_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_LUT3_CR 0x4000584eu
#define CYDEV_ANAIF_CFG_LUT3_MX 0x4000584fu
#define CYDEV_ANAIF_CFG_ABUF0_BASE 0x40005858u
#define CYDEV_ANAIF_CFG_ABUF0_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_ABUF0_CR 0x40005858u
#define CYDEV_ANAIF_CFG_ABUF0_RSVD 0x40005859u
