MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
#define CYDEV_ANAIF_CFG_ABUF1_BASE 0x4000585au
#define CYDEV_ANAIF_CFG_ABUF1_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_ABUF1_CR 0x4000585au
#define CYDEV_ANAIF_CFG_ABUF1_RSVD 0x4000585bu
#define CYDEV_ANAIF_CFG_ABUF2_BASE 0x4000585cu
#define CYDEV_ANAIF_CFG_ABUF2_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_ABUF2_CR 0x4000585cu
#define CYDEV_ANAIF_CFG_ABUF2_RSVD 0x4000585du
#define CYDEV_ANAIF_CFG_ABUF3_BASE 0x4000585eu
#define CYDEV_ANAIF_CFG_ABUF3_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_ABUF3_CR 0x4000585eu
#define CYDEV_ANAIF_CFG_ABUF3_RSVD 0x4000585fu
#define CYDEV_ANAIF_CFG_LCDDAC_BASE 0x40005868u
#define CYDEV_ANAIF_CFG_LCDDAC_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_LCDDAC_CR0 0x40005868u
#define CYDEV_ANAIF_CFG_LCDDAC_CR1 0x40005869u
#define CYDEV_ANAIF_CFG_LCDDRV_BASE 0x4000586au
#define CYDEV_ANAIF_CFG_LCDDRV_SIZE 0x00000001u
#define CYDEV_ANAIF_CFG_LCDDRV_CR 0x4000586au
#define CYDEV_ANAIF_CFG_BG_BASE 0x4000586cu
#define CYDEV_ANAIF_CFG_BG_SIZE 0x00000004u
#define CYDEV_ANAIF_CFG_BG_CR0 0x4000586cu
#define CYDEV_ANAIF_CFG_BG_RSVD 0x4000586du
#define CYDEV_ANAIF_CFG_BG_DFT0 0x4000586eu
#define CYDEV_ANAIF_CFG_BG_DFT1 0x4000586fu
#define CYDEV_ANAIF_CFG_CAPSL_BASE 0x40005870u
#define CYDEV_ANAIF_CFG_CAPSL_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_CAPSL_CFG0 0x40005870u
#define CYDEV_ANAIF_CFG_CAPSL_CFG1 0x40005871u
#define CYDEV_ANAIF_CFG_CAPSR_BASE 0x40005872u
#define CYDEV_ANAIF_CFG_CAPSR_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_CAPSR_CFG0 0x40005872u
#define CYDEV_ANAIF_CFG_CAPSR_CFG1 0x40005873u
#define CYDEV_ANAIF_CFG_CAPS_BASE 0x40005874u
#define CYDEV_ANAIF_CFG_CAPS_SIZE 0x00000001u
#define CYDEV_ANAIF_CFG_CAPS_DFT 0x40005874u
#define CYDEV_ANAIF_CFG_PUMP_BASE 0x40005876u
#define CYDEV_ANAIF_CFG_PUMP_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_PUMP_CR0 0x40005876u
#define CYDEV_ANAIF_CFG_PUMP_CR1 0x40005877u
#define CYDEV_ANAIF_CFG_LPF0_BASE 0x40005878u
#define CYDEV_ANAIF_CFG_LPF0_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_LPF0_CR0 0x40005878u
#define CYDEV_ANAIF_CFG_LPF0_RSVD 0x40005879u
#define CYDEV_ANAIF_CFG_LPF1_BASE 0x4000587au
#define CYDEV_ANAIF_CFG_LPF1_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_LPF1_CR0 0x4000587au
#define CYDEV_ANAIF_CFG_LPF1_RSVD 0x4000587bu
#define CYDEV_ANAIF_CFG_MISC_BASE 0x4000587cu
#define CYDEV_ANAIF_CFG_MISC_SIZE 0x00000001u
#define CYDEV_ANAIF_CFG_MISC_CR0 0x4000587cu
#define CYDEV_ANAIF_CFG_TFAULT_BASE 0x4000587eu
#define CYDEV_ANAIF_CFG_TFAULT_SIZE 0x00000002u
#define CYDEV_ANAIF_CFG_TFAULT_CR0 0x4000587eu
#define CYDEV_ANAIF_CFG_TFAULT_CR1 0x4000587fu
#define CYDEV_ANAIF_CFG_DSM0_BASE 0x40005880u
#define CYDEV_ANAIF_CFG_DSM0_SIZE 0x00000020u
#define CYDEV_ANAIF_CFG_DSM0_CR0 0x40005880u
#define CYDEV_ANAIF_CFG_DSM0_CR1 0x40005881u
#define CYDEV_ANAIF_CFG_DSM0_CR2 0x40005882u
#define CYDEV_ANAIF_CFG_DSM0_CR3 0x40005883u
#define CYDEV_ANAIF_CFG_DSM0_CR4 0x40005884u
#define CYDEV_ANAIF_CFG_DSM0_CR5 0x40005885u
#define CYDEV_ANAIF_CFG_DSM0_CR6 0x40005886u
#define CYDEV_ANAIF_CFG_DSM0_CR7 0x40005887u
#define CYDEV_ANAIF_CFG_DSM0_CR8 0x40005888u
#define CYDEV_ANAIF_CFG_DSM0_CR9 0x40005889u
#define CYDEV_ANAIF_CFG_DSM0_CR10 0x4000588au
#define CYDEV_ANAIF_CFG_DSM0_CR11 0x4000588bu
#define CYDEV_ANAIF_CFG_DSM0_CR12 0x4000588cu
#define CYDEV_ANAIF_CFG_DSM0_CR13 0x4000588du
#define CYDEV_ANAIF_CFG_DSM0_CR14 0x4000588eu
#define CYDEV_ANAIF_CFG_DSM0_CR15 0x4000588fu
#define CYDEV_ANAIF_CFG_DSM0_CR16 0x40005890u
#define CYDEV_ANAIF_CFG_DSM0_CR17 0x40005891u
#define CYDEV_ANAIF_CFG_DSM0_REF0 0x40005892u
#define CYDEV_ANAIF_CFG_DSM0_REF1 0x40005893u
#define CYDEV_ANAIF_CFG_DSM0_REF2 0x40005894u
#define CYDEV_ANAIF_CFG_DSM0_REF3 0x40005895u
#define CYDEV_ANAIF_CFG_DSM0_DEM0 0x40005896u
#define CYDEV_ANAIF_CFG_DSM0_DEM1 0x40005897u
#define CYDEV_ANAIF_CFG_DSM0_TST0 0x40005898u
#define CYDEV_ANAIF_CFG_DSM0_TST1 0x40005899u
#define CYDEV_ANAIF_CFG_DSM0_BUF0 0x4000589au
#define CYDEV_ANAIF_CFG_DSM0_BUF1 0x4000589bu
#define CYDEV_ANAIF_CFG_DSM0_BUF2 0x4000589cu
#define CYDEV_ANAIF_CFG_DSM0_BUF3 0x4000589du
#define CYDEV_ANAIF_CFG_DSM0_MISC 0x4000589eu
#define CYDEV_ANAIF_CFG_DSM0_RSVD1 0x4000589fu
#define CYDEV_ANAIF_CFG_SAR0_BASE 0x40005900u
#define CYDEV_ANAIF_CFG_SAR0_SIZE 0x00000008u
#define CYDEV_ANAIF_CFG_SAR0_CSR0 0x40005900u
#define CYDEV_ANAIF_CFG_SAR0_CSR1 0x40005901u
#define CYDEV_ANAIF_CFG_SAR0_CSR2 0x40005902u
#define CYDEV_ANAIF_CFG_SAR0_CSR3 0x40005903u
#define CYDEV_ANAIF_CFG_SAR0_CSR4 0x40005904u
#define CYDEV_ANAIF_CFG_SAR0_CSR5 0x40005905u
#define CYDEV_ANAIF_CFG_SAR0_CSR6 0x40005906u
#define CYDEV_ANAIF_CFG_SAR0_CSR7 0x40005907u
#define CYDEV_ANAIF_CFG_SAR1_BASE 0x40005908u
#define CYDEV_ANAIF_CFG_SAR1_SIZE 0x00000008u
#define CYDEV_ANAIF_CFG_SAR1_CSR0 0x40005908u
#define CYDEV_ANAIF_CFG_SAR1_CSR1 0x40005909u
#define CYDEV_ANAIF_CFG_SAR1_CSR2 0x4000590au
#define CYDEV_ANAIF_CFG_SAR1_CSR3 0x4000590bu
#define CYDEV_ANAIF_CFG_SAR1_CSR4 0x4000590cu
#define CYDEV_ANAIF_CFG_SAR1_CSR5 0x4000590du
#define CYDEV_ANAIF_CFG_SAR1_CSR6 0x4000590eu
#define CYDEV_ANAIF_CFG_SAR1_CSR7 0x4000590fu
#define CYDEV_ANAIF_RT_BASE 0x40005a00u
#define CYDEV_ANAIF_RT_SIZE 0x00000160u
#define CYDEV_ANAIF_RT_SC0_BASE 0x40005a00u
#define CYDEV_ANAIF_RT_SC0_SIZE 0x0000000du
#define CYDEV_ANAIF_RT_SC0_SW0 0x40005a00u
#define CYDEV_ANAIF_RT_SC0_SW2 0x40005a02u
#define CYDEV_ANAIF_RT_SC0_SW3 0x40005a03u
#define CYDEV_ANAIF_RT_SC0_SW4 0x40005a04u
#define CYDEV_ANAIF_RT_SC0_SW6 0x40005a06u
#define CYDEV_ANAIF_RT_SC0_SW7 0x40005a07u
#define CYDEV_ANAIF_RT_SC0_SW8 0x40005a08u
#define CYDEV_ANAIF_RT_SC0_SW10 0x40005a0au
#define CYDEV_ANAIF_RT_SC0_CLK 0x40005a0bu
#define CYDEV_ANAIF_RT_SC0_BST 0x40005a0cu
#define CYDEV_ANAIF_RT_SC1_BASE 0x40005a10u
#define CYDEV_ANAIF_RT_SC1_SIZE 0x0000000du
#define CYDEV_ANAIF_RT_SC1_SW0 0x40005a10u
#define CYDEV_ANAIF_RT_SC1_SW2 0x40005a12u
#define CYDEV_ANAIF_RT_SC1_SW3 0x40005a13u
#define CYDEV_ANAIF_RT_SC1_SW4 0x40005a14u
#define CYDEV_ANAIF_RT_SC1_SW6 0x40005a16u
#define CYDEV_ANAIF_RT_SC1_SW7 0x40005a17u
#define CYDEV_ANAIF_RT_SC1_SW8 0x40005a18u
#define CYDEV_ANAIF_RT_SC1_SW10 0x40005a1au
#define CYDEV_ANAIF_RT_SC1_CLK 0x40005a1bu
#define CYDEV_ANAIF_RT_SC1_BST 0x40005a1cu
#define CYDEV_ANAIF_RT_SC2_BASE 0x40005a20u
#define CYDEV_ANAIF_RT_SC2_SIZE 0x0000000du
#define CYDEV_ANAIF_RT_SC2_SW0 0x40005a20u
#define CYDEV_ANAIF_RT_SC2_SW2 0x40005a22u
#define CYDEV_ANAIF_RT_SC2_SW3 0x40005a23u
#define CYDEV_ANAIF_RT_SC2_SW4 0x40005a24u
#define CYDEV_ANAIF_RT_SC2_SW6 0x40005a26u
#define CYDEV_ANAIF_RT_SC2_SW7 0x40005a27u
#define CYDEV_ANAIF_RT_SC2_SW8 0x40005a28u
#define CYDEV_ANAIF_RT_SC2_SW10 0x40005a2au
#define CYDEV_ANAIF_RT_SC2_CLK 0x40005a2bu
#define CYDEV_ANAIF_RT_SC2_BST 0x40005a2cu
#define CYDEV_ANAIF_RT_SC3_BASE 0x40005a30u
#define CYDEV_ANAIF_RT_SC3_SIZE 0x0000000du
#define CYDEV_ANAIF_RT_SC3_SW0 0x40005a30u
#define CYDEV_ANAIF_RT_SC3_SW2 0x40005a32u
#define CYDEV_ANAIF_RT_SC3_SW3 0x40005a33u
#define CYDEV_ANAIF_RT_SC3_SW4 0x40005a34u
#define CYDEV_ANAIF_RT_SC3_SW6 0x40005a36u
#define CYDEV_ANAIF_RT_SC3_SW7 0x40005a37u
#define CYDEV_ANAIF_RT_SC3_SW8 0x40005a38u
#define CYDEV_ANAIF_RT_SC3_SW10 0x40005a3au
#define CYDEV_ANAIF_RT_SC3_CLK 0x40005a3bu
#define CYDEV_ANAIF_RT_SC3_BST 0x40005a3cu
#define CYDEV_ANAIF_RT_DAC0_BASE 0x40005a80u
#define CYDEV_ANAIF_RT_DAC0_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_DAC0_SW0 0x40005a80u
#define CYDEV_ANAIF_RT_DAC0_SW2 0x40005a82u
#define CYDEV_ANAIF_RT_DAC0_SW3 0x40005a83u
#define CYDEV_ANAIF_RT_DAC0_SW4 0x40005a84u
#define CYDEV_ANAIF_RT_DAC0_STROBE 0x40005a87u
#define CYDEV_ANAIF_RT_DAC1_BASE 0x40005a88u
#define CYDEV_ANAIF_RT_DAC1_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_DAC1_SW0 0x40005a88u
#define CYDEV_ANAIF_RT_DAC1_SW2 0x40005a8au
#define CYDEV_ANAIF_RT_DAC1_SW3 0x40005a8bu
#define CYDEV_ANAIF_RT_DAC1_SW4 0x40005a8cu
#define CYDEV_ANAIF_RT_DAC1_STROBE 0x40005a8fu
#define CYDEV_ANAIF_RT_DAC2_BASE 0x40005a90u
#define CYDEV_ANAIF_RT_DAC2_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_DAC2_SW0 0x40005a90u
#define CYDEV_ANAIF_RT_DAC2_SW2 0x40005a92u
#define CYDEV_ANAIF_RT_DAC2_SW3 0x40005a93u
#define CYDEV_ANAIF_RT_DAC2_SW4 0x40005a94u
#define CYDEV_ANAIF_RT_DAC2_STROBE 0x40005a97u
#define CYDEV_ANAIF_RT_DAC3_BASE 0x40005a98u
#define CYDEV_ANAIF_RT_DAC3_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_DAC3_SW0 0x40005a98u
#define CYDEV_ANAIF_RT_DAC3_SW2 0x40005a9au
#define CYDEV_ANAIF_RT_DAC3_SW3 0x40005a9bu
#define CYDEV_ANAIF_RT_DAC3_SW4 0x40005a9cu
#define CYDEV_ANAIF_RT_DAC3_STROBE 0x40005a9fu
#define CYDEV_ANAIF_RT_CMP0_BASE 0x40005ac0u
#define CYDEV_ANAIF_RT_CMP0_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_CMP0_SW0 0x40005ac0u
#define CYDEV_ANAIF_RT_CMP0_SW2 0x40005ac2u
#define CYDEV_ANAIF_RT_CMP0_SW3 0x40005ac3u
#define CYDEV_ANAIF_RT_CMP0_SW4 0x40005ac4u
#define CYDEV_ANAIF_RT_CMP0_SW6 0x40005ac6u
#define CYDEV_ANAIF_RT_CMP0_CLK 0x40005ac7u
#define CYDEV_ANAIF_RT_CMP1_BASE 0x40005ac8u
#define CYDEV_ANAIF_RT_CMP1_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_CMP1_SW0 0x40005ac8u
#define CYDEV_ANAIF_RT_CMP1_SW2 0x40005acau
#define CYDEV_ANAIF_RT_CMP1_SW3 0x40005acbu
#define CYDEV_ANAIF_RT_CMP1_SW4 0x40005accu
#define CYDEV_ANAIF_RT_CMP1_SW6 0x40005aceu
#define CYDEV_ANAIF_RT_CMP1_CLK 0x40005acfu
#define CYDEV_ANAIF_RT_CMP2_BASE 0x40005ad0u
#define CYDEV_ANAIF_RT_CMP2_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_CMP2_SW0 0x40005ad0u
#define CYDEV_ANAIF_RT_CMP2_SW2 0x40005ad2u
#define CYDEV_ANAIF_RT_CMP2_SW3 0x40005ad3u
#define CYDEV_ANAIF_RT_CMP2_SW4 0x40005ad4u
#define CYDEV_ANAIF_RT_CMP2_SW6 0x40005ad6u
#define CYDEV_ANAIF_RT_CMP2_CLK 0x40005ad7u
#define CYDEV_ANAIF_RT_CMP3_BASE 0x40005ad8u
#define CYDEV_ANAIF_RT_CMP3_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_CMP3_SW0 0x40005ad8u
#define CYDEV_ANAIF_RT_CMP3_SW2 0x40005adau
#define CYDEV_ANAIF_RT_CMP3_SW3 0x40005adbu
#define CYDEV_ANAIF_RT_CMP3_SW4 0x40005adcu
#define CYDEV_ANAIF_RT_CMP3_SW6 0x40005adeu
#define CYDEV_ANAIF_RT_CMP3_CLK 0x40005adfu
#define CYDEV_ANAIF_RT_DSM0_BASE 0x40005b00u
#define CYDEV_ANAIF_RT_DSM0_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_DSM0_SW0 0x40005b00u
#define CYDEV_ANAIF_RT_DSM0_SW2 0x40005b02u
#define CYDEV_ANAIF_RT_DSM0_SW3 0x40005b03u
#define CYDEV_ANAIF_RT_DSM0_SW4 0x40005b04u
#define CYDEV_ANAIF_RT_DSM0_SW6 0x40005b06u
#define CYDEV_ANAIF_RT_DSM0_CLK 0x40005b07u
#define CYDEV_ANAIF_RT_SAR0_BASE 0x40005b20u
#define CYDEV_ANAIF_RT_SAR0_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_SAR0_SW0 0x40005b20u
#define CYDEV_ANAIF_RT_SAR0_SW2 0x40005b22u
#define CYDEV_ANAIF_RT_SAR0_SW3 0x40005b23u
#define CYDEV_ANAIF_RT_SAR0_SW4 0x40005b24u
#define CYDEV_ANAIF_RT_SAR0_SW6 0x40005b26u
#define CYDEV_ANAIF_RT_SAR0_CLK 0x40005b27u
#define CYDEV_ANAIF_RT_SAR1_BASE 0x40005b28u
#define CYDEV_ANAIF_RT_SAR1_SIZE 0x00000008u
#define CYDEV_ANAIF_RT_SAR1_SW0 0x40005b28u
#define CYDEV_ANAIF_RT_SAR1_SW2 0x40005b2au
#define CYDEV_ANAIF_RT_SAR1_SW3 0x40005b2bu
#define CYDEV_ANAIF_RT_SAR1_SW4 0x40005b2cu
#define CYDEV_ANAIF_RT_SAR1_SW6 0x40005b2eu
#define CYDEV_ANAIF_RT_SAR1_CLK 0x40005b2fu
#define CYDEV_ANAIF_RT_ABUF0_BASE 0x40005b40u
#define CYDEV_ANAIF_RT_ABUF0_SIZE 0x00000002u
#define CYDEV_ANAIF_RT_ABUF0_MX 0x40005b40u
#define CYDEV_ANAIF_RT_ABUF0_SW 0x40005b41u
#define CYDEV_ANAIF_RT_ABUF1_BASE 0x40005b42u
#define CYDEV_ANAIF_RT_ABUF1_SIZE 0x00000002u
#define CYDEV_ANAIF_RT_ABUF1_MX 0x40005b42u
#define CYDEV_ANAIF_RT_ABUF1_SW 0x40005b43u
#define CYDEV_ANAIF_RT_ABUF2_BASE 0x40005b44u
#define CYDEV_ANAIF_RT_ABUF2_SIZE 0x00000002u
#define CYDEV_ANAIF_RT_ABUF2_MX 0x40005b44u
#define CYDEV_ANAIF_RT_ABUF2_SW 0x40005b45u
#define CYDEV_ANAIF_RT_ABUF3_BASE 0x40005b46u
#define CYDEV_ANAIF_RT_ABUF3_SIZE 0x00000002u
#define CYDEV_ANAIF_RT_ABUF3_MX 0x40005b46u
#define CYDEV_ANAIF_RT_ABUF3_SW 0x40005b47u
#define CYDEV_ANAIF_RT_LCDDAC_BASE 0x40005b50u
#define CYDEV_ANAIF_RT_LCDDAC_SIZE 0x00000005u
#define CYDEV_ANAIF_RT_LCDDAC_SW0 0x40005b50u
#define CYDEV_ANAIF_RT_LCDDAC_SW1 0x40005b51u
#define CYDEV_ANAIF_RT_LCDDAC_SW2 0x40005b52u
#define CYDEV_ANAIF_RT_LCDDAC_SW3 0x40005b53u
#define CYDEV_ANAIF_RT_LCDDAC_SW4 0x40005b54u
#define CYDEV_ANAIF_RT_SC_BASE 0x40005b56u
#define CYDEV_ANAIF_RT_SC_SIZE 0x00000001u
#define CYDEV_ANAIF_RT_SC_MISC 0x40005b56u
#define CYDEV_ANAIF_RT_BUS_BASE 0x40005b58u
#define CYDEV_ANAIF_RT_BUS_SIZE 0x00000004u
#define CYDEV_ANAIF_RT_BUS_SW0 0x40005b58u
#define CYDEV_ANAIF_RT_BUS_SW2 0x40005b5au
#define CYDEV_ANAIF_RT_BUS_SW3 0x40005b5bu
#define CYDEV_ANAIF_RT_DFT_BASE 0x40005b5cu
#define CYDEV_ANAIF_RT_DFT_SIZE 0x00000004u
#define CYDEV_ANAIF_RT_DFT_CR0 0x40005b5cu
#define CYDEV_ANAIF_RT_DFT_CR1 0x40005b5du
#define CYDEV_ANAIF_RT_DFT_CR2 0x40005b5eu
#define CYDEV_ANAIF_RT_DFT_CR3 0x40005b5fu
#define CYDEV_ANAIF_WRK_BASE 0x40005b80u
#define CYDEV_ANAIF_WRK_SIZE 0x00000029u
#define CYDEV_ANAIF_WRK_DAC0_BASE 0x40005b80u
#define CYDEV_ANAIF_WRK_DAC0_SIZE 0x00000001u
#define CYDEV_ANAIF_WRK_DAC0_D 0x40005b80u
#define CYDEV_ANAIF_WRK_DAC1_BASE 0x40005b81u
#define CYDEV_ANAIF_WRK_DAC1_SIZE 0x00000001u
#define CYDEV_ANAIF_WRK_DAC1_D 0x40005b81u
#define CYDEV_ANAIF_WRK_DAC2_BASE 0x40005b82u
#define CYDEV_ANAIF_WRK_DAC2_SIZE 0x00000001u
#define CYDEV_ANAIF_WRK_DAC2_D 0x40005b82u
#define CYDEV_ANAIF_WRK_DAC3_BASE 0x40005b83u
#define CYDEV_ANAIF_WRK_DAC3_SIZE 0x00000001u
#define CYDEV_ANAIF_WRK_DAC3_D 0x40005b83u
#define CYDEV_ANAIF_WRK_DSM0_BASE 0x40005b88u
#define CYDEV_ANAIF_WRK_DSM0_SIZE 0x00000002u
#define CYDEV_ANAIF_WRK_DSM0_OUT0 0x40005b88u
#define CYDEV_ANAIF_WRK_DSM0_OUT1 0x40005b89u
#define CYDEV_ANAIF_WRK_SC_BASE 0x40005b8cu
#define CYDEV_ANAIF_WRK_SC_SIZE 0x00000002u
#define CYDEV_ANAIF_WRK_SC_SR 0x40005b8cu
#define CYDEV_ANAIF_WRK_SC_MSK 0x40005b8du
#define CYDEV_ANAIF_WRK_LUT_BASE 0x40005b8eu
#define CYDEV_ANAIF_WRK_LUT_SIZE 0x00000002u
#define CYDEV_ANAIF_WRK_LUT_SR 0x40005b8eu
#define CYDEV_ANAIF_WRK_LUT_MSK 0x40005b8fu
#define CYDEV_ANAIF_WRK_CMP_BASE 0x40005b90u
#define CYDEV_ANAIF_WRK_CMP_SIZE 0x00000002u
#define CYDEV_ANAIF_WRK_CMP_WRK 0x40005b90u
#define CYDEV_ANAIF_WRK_CMP_LTRI 0x40005b91u
#define CYDEV_ANAIF_WRK_TFAULT_BASE 0x40005b92u
#define CYDEV_ANAIF_WRK_TFAULT_SIZE 0x00000004u
#define CYDEV_ANAIF_WRK_TFAULT_WRK0 0x40005b92u
#define CYDEV_ANAIF_WRK_TFAULT_WRK1 0x40005b93u
#define CYDEV_ANAIF_WRK_TFAULT_WRK2 0x40005b94u
#define CYDEV_ANAIF_WRK_TFAULT_WRK3 0x40005b95u
#define CYDEV_ANAIF_WRK_SAR0_BASE 0x40005ba0u
#define CYDEV_ANAIF_WRK_SAR0_SIZE 0x00000002u
#define CYDEV_ANAIF_WRK_SAR0_WRK0 0x40005ba0u
#define CYDEV_ANAIF_WRK_SAR0_WRK1 0x40005ba1u
#define CYDEV_ANAIF_WRK_SAR1_BASE 0x40005ba2u
#define CYDEV_ANAIF_WRK_SAR1_SIZE 0x00000002u
#define CYDEV_ANAIF_WRK_SAR1_WRK0 0x40005ba2u
#define CYDEV_ANAIF_WRK_SAR1_WRK1 0x40005ba3u
#define CYDEV_ANAIF_WRK_SARS_BASE 0x40005ba8u
#define CYDEV_ANAIF_WRK_SARS_SIZE 0x00000001u
#define CYDEV_ANAIF_WRK_SARS_SOF 0x40005ba8u
#define CYDEV_USB_BASE 0x40006000u
#define CYDEV_USB_SIZE 0x00000300u
#define CYDEV_USB_EP0_DR0 0x40006000u
#define CYDEV_USB_EP0_DR1 0x40006001u
#define CYDEV_USB_EP0_DR2 0x40006002u
#define CYDEV_USB_EP0_DR3 0x40006003u
#define CYDEV_USB_EP0_DR4 0x40006004u
#define CYDEV_USB_EP0_DR5 0x40006005u
#define CYDEV_USB_EP0_DR6 0x40006006u
#define CYDEV_USB_EP0_DR7 0x40006007u
#define CYDEV_USB_CR0 0x40006008u
#define CYDEV_USB_CR1 0x40006009u
#define CYDEV_USB_SIE_EP_INT_EN 0x4000600au
#define CYDEV_USB_SIE_EP_INT_SR 0x4000600bu
#define CYDEV_USB_SIE_EP1_BASE 0x4000600cu
#define CYDEV_USB_SIE_EP1_SIZE 0x00000003u
#define CYDEV_USB_SIE_EP1_CNT0 0x4000600cu
#define CYDEV_USB_SIE_EP1_CNT1 0x4000600du
#define CYDEV_USB_SIE_EP1_CR0 0x4000600eu
#define CYDEV_USB_USBIO_CR0 0x40006010u
#define CYDEV_USB_USBIO_CR2 0x40006011u
#define CYDEV_USB_USBIO_CR1 0x40006012u
#define CYDEV_USB_SOF0 0x40006018u
#define CYDEV_USB_SOF1 0x40006019u
#define CYDEV_USB_SIE_EP2_BASE 0x4000601cu
#define CYDEV_USB_SIE_EP2_SIZE 0x00000003u
#define CYDEV_USB_SIE_EP2_CNT0 0x4000601cu
#define CYDEV_USB_SIE_EP2_CNT1 0x4000601du
#define CYDEV_USB_SIE_EP2_CR0 0x4000601eu
#define CYDEV_USB_OSCLK_DR0 0x40006020u
#define CYDEV_USB_OSCLK_DR1 0x40006021u
#define CYDEV_USB_EP0_CR 0x40006028u
#define CYDEV_USB_EP0_CNT 0x40006029u
#define CYDEV_USB_SIE_EP3_BASE 0x4000602cu
#define CYDEV_USB_SIE_EP3_SIZE 0x00000003u
#define CYDEV_USB_SIE_EP3_CNT0 0x4000602cu
#define CYDEV_USB_SIE_EP3_CNT1 0x4000602du
#define CYDEV_USB_SIE_EP3_CR0 0x4000602eu
#define CYDEV_USB_SIE_EP4_BASE 0x4000603cu
#define CYDEV_USB_SIE_EP4_SIZE 0x00000003u
#define CYDEV_USB_SIE_EP4_CNT0 0x4000603cu
#define CYDEV_USB_SIE_EP4_CNT1 0x4000603du
#define CYDEV_USB_SIE_EP4_CR0 0x4000603eu
#define CYDEV_USB_SIE_EP5_BASE 0x4000604cu
#define CYDEV_USB_SIE_EP5_SIZE 0x00000003u
#define CYDEV_USB_SIE_EP5_CNT0 0x4000604cu
#define CYDEV_USB_SIE_EP5_CNT1 0x4000604du
#define CYDEV_USB_SIE_EP5_CR0 0x4000604eu
#define CYDEV_USB_SIE_EP6_BASE 0x4000605cu
#define CYDEV_USB_SIE_EP6_SIZE 0x00000003u
#define CYDEV_USB_SIE_EP6_CNT0 0x4000605cu
#define CYDEV_USB_SIE_EP6_CNT1 0x4000605du
#define CYDEV_USB_SIE_EP6_CR0 0x4000605eu
#define CYDEV_USB_SIE_EP7_BASE 0x4000606cu
#define CYDEV_USB_SIE_EP7_SIZE 0x00000003u
#define CYDEV_USB_SIE_EP7_CNT0 0x4000606cu
#define CYDEV_USB_SIE_EP7_CNT1 0x4000606du
#define CYDEV_USB_SIE_EP7_CR0 0x4000606eu
#define CYDEV_USB_SIE_EP8_BASE 0x4000607cu
#define CYDEV_USB_SIE_EP8_SIZE 0x00000003u
#define CYDEV_USB_SIE_EP8_CNT0 0x4000607cu
#define CYDEV_USB_SIE_EP8_CNT1 0x4000607du
#define CYDEV_USB_SIE_EP8_CR0 0x4000607eu
#define CYDEV_USB_ARB_EP1_BASE 0x40006080u
#define CYDEV_USB_ARB_EP1_SIZE 0x00000003u
#define CYDEV_USB_ARB_EP1_CFG 0x40006080u
#define CYDEV_USB_ARB_EP1_INT_EN 0x40006081u
#define CYDEV_USB_ARB_EP1_SR 0x40006082u
#define CYDEV_USB_ARB_RW1_BASE 0x40006084u
#define CYDEV_USB_ARB_RW1_SIZE 0x00000005u
#define CYDEV_USB_ARB_RW1_WA 0x40006084u
#define CYDEV_USB_ARB_RW1_WA_MSB 0x40006085u
#define CYDEV_USB_ARB_RW1_RA 0x40006086u
#define CYDEV_USB_ARB_RW1_RA_MSB 0x40006087u
#define CYDEV_USB_ARB_RW1_DR 0x40006088u
#define CYDEV_USB_BUF_SIZE 0x4000608cu
#define CYDEV_USB_EP_ACTIVE 0x4000608eu
#define CYDEV_USB_EP_TYPE 0x4000608fu
#define CYDEV_USB_ARB_EP2_BASE 0x40006090u
#define CYDEV_USB_ARB_EP2_SIZE 0x00000003u
#define CYDEV_USB_ARB_EP2_CFG 0x40006090u
#define CYDEV_USB_ARB_EP2_INT_EN 0x40006091u
#define CYDEV_USB_ARB_EP2_SR 0x40006092u
#define CYDEV_USB_ARB_RW2_BASE 0x40006094u
#define CYDEV_USB_ARB_RW2_SIZE 0x00000005u
#define CYDEV_USB_ARB_RW2_WA 0x40006094u
#define CYDEV_USB_ARB_RW2_WA_MSB 0x40006095u
#define CYDEV_USB_ARB_RW2_RA 0x40006096u
#define CYDEV_USB_ARB_RW2_RA_MSB 0x40006097u
#define CYDEV_USB_ARB_RW2_DR 0x40006098u
#define CYDEV_USB_ARB_CFG 0x4000609cu
#define CYDEV_USB_USB_CLK_EN 0x4000609du
#define CYDEV_USB_ARB_INT_EN 0x4000609eu
#define CYDEV_USB_ARB_INT_SR 0x4000609fu
#define CYDEV_USB_ARB_EP3_BASE 0x400060a0u
#define CYDEV_USB_ARB_EP3_SIZE 0x00000003u
#define CYDEV_USB_ARB_EP3_CFG 0x400060a0u
#define CYDEV_USB_ARB_EP3_INT_EN 0x400060a1u
#define CYDEV_USB_ARB_EP3_SR 0x400060a2u
#define CYDEV_USB_ARB_RW3_BASE 0x400060a4u
#define CYDEV_USB_ARB_RW3_SIZE 0x00000005u
#define CYDEV_USB_ARB_RW3_WA 0x400060a4u
#define CYDEV_USB_ARB_RW3_WA_MSB 0x400060a5u
#define CYDEV_USB_ARB_RW3_RA 0x400060a6u
#define CYDEV_USB_ARB_RW3_RA_MSB 0x400060a7u
#define CYDEV_USB_ARB_RW3_DR 0x400060a8u
#define CYDEV_USB_CWA 0x400060acu
#define CYDEV_USB_CWA_MSB 0x400060adu
#define CYDEV_USB_ARB_EP4_BASE 0x400060b0u
#define CYDEV_USB_ARB_EP4_SIZE 0x00000003u
#define CYDEV_USB_ARB_EP4_CFG 0x400060b0u
#define CYDEV_USB_ARB_EP4_INT_EN 0x400060b1u
#define CYDEV_USB_ARB_EP4_SR 0x400060b2u
#define CYDEV_USB_ARB_RW4_BASE 0x400060b4u
#define CYDEV_USB_ARB_RW4_SIZE 0x00000005u
#define CYDEV_USB_ARB_RW4_WA 0x400060b4u
#define CYDEV_USB_ARB_RW4_WA_MSB 0x400060b5u
#define CYDEV_USB_ARB_RW4_RA 0x400060b6u
#define CYDEV_USB_ARB_RW4_RA_MSB 0x400060b7u
#define CYDEV_USB_ARB_RW4_DR 0x400060b8u
#define CYDEV_USB_DMA_THRES 0x400060bcu
#define CYDEV_USB_DMA_THRES_MSB 0x400060bdu
#define CYDEV_USB_ARB_EP5_BASE 0x400060c0u
#define CYDEV_USB_ARB_EP5_SIZE 0x00000003u
#define CYDEV_USB_ARB_EP5_CFG 0x400060c0u
#define CYDEV_USB_ARB_EP5_INT_EN 0x400060c1u
#define CYDEV_USB_ARB_EP5_SR 0x400060c2u
#define CYDEV_USB_ARB_RW5_BASE 0x400060c4u
#define CYDEV_USB_ARB_RW5_SIZE 0x00000005u
#define CYDEV_USB_ARB_RW5_WA 0x400060c4u
#define CYDEV_USB_ARB_RW5_WA_MSB 0x400060c5u
#define CYDEV_USB_ARB_RW5_RA 0x400060c6u
#define CYDEV_USB_ARB_RW5_RA_MSB 0x400060c7u
#define CYDEV_USB_ARB_RW5_DR 0x400060c8u
#define CYDEV_USB_BUS_RST_CNT 0x400060ccu
#define CYDEV_USB_ARB_EP6_BASE 0x400060d0u
#define CYDEV_USB_ARB_EP6_SIZE 0x00000003u
#define CYDEV_USB_ARB_EP6_CFG 0x400060d0u
#define CYDEV_USB_ARB_EP6_INT_EN 0x400060d1u
#define CYDEV_USB_ARB_EP6_SR 0x400060d2u
#define CYDEV_USB_ARB_RW6_BASE 0x400060d4u
#define CYDEV_USB_ARB_RW6_SIZE 0x00000005u
#define CYDEV_USB_ARB_RW6_WA 0x400060d4u
#define CYDEV_USB_ARB_RW6_WA_MSB 0x400060d5u
#define CYDEV_USB_ARB_RW6_RA 0x400060d6u
#define CYDEV_USB_ARB_RW6_RA_MSB 0x400060d7u
#define CYDEV_USB_ARB_RW6_DR 0x400060d8u
#define CYDEV_USB_ARB_EP7_BASE 0x400060e0u
#define CYDEV_USB_ARB_EP7_SIZE 0x00000003u
#define CYDEV_USB_ARB_EP7_CFG 0x400060e0u
#define CYDEV_USB_ARB_EP7_INT_EN 0x400060e1u
#define CYDEV_USB_ARB_EP7_SR 0x400060e2u
#define CYDEV_USB_ARB_RW7_BASE 0x400060e4u
#define CYDEV_USB_ARB_RW7_SIZE 0x00000005u
#define CYDEV_USB_ARB_RW7_WA 0x400060e4u
#define CYDEV_USB_ARB_RW7_WA_MSB 0x400060e5u
#define CYDEV_USB_ARB_RW7_RA 0x400060e6u
#define CYDEV_USB_ARB_RW7_RA_MSB 0x400060e7u
#define CYDEV_USB_ARB_RW7_DR 0x400060e8u
#define CYDEV_USB_ARB_EP8_BASE 0x400060f0u
#define CYDEV_USB_ARB_EP8_SIZE 0x00000003u
#define CYDEV_USB_ARB_EP8_CFG 0x400060f0u
#define CYDEV_USB_ARB_EP8_INT_EN 0x400060f1u
#define CYDEV_USB_ARB_EP8_SR 0x400060f2u
#define CYDEV_USB_ARB_RW8_BASE 0x400060f4u
#define CYDEV_USB_ARB_RW8_SIZE 0x00000005u
#define CYDEV_USB_ARB_RW8_WA 0x400060f4u
#define CYDEV_USB_ARB_RW8_WA_MSB 0x400060f5u
#define CYDEV_USB_ARB_RW8_RA 0x400060f6u
#define CYDEV_USB_ARB_RW8_RA_MSB 0x400060f7u
#define CYDEV_USB_ARB_RW8_DR 0x400060f8u
#define CYDEV_USB_MEM_BASE 0x40006100u
#define CYDEV_USB_MEM_SIZE 0x00000200u
#define CYDEV_USB_MEM_DATA_MBASE 0x40006100u
#define CYDEV_USB_MEM_DATA_MSIZE 0x00000200u
#define CYDEV_UWRK_BASE 0x40006400u
#define CYDEV_UWRK_SIZE 0x00000b60u
#define CYDEV_UWRK_UWRK8_BASE 0x40006400u
#define CYDEV_UWRK_UWRK8_SIZE 0x000003b0u
#define CYDEV_UWRK_UWRK8_B0_BASE 0x40006400u
#define CYDEV_UWRK_UWRK8_B0_SIZE 0x000000b0u
#define CYDEV_UWRK_UWRK8_B0_UDB00_A0 0x40006400u
#define CYDEV_UWRK_UWRK8_B0_UDB01_A0 0x40006401u
#define CYDEV_UWRK_UWRK8_B0_UDB02_A0 0x40006402u
#define CYDEV_UWRK_UWRK8_B0_UDB03_A0 0x40006403u
#define CYDEV_UWRK_UWRK8_B0_UDB04_A0 0x40006404u
#define CYDEV_UWRK_UWRK8_B0_UDB05_A0 0x40006405u
#define CYDEV_UWRK_UWRK8_B0_UDB06_A0 0x40006406u
#define CYDEV_UWRK_UWRK8_B0_UDB07_A0 0x40006407u
#define CYDEV_UWRK_UWRK8_B0_UDB08_A0 0x40006408u
#define CYDEV_UWRK_UWRK8_B0_UDB09_A0 0x40006409u
#define CYDEV_UWRK_UWRK8_B0_UDB10_A0 0x4000640au
#define CYDEV_UWRK_UWRK8_B0_UDB11_A0 0x4000640bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_A0 0x4000640cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_A0 0x4000640du
#define CYDEV_UWRK_UWRK8_B0_UDB14_A0 0x4000640eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_A0 0x4000640fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_A1 0x40006410u
#define CYDEV_UWRK_UWRK8_B0_UDB01_A1 0x40006411u
#define CYDEV_UWRK_UWRK8_B0_UDB02_A1 0x40006412u
#define CYDEV_UWRK_UWRK8_B0_UDB03_A1 0x40006413u
#define CYDEV_UWRK_UWRK8_B0_UDB04_A1 0x40006414u
#define CYDEV_UWRK_UWRK8_B0_UDB05_A1 0x40006415u
#define CYDEV_UWRK_UWRK8_B0_UDB06_A1 0x40006416u
#define CYDEV_UWRK_UWRK8_B0_UDB07_A1 0x40006417u
