MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
#define CYDEV_UWRK_UWRK8_B0_UDB08_A1 0x40006418u
#define CYDEV_UWRK_UWRK8_B0_UDB09_A1 0x40006419u
#define CYDEV_UWRK_UWRK8_B0_UDB10_A1 0x4000641au
#define CYDEV_UWRK_UWRK8_B0_UDB11_A1 0x4000641bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_A1 0x4000641cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_A1 0x4000641du
#define CYDEV_UWRK_UWRK8_B0_UDB14_A1 0x4000641eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_A1 0x4000641fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_D0 0x40006420u
#define CYDEV_UWRK_UWRK8_B0_UDB01_D0 0x40006421u
#define CYDEV_UWRK_UWRK8_B0_UDB02_D0 0x40006422u
#define CYDEV_UWRK_UWRK8_B0_UDB03_D0 0x40006423u
#define CYDEV_UWRK_UWRK8_B0_UDB04_D0 0x40006424u
#define CYDEV_UWRK_UWRK8_B0_UDB05_D0 0x40006425u
#define CYDEV_UWRK_UWRK8_B0_UDB06_D0 0x40006426u
#define CYDEV_UWRK_UWRK8_B0_UDB07_D0 0x40006427u
#define CYDEV_UWRK_UWRK8_B0_UDB08_D0 0x40006428u
#define CYDEV_UWRK_UWRK8_B0_UDB09_D0 0x40006429u
#define CYDEV_UWRK_UWRK8_B0_UDB10_D0 0x4000642au
#define CYDEV_UWRK_UWRK8_B0_UDB11_D0 0x4000642bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_D0 0x4000642cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_D0 0x4000642du
#define CYDEV_UWRK_UWRK8_B0_UDB14_D0 0x4000642eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_D0 0x4000642fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_D1 0x40006430u
#define CYDEV_UWRK_UWRK8_B0_UDB01_D1 0x40006431u
#define CYDEV_UWRK_UWRK8_B0_UDB02_D1 0x40006432u
#define CYDEV_UWRK_UWRK8_B0_UDB03_D1 0x40006433u
#define CYDEV_UWRK_UWRK8_B0_UDB04_D1 0x40006434u
#define CYDEV_UWRK_UWRK8_B0_UDB05_D1 0x40006435u
#define CYDEV_UWRK_UWRK8_B0_UDB06_D1 0x40006436u
#define CYDEV_UWRK_UWRK8_B0_UDB07_D1 0x40006437u
#define CYDEV_UWRK_UWRK8_B0_UDB08_D1 0x40006438u
#define CYDEV_UWRK_UWRK8_B0_UDB09_D1 0x40006439u
#define CYDEV_UWRK_UWRK8_B0_UDB10_D1 0x4000643au
#define CYDEV_UWRK_UWRK8_B0_UDB11_D1 0x4000643bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_D1 0x4000643cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_D1 0x4000643du
#define CYDEV_UWRK_UWRK8_B0_UDB14_D1 0x4000643eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_D1 0x4000643fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_F0 0x40006440u
#define CYDEV_UWRK_UWRK8_B0_UDB01_F0 0x40006441u
#define CYDEV_UWRK_UWRK8_B0_UDB02_F0 0x40006442u
#define CYDEV_UWRK_UWRK8_B0_UDB03_F0 0x40006443u
#define CYDEV_UWRK_UWRK8_B0_UDB04_F0 0x40006444u
#define CYDEV_UWRK_UWRK8_B0_UDB05_F0 0x40006445u
#define CYDEV_UWRK_UWRK8_B0_UDB06_F0 0x40006446u
#define CYDEV_UWRK_UWRK8_B0_UDB07_F0 0x40006447u
#define CYDEV_UWRK_UWRK8_B0_UDB08_F0 0x40006448u
#define CYDEV_UWRK_UWRK8_B0_UDB09_F0 0x40006449u
#define CYDEV_UWRK_UWRK8_B0_UDB10_F0 0x4000644au
#define CYDEV_UWRK_UWRK8_B0_UDB11_F0 0x4000644bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_F0 0x4000644cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_F0 0x4000644du
#define CYDEV_UWRK_UWRK8_B0_UDB14_F0 0x4000644eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_F0 0x4000644fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_F1 0x40006450u
#define CYDEV_UWRK_UWRK8_B0_UDB01_F1 0x40006451u
#define CYDEV_UWRK_UWRK8_B0_UDB02_F1 0x40006452u
#define CYDEV_UWRK_UWRK8_B0_UDB03_F1 0x40006453u
#define CYDEV_UWRK_UWRK8_B0_UDB04_F1 0x40006454u
#define CYDEV_UWRK_UWRK8_B0_UDB05_F1 0x40006455u
#define CYDEV_UWRK_UWRK8_B0_UDB06_F1 0x40006456u
#define CYDEV_UWRK_UWRK8_B0_UDB07_F1 0x40006457u
#define CYDEV_UWRK_UWRK8_B0_UDB08_F1 0x40006458u
#define CYDEV_UWRK_UWRK8_B0_UDB09_F1 0x40006459u
#define CYDEV_UWRK_UWRK8_B0_UDB10_F1 0x4000645au
#define CYDEV_UWRK_UWRK8_B0_UDB11_F1 0x4000645bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_F1 0x4000645cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_F1 0x4000645du
#define CYDEV_UWRK_UWRK8_B0_UDB14_F1 0x4000645eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_F1 0x4000645fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_ST 0x40006460u
#define CYDEV_UWRK_UWRK8_B0_UDB01_ST 0x40006461u
#define CYDEV_UWRK_UWRK8_B0_UDB02_ST 0x40006462u
#define CYDEV_UWRK_UWRK8_B0_UDB03_ST 0x40006463u
#define CYDEV_UWRK_UWRK8_B0_UDB04_ST 0x40006464u
#define CYDEV_UWRK_UWRK8_B0_UDB05_ST 0x40006465u
#define CYDEV_UWRK_UWRK8_B0_UDB06_ST 0x40006466u
#define CYDEV_UWRK_UWRK8_B0_UDB07_ST 0x40006467u
#define CYDEV_UWRK_UWRK8_B0_UDB08_ST 0x40006468u
#define CYDEV_UWRK_UWRK8_B0_UDB09_ST 0x40006469u
#define CYDEV_UWRK_UWRK8_B0_UDB10_ST 0x4000646au
#define CYDEV_UWRK_UWRK8_B0_UDB11_ST 0x4000646bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_ST 0x4000646cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_ST 0x4000646du
#define CYDEV_UWRK_UWRK8_B0_UDB14_ST 0x4000646eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_ST 0x4000646fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_CTL 0x40006470u
#define CYDEV_UWRK_UWRK8_B0_UDB01_CTL 0x40006471u
#define CYDEV_UWRK_UWRK8_B0_UDB02_CTL 0x40006472u
#define CYDEV_UWRK_UWRK8_B0_UDB03_CTL 0x40006473u
#define CYDEV_UWRK_UWRK8_B0_UDB04_CTL 0x40006474u
#define CYDEV_UWRK_UWRK8_B0_UDB05_CTL 0x40006475u
#define CYDEV_UWRK_UWRK8_B0_UDB06_CTL 0x40006476u
#define CYDEV_UWRK_UWRK8_B0_UDB07_CTL 0x40006477u
#define CYDEV_UWRK_UWRK8_B0_UDB08_CTL 0x40006478u
#define CYDEV_UWRK_UWRK8_B0_UDB09_CTL 0x40006479u
#define CYDEV_UWRK_UWRK8_B0_UDB10_CTL 0x4000647au
#define CYDEV_UWRK_UWRK8_B0_UDB11_CTL 0x4000647bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_CTL 0x4000647cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_CTL 0x4000647du
#define CYDEV_UWRK_UWRK8_B0_UDB14_CTL 0x4000647eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_CTL 0x4000647fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_MSK 0x40006480u
#define CYDEV_UWRK_UWRK8_B0_UDB01_MSK 0x40006481u
#define CYDEV_UWRK_UWRK8_B0_UDB02_MSK 0x40006482u
#define CYDEV_UWRK_UWRK8_B0_UDB03_MSK 0x40006483u
#define CYDEV_UWRK_UWRK8_B0_UDB04_MSK 0x40006484u
#define CYDEV_UWRK_UWRK8_B0_UDB05_MSK 0x40006485u
#define CYDEV_UWRK_UWRK8_B0_UDB06_MSK 0x40006486u
#define CYDEV_UWRK_UWRK8_B0_UDB07_MSK 0x40006487u
#define CYDEV_UWRK_UWRK8_B0_UDB08_MSK 0x40006488u
#define CYDEV_UWRK_UWRK8_B0_UDB09_MSK 0x40006489u
#define CYDEV_UWRK_UWRK8_B0_UDB10_MSK 0x4000648au
#define CYDEV_UWRK_UWRK8_B0_UDB11_MSK 0x4000648bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_MSK 0x4000648cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_MSK 0x4000648du
#define CYDEV_UWRK_UWRK8_B0_UDB14_MSK 0x4000648eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_MSK 0x4000648fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_ACTL 0x40006490u
#define CYDEV_UWRK_UWRK8_B0_UDB01_ACTL 0x40006491u
#define CYDEV_UWRK_UWRK8_B0_UDB02_ACTL 0x40006492u
#define CYDEV_UWRK_UWRK8_B0_UDB03_ACTL 0x40006493u
#define CYDEV_UWRK_UWRK8_B0_UDB04_ACTL 0x40006494u
#define CYDEV_UWRK_UWRK8_B0_UDB05_ACTL 0x40006495u
#define CYDEV_UWRK_UWRK8_B0_UDB06_ACTL 0x40006496u
#define CYDEV_UWRK_UWRK8_B0_UDB07_ACTL 0x40006497u
#define CYDEV_UWRK_UWRK8_B0_UDB08_ACTL 0x40006498u
#define CYDEV_UWRK_UWRK8_B0_UDB09_ACTL 0x40006499u
#define CYDEV_UWRK_UWRK8_B0_UDB10_ACTL 0x4000649au
#define CYDEV_UWRK_UWRK8_B0_UDB11_ACTL 0x4000649bu
#define CYDEV_UWRK_UWRK8_B0_UDB12_ACTL 0x4000649cu
#define CYDEV_UWRK_UWRK8_B0_UDB13_ACTL 0x4000649du
#define CYDEV_UWRK_UWRK8_B0_UDB14_ACTL 0x4000649eu
#define CYDEV_UWRK_UWRK8_B0_UDB15_ACTL 0x4000649fu
#define CYDEV_UWRK_UWRK8_B0_UDB00_MC 0x400064a0u
#define CYDEV_UWRK_UWRK8_B0_UDB01_MC 0x400064a1u
#define CYDEV_UWRK_UWRK8_B0_UDB02_MC 0x400064a2u
#define CYDEV_UWRK_UWRK8_B0_UDB03_MC 0x400064a3u
#define CYDEV_UWRK_UWRK8_B0_UDB04_MC 0x400064a4u
#define CYDEV_UWRK_UWRK8_B0_UDB05_MC 0x400064a5u
#define CYDEV_UWRK_UWRK8_B0_UDB06_MC 0x400064a6u
#define CYDEV_UWRK_UWRK8_B0_UDB07_MC 0x400064a7u
#define CYDEV_UWRK_UWRK8_B0_UDB08_MC 0x400064a8u
#define CYDEV_UWRK_UWRK8_B0_UDB09_MC 0x400064a9u
#define CYDEV_UWRK_UWRK8_B0_UDB10_MC 0x400064aau
#define CYDEV_UWRK_UWRK8_B0_UDB11_MC 0x400064abu
#define CYDEV_UWRK_UWRK8_B0_UDB12_MC 0x400064acu
#define CYDEV_UWRK_UWRK8_B0_UDB13_MC 0x400064adu
#define CYDEV_UWRK_UWRK8_B0_UDB14_MC 0x400064aeu
#define CYDEV_UWRK_UWRK8_B0_UDB15_MC 0x400064afu
#define CYDEV_UWRK_UWRK8_B1_BASE 0x40006500u
#define CYDEV_UWRK_UWRK8_B1_SIZE 0x000000b0u
#define CYDEV_UWRK_UWRK8_B1_UDB04_A0 0x40006504u
#define CYDEV_UWRK_UWRK8_B1_UDB05_A0 0x40006505u
#define CYDEV_UWRK_UWRK8_B1_UDB06_A0 0x40006506u
#define CYDEV_UWRK_UWRK8_B1_UDB07_A0 0x40006507u
#define CYDEV_UWRK_UWRK8_B1_UDB08_A0 0x40006508u
#define CYDEV_UWRK_UWRK8_B1_UDB09_A0 0x40006509u
#define CYDEV_UWRK_UWRK8_B1_UDB10_A0 0x4000650au
#define CYDEV_UWRK_UWRK8_B1_UDB11_A0 0x4000650bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_A1 0x40006514u
#define CYDEV_UWRK_UWRK8_B1_UDB05_A1 0x40006515u
#define CYDEV_UWRK_UWRK8_B1_UDB06_A1 0x40006516u
#define CYDEV_UWRK_UWRK8_B1_UDB07_A1 0x40006517u
#define CYDEV_UWRK_UWRK8_B1_UDB08_A1 0x40006518u
#define CYDEV_UWRK_UWRK8_B1_UDB09_A1 0x40006519u
#define CYDEV_UWRK_UWRK8_B1_UDB10_A1 0x4000651au
#define CYDEV_UWRK_UWRK8_B1_UDB11_A1 0x4000651bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_D0 0x40006524u
#define CYDEV_UWRK_UWRK8_B1_UDB05_D0 0x40006525u
#define CYDEV_UWRK_UWRK8_B1_UDB06_D0 0x40006526u
#define CYDEV_UWRK_UWRK8_B1_UDB07_D0 0x40006527u
#define CYDEV_UWRK_UWRK8_B1_UDB08_D0 0x40006528u
#define CYDEV_UWRK_UWRK8_B1_UDB09_D0 0x40006529u
#define CYDEV_UWRK_UWRK8_B1_UDB10_D0 0x4000652au
#define CYDEV_UWRK_UWRK8_B1_UDB11_D0 0x4000652bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_D1 0x40006534u
#define CYDEV_UWRK_UWRK8_B1_UDB05_D1 0x40006535u
#define CYDEV_UWRK_UWRK8_B1_UDB06_D1 0x40006536u
#define CYDEV_UWRK_UWRK8_B1_UDB07_D1 0x40006537u
#define CYDEV_UWRK_UWRK8_B1_UDB08_D1 0x40006538u
#define CYDEV_UWRK_UWRK8_B1_UDB09_D1 0x40006539u
#define CYDEV_UWRK_UWRK8_B1_UDB10_D1 0x4000653au
#define CYDEV_UWRK_UWRK8_B1_UDB11_D1 0x4000653bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_F0 0x40006544u
#define CYDEV_UWRK_UWRK8_B1_UDB05_F0 0x40006545u
#define CYDEV_UWRK_UWRK8_B1_UDB06_F0 0x40006546u
#define CYDEV_UWRK_UWRK8_B1_UDB07_F0 0x40006547u
#define CYDEV_UWRK_UWRK8_B1_UDB08_F0 0x40006548u
#define CYDEV_UWRK_UWRK8_B1_UDB09_F0 0x40006549u
#define CYDEV_UWRK_UWRK8_B1_UDB10_F0 0x4000654au
#define CYDEV_UWRK_UWRK8_B1_UDB11_F0 0x4000654bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_F1 0x40006554u
#define CYDEV_UWRK_UWRK8_B1_UDB05_F1 0x40006555u
#define CYDEV_UWRK_UWRK8_B1_UDB06_F1 0x40006556u
#define CYDEV_UWRK_UWRK8_B1_UDB07_F1 0x40006557u
#define CYDEV_UWRK_UWRK8_B1_UDB08_F1 0x40006558u
#define CYDEV_UWRK_UWRK8_B1_UDB09_F1 0x40006559u
#define CYDEV_UWRK_UWRK8_B1_UDB10_F1 0x4000655au
#define CYDEV_UWRK_UWRK8_B1_UDB11_F1 0x4000655bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_ST 0x40006564u
#define CYDEV_UWRK_UWRK8_B1_UDB05_ST 0x40006565u
#define CYDEV_UWRK_UWRK8_B1_UDB06_ST 0x40006566u
#define CYDEV_UWRK_UWRK8_B1_UDB07_ST 0x40006567u
#define CYDEV_UWRK_UWRK8_B1_UDB08_ST 0x40006568u
#define CYDEV_UWRK_UWRK8_B1_UDB09_ST 0x40006569u
#define CYDEV_UWRK_UWRK8_B1_UDB10_ST 0x4000656au
#define CYDEV_UWRK_UWRK8_B1_UDB11_ST 0x4000656bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_CTL 0x40006574u
#define CYDEV_UWRK_UWRK8_B1_UDB05_CTL 0x40006575u
#define CYDEV_UWRK_UWRK8_B1_UDB06_CTL 0x40006576u
#define CYDEV_UWRK_UWRK8_B1_UDB07_CTL 0x40006577u
#define CYDEV_UWRK_UWRK8_B1_UDB08_CTL 0x40006578u
#define CYDEV_UWRK_UWRK8_B1_UDB09_CTL 0x40006579u
#define CYDEV_UWRK_UWRK8_B1_UDB10_CTL 0x4000657au
#define CYDEV_UWRK_UWRK8_B1_UDB11_CTL 0x4000657bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_MSK 0x40006584u
#define CYDEV_UWRK_UWRK8_B1_UDB05_MSK 0x40006585u
#define CYDEV_UWRK_UWRK8_B1_UDB06_MSK 0x40006586u
#define CYDEV_UWRK_UWRK8_B1_UDB07_MSK 0x40006587u
#define CYDEV_UWRK_UWRK8_B1_UDB08_MSK 0x40006588u
#define CYDEV_UWRK_UWRK8_B1_UDB09_MSK 0x40006589u
#define CYDEV_UWRK_UWRK8_B1_UDB10_MSK 0x4000658au
#define CYDEV_UWRK_UWRK8_B1_UDB11_MSK 0x4000658bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_ACTL 0x40006594u
#define CYDEV_UWRK_UWRK8_B1_UDB05_ACTL 0x40006595u
#define CYDEV_UWRK_UWRK8_B1_UDB06_ACTL 0x40006596u
#define CYDEV_UWRK_UWRK8_B1_UDB07_ACTL 0x40006597u
#define CYDEV_UWRK_UWRK8_B1_UDB08_ACTL 0x40006598u
#define CYDEV_UWRK_UWRK8_B1_UDB09_ACTL 0x40006599u
#define CYDEV_UWRK_UWRK8_B1_UDB10_ACTL 0x4000659au
#define CYDEV_UWRK_UWRK8_B1_UDB11_ACTL 0x4000659bu
#define CYDEV_UWRK_UWRK8_B1_UDB04_MC 0x400065a4u
#define CYDEV_UWRK_UWRK8_B1_UDB05_MC 0x400065a5u
#define CYDEV_UWRK_UWRK8_B1_UDB06_MC 0x400065a6u
#define CYDEV_UWRK_UWRK8_B1_UDB07_MC 0x400065a7u
#define CYDEV_UWRK_UWRK8_B1_UDB08_MC 0x400065a8u
#define CYDEV_UWRK_UWRK8_B1_UDB09_MC 0x400065a9u
#define CYDEV_UWRK_UWRK8_B1_UDB10_MC 0x400065aau
#define CYDEV_UWRK_UWRK8_B1_UDB11_MC 0x400065abu
#define CYDEV_UWRK_UWRK16_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_SIZE 0x00000760u
#define CYDEV_UWRK_UWRK16_CAT_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_CAT_SIZE 0x00000760u
#define CYDEV_UWRK_UWRK16_CAT_B0_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_CAT_B0_SIZE 0x00000160u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB00_A0_A1 0x40006800u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB01_A0_A1 0x40006802u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB02_A0_A1 0x40006804u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB03_A0_A1 0x40006806u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB04_A0_A1 0x40006808u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB05_A0_A1 0x4000680au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB06_A0_A1 0x4000680cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB07_A0_A1 0x4000680eu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB08_A0_A1 0x40006810u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB09_A0_A1 0x40006812u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB10_A0_A1 0x40006814u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB11_A0_A1 0x40006816u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB12_A0_A1 0x40006818u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB13_A0_A1 0x4000681au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB14_A0_A1 0x4000681cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB15_A0_A1 0x4000681eu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB00_D0_D1 0x40006840u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB01_D0_D1 0x40006842u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB02_D0_D1 0x40006844u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB03_D0_D1 0x40006846u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB04_D0_D1 0x40006848u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB05_D0_D1 0x4000684au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB06_D0_D1 0x4000684cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB07_D0_D1 0x4000684eu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB08_D0_D1 0x40006850u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB09_D0_D1 0x40006852u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB10_D0_D1 0x40006854u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB11_D0_D1 0x40006856u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB12_D0_D1 0x40006858u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB13_D0_D1 0x4000685au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB14_D0_D1 0x4000685cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB15_D0_D1 0x4000685eu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB00_F0_F1 0x40006880u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB01_F0_F1 0x40006882u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB02_F0_F1 0x40006884u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB03_F0_F1 0x40006886u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB04_F0_F1 0x40006888u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB05_F0_F1 0x4000688au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB06_F0_F1 0x4000688cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB07_F0_F1 0x4000688eu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB08_F0_F1 0x40006890u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB09_F0_F1 0x40006892u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB10_F0_F1 0x40006894u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB11_F0_F1 0x40006896u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB12_F0_F1 0x40006898u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB13_F0_F1 0x4000689au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB14_F0_F1 0x4000689cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB15_F0_F1 0x4000689eu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB00_ST_CTL 0x400068c0u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB01_ST_CTL 0x400068c2u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB02_ST_CTL 0x400068c4u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB03_ST_CTL 0x400068c6u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB04_ST_CTL 0x400068c8u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB05_ST_CTL 0x400068cau
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB06_ST_CTL 0x400068ccu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB07_ST_CTL 0x400068ceu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB08_ST_CTL 0x400068d0u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB09_ST_CTL 0x400068d2u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB10_ST_CTL 0x400068d4u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB11_ST_CTL 0x400068d6u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB12_ST_CTL 0x400068d8u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB13_ST_CTL 0x400068dau
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB14_ST_CTL 0x400068dcu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB15_ST_CTL 0x400068deu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB00_MSK_ACTL 0x40006900u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB01_MSK_ACTL 0x40006902u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB02_MSK_ACTL 0x40006904u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB03_MSK_ACTL 0x40006906u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB04_MSK_ACTL 0x40006908u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB05_MSK_ACTL 0x4000690au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB06_MSK_ACTL 0x4000690cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB07_MSK_ACTL 0x4000690eu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB08_MSK_ACTL 0x40006910u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB09_MSK_ACTL 0x40006912u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB10_MSK_ACTL 0x40006914u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB11_MSK_ACTL 0x40006916u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB12_MSK_ACTL 0x40006918u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB13_MSK_ACTL 0x4000691au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB14_MSK_ACTL 0x4000691cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB15_MSK_ACTL 0x4000691eu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB00_MC_00 0x40006940u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB01_MC_00 0x40006942u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB02_MC_00 0x40006944u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB03_MC_00 0x40006946u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB04_MC_00 0x40006948u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB05_MC_00 0x4000694au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB06_MC_00 0x4000694cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB07_MC_00 0x4000694eu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB08_MC_00 0x40006950u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB09_MC_00 0x40006952u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB10_MC_00 0x40006954u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB11_MC_00 0x40006956u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB12_MC_00 0x40006958u
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB13_MC_00 0x4000695au
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB14_MC_00 0x4000695cu
#define CYDEV_UWRK_UWRK16_CAT_B0_UDB15_MC_00 0x4000695eu
#define CYDEV_UWRK_UWRK16_CAT_B1_BASE 0x40006a00u
#define CYDEV_UWRK_UWRK16_CAT_B1_SIZE 0x00000160u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB04_A0_A1 0x40006a08u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB05_A0_A1 0x40006a0au
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB06_A0_A1 0x40006a0cu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB07_A0_A1 0x40006a0eu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB08_A0_A1 0x40006a10u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB09_A0_A1 0x40006a12u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB10_A0_A1 0x40006a14u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB11_A0_A1 0x40006a16u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB04_D0_D1 0x40006a48u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB05_D0_D1 0x40006a4au
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB06_D0_D1 0x40006a4cu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB07_D0_D1 0x40006a4eu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB08_D0_D1 0x40006a50u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB09_D0_D1 0x40006a52u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB10_D0_D1 0x40006a54u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB11_D0_D1 0x40006a56u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB04_F0_F1 0x40006a88u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB05_F0_F1 0x40006a8au
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB06_F0_F1 0x40006a8cu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB07_F0_F1 0x40006a8eu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB08_F0_F1 0x40006a90u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB09_F0_F1 0x40006a92u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB10_F0_F1 0x40006a94u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB11_F0_F1 0x40006a96u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB04_ST_CTL 0x40006ac8u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB05_ST_CTL 0x40006acau
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB06_ST_CTL 0x40006accu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB07_ST_CTL 0x40006aceu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB08_ST_CTL 0x40006ad0u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB09_ST_CTL 0x40006ad2u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB10_ST_CTL 0x40006ad4u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB11_ST_CTL 0x40006ad6u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB04_MSK_ACTL 0x40006b08u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB05_MSK_ACTL 0x40006b0au
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB06_MSK_ACTL 0x40006b0cu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB07_MSK_ACTL 0x40006b0eu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB08_MSK_ACTL 0x40006b10u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB09_MSK_ACTL 0x40006b12u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB10_MSK_ACTL 0x40006b14u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB11_MSK_ACTL 0x40006b16u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB04_MC_00 0x40006b48u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB05_MC_00 0x40006b4au
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB06_MC_00 0x40006b4cu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB07_MC_00 0x40006b4eu
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB08_MC_00 0x40006b50u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB09_MC_00 0x40006b52u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB10_MC_00 0x40006b54u
#define CYDEV_UWRK_UWRK16_CAT_B1_UDB11_MC_00 0x40006b56u
#define CYDEV_UWRK_UWRK16_DEF_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_DEF_SIZE 0x0000075eu
#define CYDEV_UWRK_UWRK16_DEF_B0_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_DEF_B0_SIZE 0x0000015eu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_A0 0x40006800u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_A0 0x40006802u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_A0 0x40006804u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_A0 0x40006806u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_A0 0x40006808u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_A0 0x4000680au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_A0 0x4000680cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_A0 0x4000680eu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_A0 0x40006810u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_A0 0x40006812u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_A0 0x40006814u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_A0 0x40006816u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_A0 0x40006818u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_A0 0x4000681au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_A0 0x4000681cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_A1 0x40006820u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_A1 0x40006822u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_A1 0x40006824u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_A1 0x40006826u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_A1 0x40006828u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_A1 0x4000682au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_A1 0x4000682cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_A1 0x4000682eu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_A1 0x40006830u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_A1 0x40006832u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_A1 0x40006834u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_A1 0x40006836u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_A1 0x40006838u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_A1 0x4000683au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_A1 0x4000683cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_D0 0x40006840u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_D0 0x40006842u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_D0 0x40006844u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_D0 0x40006846u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_D0 0x40006848u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_D0 0x4000684au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_D0 0x4000684cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_D0 0x4000684eu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_D0 0x40006850u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_D0 0x40006852u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_D0 0x40006854u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_D0 0x40006856u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_D0 0x40006858u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_D0 0x4000685au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_D0 0x4000685cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_D1 0x40006860u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_D1 0x40006862u
