MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_D1 0x40006864u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_D1 0x40006866u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_D1 0x40006868u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_D1 0x4000686au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_D1 0x4000686cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_D1 0x4000686eu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_D1 0x40006870u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_D1 0x40006872u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_D1 0x40006874u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_D1 0x40006876u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_D1 0x40006878u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_D1 0x4000687au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_D1 0x4000687cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_F0 0x40006880u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_F0 0x40006882u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_F0 0x40006884u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_F0 0x40006886u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_F0 0x40006888u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_F0 0x4000688au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_F0 0x4000688cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_F0 0x4000688eu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_F0 0x40006890u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_F0 0x40006892u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_F0 0x40006894u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_F0 0x40006896u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_F0 0x40006898u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_F0 0x4000689au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_F0 0x4000689cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_F1 0x400068a0u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_F1 0x400068a2u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_F1 0x400068a4u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_F1 0x400068a6u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_F1 0x400068a8u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_F1 0x400068aau
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_F1 0x400068acu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_F1 0x400068aeu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_F1 0x400068b0u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_F1 0x400068b2u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_F1 0x400068b4u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_F1 0x400068b6u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_F1 0x400068b8u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_F1 0x400068bau
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_F1 0x400068bcu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_ST 0x400068c0u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_ST 0x400068c2u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_ST 0x400068c4u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_ST 0x400068c6u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_ST 0x400068c8u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_ST 0x400068cau
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_ST 0x400068ccu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_ST 0x400068ceu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_ST 0x400068d0u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_ST 0x400068d2u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_ST 0x400068d4u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_ST 0x400068d6u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_ST 0x400068d8u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_ST 0x400068dau
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_ST 0x400068dcu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_CTL 0x400068e0u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_CTL 0x400068e2u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_CTL 0x400068e4u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_CTL 0x400068e6u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_CTL 0x400068e8u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_CTL 0x400068eau
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_CTL 0x400068ecu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_CTL 0x400068eeu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_CTL 0x400068f0u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_CTL 0x400068f2u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_CTL 0x400068f4u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_CTL 0x400068f6u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_CTL 0x400068f8u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_CTL 0x400068fau
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_CTL 0x400068fcu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_MSK 0x40006900u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_MSK 0x40006902u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_MSK 0x40006904u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_MSK 0x40006906u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_MSK 0x40006908u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_MSK 0x4000690au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_MSK 0x4000690cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_MSK 0x4000690eu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_MSK 0x40006910u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_MSK 0x40006912u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_MSK 0x40006914u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_MSK 0x40006916u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_MSK 0x40006918u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_MSK 0x4000691au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_MSK 0x4000691cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_ACTL 0x40006920u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_ACTL 0x40006922u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_ACTL 0x40006924u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_ACTL 0x40006926u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_ACTL 0x40006928u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_ACTL 0x4000692au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_ACTL 0x4000692cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_ACTL 0x4000692eu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_ACTL 0x40006930u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_ACTL 0x40006932u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_ACTL 0x40006934u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_ACTL 0x40006936u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_ACTL 0x40006938u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_ACTL 0x4000693au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_ACTL 0x4000693cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB00_01_MC 0x40006940u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB01_02_MC 0x40006942u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB02_03_MC 0x40006944u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB03_04_MC 0x40006946u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB04_05_MC 0x40006948u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB05_06_MC 0x4000694au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB06_07_MC 0x4000694cu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB07_08_MC 0x4000694eu
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB08_09_MC 0x40006950u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB09_10_MC 0x40006952u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB10_11_MC 0x40006954u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB11_12_MC 0x40006956u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB12_13_MC 0x40006958u
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB13_14_MC 0x4000695au
#define CYDEV_UWRK_UWRK16_DEF_B0_UDB14_15_MC 0x4000695cu
#define CYDEV_UWRK_UWRK16_DEF_B1_BASE 0x40006a00u
#define CYDEV_UWRK_UWRK16_DEF_B1_SIZE 0x0000015eu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_A0 0x40006a08u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_A0 0x40006a0au
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_A0 0x40006a0cu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_A0 0x40006a0eu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_A0 0x40006a10u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_A0 0x40006a12u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_A0 0x40006a14u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_A0 0x40006a16u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_A1 0x40006a28u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_A1 0x40006a2au
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_A1 0x40006a2cu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_A1 0x40006a2eu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_A1 0x40006a30u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_A1 0x40006a32u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_A1 0x40006a34u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_A1 0x40006a36u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_D0 0x40006a48u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_D0 0x40006a4au
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_D0 0x40006a4cu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_D0 0x40006a4eu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_D0 0x40006a50u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_D0 0x40006a52u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_D0 0x40006a54u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_D0 0x40006a56u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_D1 0x40006a68u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_D1 0x40006a6au
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_D1 0x40006a6cu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_D1 0x40006a6eu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_D1 0x40006a70u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_D1 0x40006a72u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_D1 0x40006a74u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_D1 0x40006a76u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_F0 0x40006a88u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_F0 0x40006a8au
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_F0 0x40006a8cu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_F0 0x40006a8eu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_F0 0x40006a90u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_F0 0x40006a92u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_F0 0x40006a94u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_F0 0x40006a96u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_F1 0x40006aa8u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_F1 0x40006aaau
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_F1 0x40006aacu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_F1 0x40006aaeu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_F1 0x40006ab0u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_F1 0x40006ab2u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_F1 0x40006ab4u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_F1 0x40006ab6u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_ST 0x40006ac8u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_ST 0x40006acau
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_ST 0x40006accu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_ST 0x40006aceu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_ST 0x40006ad0u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_ST 0x40006ad2u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_ST 0x40006ad4u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_ST 0x40006ad6u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_CTL 0x40006ae8u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_CTL 0x40006aeau
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_CTL 0x40006aecu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_CTL 0x40006aeeu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_CTL 0x40006af0u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_CTL 0x40006af2u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_CTL 0x40006af4u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_CTL 0x40006af6u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_MSK 0x40006b08u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_MSK 0x40006b0au
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_MSK 0x40006b0cu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_MSK 0x40006b0eu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_MSK 0x40006b10u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_MSK 0x40006b12u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_MSK 0x40006b14u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_MSK 0x40006b16u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_ACTL 0x40006b28u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_ACTL 0x40006b2au
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_ACTL 0x40006b2cu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_ACTL 0x40006b2eu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_ACTL 0x40006b30u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_ACTL 0x40006b32u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_ACTL 0x40006b34u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_ACTL 0x40006b36u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_MC 0x40006b48u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_MC 0x40006b4au
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_MC 0x40006b4cu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_MC 0x40006b4eu
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_MC 0x40006b50u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_MC 0x40006b52u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_MC 0x40006b54u
#define CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_MC 0x40006b56u
#define CYDEV_PHUB_BASE 0x40007000u
#define CYDEV_PHUB_SIZE 0x00000c00u
#define CYDEV_PHUB_CFG 0x40007000u
#define CYDEV_PHUB_ERR 0x40007004u
#define CYDEV_PHUB_ERR_ADR 0x40007008u
#define CYDEV_PHUB_CH0_BASE 0x40007010u
#define CYDEV_PHUB_CH0_SIZE 0x0000000cu
#define CYDEV_PHUB_CH0_BASIC_CFG 0x40007010u
#define CYDEV_PHUB_CH0_ACTION 0x40007014u
#define CYDEV_PHUB_CH0_BASIC_STATUS 0x40007018u
#define CYDEV_PHUB_CH1_BASE 0x40007020u
#define CYDEV_PHUB_CH1_SIZE 0x0000000cu
#define CYDEV_PHUB_CH1_BASIC_CFG 0x40007020u
#define CYDEV_PHUB_CH1_ACTION 0x40007024u
#define CYDEV_PHUB_CH1_BASIC_STATUS 0x40007028u
#define CYDEV_PHUB_CH2_BASE 0x40007030u
#define CYDEV_PHUB_CH2_SIZE 0x0000000cu
#define CYDEV_PHUB_CH2_BASIC_CFG 0x40007030u
#define CYDEV_PHUB_CH2_ACTION 0x40007034u
#define CYDEV_PHUB_CH2_BASIC_STATUS 0x40007038u
#define CYDEV_PHUB_CH3_BASE 0x40007040u
#define CYDEV_PHUB_CH3_SIZE 0x0000000cu
#define CYDEV_PHUB_CH3_BASIC_CFG 0x40007040u
#define CYDEV_PHUB_CH3_ACTION 0x40007044u
#define CYDEV_PHUB_CH3_BASIC_STATUS 0x40007048u
#define CYDEV_PHUB_CH4_BASE 0x40007050u
#define CYDEV_PHUB_CH4_SIZE 0x0000000cu
#define CYDEV_PHUB_CH4_BASIC_CFG 0x40007050u
#define CYDEV_PHUB_CH4_ACTION 0x40007054u
#define CYDEV_PHUB_CH4_BASIC_STATUS 0x40007058u
#define CYDEV_PHUB_CH5_BASE 0x40007060u
#define CYDEV_PHUB_CH5_SIZE 0x0000000cu
#define CYDEV_PHUB_CH5_BASIC_CFG 0x40007060u
#define CYDEV_PHUB_CH5_ACTION 0x40007064u
#define CYDEV_PHUB_CH5_BASIC_STATUS 0x40007068u
#define CYDEV_PHUB_CH6_BASE 0x40007070u
#define CYDEV_PHUB_CH6_SIZE 0x0000000cu
#define CYDEV_PHUB_CH6_BASIC_CFG 0x40007070u
#define CYDEV_PHUB_CH6_ACTION 0x40007074u
#define CYDEV_PHUB_CH6_BASIC_STATUS 0x40007078u
#define CYDEV_PHUB_CH7_BASE 0x40007080u
#define CYDEV_PHUB_CH7_SIZE 0x0000000cu
#define CYDEV_PHUB_CH7_BASIC_CFG 0x40007080u
#define CYDEV_PHUB_CH7_ACTION 0x40007084u
#define CYDEV_PHUB_CH7_BASIC_STATUS 0x40007088u
#define CYDEV_PHUB_CH8_BASE 0x40007090u
#define CYDEV_PHUB_CH8_SIZE 0x0000000cu
#define CYDEV_PHUB_CH8_BASIC_CFG 0x40007090u
#define CYDEV_PHUB_CH8_ACTION 0x40007094u
#define CYDEV_PHUB_CH8_BASIC_STATUS 0x40007098u
#define CYDEV_PHUB_CH9_BASE 0x400070a0u
#define CYDEV_PHUB_CH9_SIZE 0x0000000cu
#define CYDEV_PHUB_CH9_BASIC_CFG 0x400070a0u
#define CYDEV_PHUB_CH9_ACTION 0x400070a4u
#define CYDEV_PHUB_CH9_BASIC_STATUS 0x400070a8u
#define CYDEV_PHUB_CH10_BASE 0x400070b0u
#define CYDEV_PHUB_CH10_SIZE 0x0000000cu
#define CYDEV_PHUB_CH10_BASIC_CFG 0x400070b0u
#define CYDEV_PHUB_CH10_ACTION 0x400070b4u
#define CYDEV_PHUB_CH10_BASIC_STATUS 0x400070b8u
#define CYDEV_PHUB_CH11_BASE 0x400070c0u
#define CYDEV_PHUB_CH11_SIZE 0x0000000cu
#define CYDEV_PHUB_CH11_BASIC_CFG 0x400070c0u
#define CYDEV_PHUB_CH11_ACTION 0x400070c4u
#define CYDEV_PHUB_CH11_BASIC_STATUS 0x400070c8u
#define CYDEV_PHUB_CH12_BASE 0x400070d0u
#define CYDEV_PHUB_CH12_SIZE 0x0000000cu
#define CYDEV_PHUB_CH12_BASIC_CFG 0x400070d0u
#define CYDEV_PHUB_CH12_ACTION 0x400070d4u
#define CYDEV_PHUB_CH12_BASIC_STATUS 0x400070d8u
#define CYDEV_PHUB_CH13_BASE 0x400070e0u
#define CYDEV_PHUB_CH13_SIZE 0x0000000cu
#define CYDEV_PHUB_CH13_BASIC_CFG 0x400070e0u
#define CYDEV_PHUB_CH13_ACTION 0x400070e4u
#define CYDEV_PHUB_CH13_BASIC_STATUS 0x400070e8u
#define CYDEV_PHUB_CH14_BASE 0x400070f0u
#define CYDEV_PHUB_CH14_SIZE 0x0000000cu
#define CYDEV_PHUB_CH14_BASIC_CFG 0x400070f0u
#define CYDEV_PHUB_CH14_ACTION 0x400070f4u
#define CYDEV_PHUB_CH14_BASIC_STATUS 0x400070f8u
#define CYDEV_PHUB_CH15_BASE 0x40007100u
#define CYDEV_PHUB_CH15_SIZE 0x0000000cu
#define CYDEV_PHUB_CH15_BASIC_CFG 0x40007100u
#define CYDEV_PHUB_CH15_ACTION 0x40007104u
#define CYDEV_PHUB_CH15_BASIC_STATUS 0x40007108u
#define CYDEV_PHUB_CH16_BASE 0x40007110u
#define CYDEV_PHUB_CH16_SIZE 0x0000000cu
#define CYDEV_PHUB_CH16_BASIC_CFG 0x40007110u
#define CYDEV_PHUB_CH16_ACTION 0x40007114u
#define CYDEV_PHUB_CH16_BASIC_STATUS 0x40007118u
#define CYDEV_PHUB_CH17_BASE 0x40007120u
#define CYDEV_PHUB_CH17_SIZE 0x0000000cu
#define CYDEV_PHUB_CH17_BASIC_CFG 0x40007120u
#define CYDEV_PHUB_CH17_ACTION 0x40007124u
#define CYDEV_PHUB_CH17_BASIC_STATUS 0x40007128u
#define CYDEV_PHUB_CH18_BASE 0x40007130u
#define CYDEV_PHUB_CH18_SIZE 0x0000000cu
#define CYDEV_PHUB_CH18_BASIC_CFG 0x40007130u
#define CYDEV_PHUB_CH18_ACTION 0x40007134u
#define CYDEV_PHUB_CH18_BASIC_STATUS 0x40007138u
#define CYDEV_PHUB_CH19_BASE 0x40007140u
#define CYDEV_PHUB_CH19_SIZE 0x0000000cu
#define CYDEV_PHUB_CH19_BASIC_CFG 0x40007140u
#define CYDEV_PHUB_CH19_ACTION 0x40007144u
#define CYDEV_PHUB_CH19_BASIC_STATUS 0x40007148u
#define CYDEV_PHUB_CH20_BASE 0x40007150u
#define CYDEV_PHUB_CH20_SIZE 0x0000000cu
#define CYDEV_PHUB_CH20_BASIC_CFG 0x40007150u
#define CYDEV_PHUB_CH20_ACTION 0x40007154u
#define CYDEV_PHUB_CH20_BASIC_STATUS 0x40007158u
#define CYDEV_PHUB_CH21_BASE 0x40007160u
#define CYDEV_PHUB_CH21_SIZE 0x0000000cu
#define CYDEV_PHUB_CH21_BASIC_CFG 0x40007160u
#define CYDEV_PHUB_CH21_ACTION 0x40007164u
#define CYDEV_PHUB_CH21_BASIC_STATUS 0x40007168u
#define CYDEV_PHUB_CH22_BASE 0x40007170u
#define CYDEV_PHUB_CH22_SIZE 0x0000000cu
#define CYDEV_PHUB_CH22_BASIC_CFG 0x40007170u
#define CYDEV_PHUB_CH22_ACTION 0x40007174u
#define CYDEV_PHUB_CH22_BASIC_STATUS 0x40007178u
#define CYDEV_PHUB_CH23_BASE 0x40007180u
#define CYDEV_PHUB_CH23_SIZE 0x0000000cu
#define CYDEV_PHUB_CH23_BASIC_CFG 0x40007180u
#define CYDEV_PHUB_CH23_ACTION 0x40007184u
#define CYDEV_PHUB_CH23_BASIC_STATUS 0x40007188u
#define CYDEV_PHUB_CFGMEM0_BASE 0x40007600u
#define CYDEV_PHUB_CFGMEM0_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM0_CFG0 0x40007600u
#define CYDEV_PHUB_CFGMEM0_CFG1 0x40007604u
#define CYDEV_PHUB_CFGMEM1_BASE 0x40007608u
#define CYDEV_PHUB_CFGMEM1_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM1_CFG0 0x40007608u
#define CYDEV_PHUB_CFGMEM1_CFG1 0x4000760cu
#define CYDEV_PHUB_CFGMEM2_BASE 0x40007610u
#define CYDEV_PHUB_CFGMEM2_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM2_CFG0 0x40007610u
#define CYDEV_PHUB_CFGMEM2_CFG1 0x40007614u
#define CYDEV_PHUB_CFGMEM3_BASE 0x40007618u
#define CYDEV_PHUB_CFGMEM3_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM3_CFG0 0x40007618u
#define CYDEV_PHUB_CFGMEM3_CFG1 0x4000761cu
#define CYDEV_PHUB_CFGMEM4_BASE 0x40007620u
#define CYDEV_PHUB_CFGMEM4_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM4_CFG0 0x40007620u
#define CYDEV_PHUB_CFGMEM4_CFG1 0x40007624u
#define CYDEV_PHUB_CFGMEM5_BASE 0x40007628u
#define CYDEV_PHUB_CFGMEM5_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM5_CFG0 0x40007628u
#define CYDEV_PHUB_CFGMEM5_CFG1 0x4000762cu
#define CYDEV_PHUB_CFGMEM6_BASE 0x40007630u
#define CYDEV_PHUB_CFGMEM6_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM6_CFG0 0x40007630u
#define CYDEV_PHUB_CFGMEM6_CFG1 0x40007634u
#define CYDEV_PHUB_CFGMEM7_BASE 0x40007638u
#define CYDEV_PHUB_CFGMEM7_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM7_CFG0 0x40007638u
#define CYDEV_PHUB_CFGMEM7_CFG1 0x4000763cu
#define CYDEV_PHUB_CFGMEM8_BASE 0x40007640u
#define CYDEV_PHUB_CFGMEM8_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM8_CFG0 0x40007640u
#define CYDEV_PHUB_CFGMEM8_CFG1 0x40007644u
#define CYDEV_PHUB_CFGMEM9_BASE 0x40007648u
#define CYDEV_PHUB_CFGMEM9_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM9_CFG0 0x40007648u
#define CYDEV_PHUB_CFGMEM9_CFG1 0x4000764cu
#define CYDEV_PHUB_CFGMEM10_BASE 0x40007650u
#define CYDEV_PHUB_CFGMEM10_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM10_CFG0 0x40007650u
#define CYDEV_PHUB_CFGMEM10_CFG1 0x40007654u
#define CYDEV_PHUB_CFGMEM11_BASE 0x40007658u
#define CYDEV_PHUB_CFGMEM11_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM11_CFG0 0x40007658u
#define CYDEV_PHUB_CFGMEM11_CFG1 0x4000765cu
#define CYDEV_PHUB_CFGMEM12_BASE 0x40007660u
#define CYDEV_PHUB_CFGMEM12_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM12_CFG0 0x40007660u
#define CYDEV_PHUB_CFGMEM12_CFG1 0x40007664u
#define CYDEV_PHUB_CFGMEM13_BASE 0x40007668u
#define CYDEV_PHUB_CFGMEM13_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM13_CFG0 0x40007668u
#define CYDEV_PHUB_CFGMEM13_CFG1 0x4000766cu
#define CYDEV_PHUB_CFGMEM14_BASE 0x40007670u
#define CYDEV_PHUB_CFGMEM14_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM14_CFG0 0x40007670u
#define CYDEV_PHUB_CFGMEM14_CFG1 0x40007674u
#define CYDEV_PHUB_CFGMEM15_BASE 0x40007678u
#define CYDEV_PHUB_CFGMEM15_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM15_CFG0 0x40007678u
#define CYDEV_PHUB_CFGMEM15_CFG1 0x4000767cu
#define CYDEV_PHUB_CFGMEM16_BASE 0x40007680u
#define CYDEV_PHUB_CFGMEM16_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM16_CFG0 0x40007680u
#define CYDEV_PHUB_CFGMEM16_CFG1 0x40007684u
#define CYDEV_PHUB_CFGMEM17_BASE 0x40007688u
#define CYDEV_PHUB_CFGMEM17_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM17_CFG0 0x40007688u
#define CYDEV_PHUB_CFGMEM17_CFG1 0x4000768cu
#define CYDEV_PHUB_CFGMEM18_BASE 0x40007690u
#define CYDEV_PHUB_CFGMEM18_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM18_CFG0 0x40007690u
#define CYDEV_PHUB_CFGMEM18_CFG1 0x40007694u
#define CYDEV_PHUB_CFGMEM19_BASE 0x40007698u
#define CYDEV_PHUB_CFGMEM19_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM19_CFG0 0x40007698u
#define CYDEV_PHUB_CFGMEM19_CFG1 0x4000769cu
#define CYDEV_PHUB_CFGMEM20_BASE 0x400076a0u
#define CYDEV_PHUB_CFGMEM20_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM20_CFG0 0x400076a0u
#define CYDEV_PHUB_CFGMEM20_CFG1 0x400076a4u
#define CYDEV_PHUB_CFGMEM21_BASE 0x400076a8u
#define CYDEV_PHUB_CFGMEM21_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM21_CFG0 0x400076a8u
#define CYDEV_PHUB_CFGMEM21_CFG1 0x400076acu
#define CYDEV_PHUB_CFGMEM22_BASE 0x400076b0u
#define CYDEV_PHUB_CFGMEM22_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM22_CFG0 0x400076b0u
#define CYDEV_PHUB_CFGMEM22_CFG1 0x400076b4u
#define CYDEV_PHUB_CFGMEM23_BASE 0x400076b8u
#define CYDEV_PHUB_CFGMEM23_SIZE 0x00000008u
#define CYDEV_PHUB_CFGMEM23_CFG0 0x400076b8u
#define CYDEV_PHUB_CFGMEM23_CFG1 0x400076bcu
#define CYDEV_PHUB_TDMEM0_BASE 0x40007800u
#define CYDEV_PHUB_TDMEM0_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM0_ORIG_TD0 0x40007800u
#define CYDEV_PHUB_TDMEM0_ORIG_TD1 0x40007804u
#define CYDEV_PHUB_TDMEM1_BASE 0x40007808u
#define CYDEV_PHUB_TDMEM1_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM1_ORIG_TD0 0x40007808u
#define CYDEV_PHUB_TDMEM1_ORIG_TD1 0x4000780cu
#define CYDEV_PHUB_TDMEM2_BASE 0x40007810u
#define CYDEV_PHUB_TDMEM2_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM2_ORIG_TD0 0x40007810u
#define CYDEV_PHUB_TDMEM2_ORIG_TD1 0x40007814u
#define CYDEV_PHUB_TDMEM3_BASE 0x40007818u
#define CYDEV_PHUB_TDMEM3_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM3_ORIG_TD0 0x40007818u
#define CYDEV_PHUB_TDMEM3_ORIG_TD1 0x4000781cu
#define CYDEV_PHUB_TDMEM4_BASE 0x40007820u
#define CYDEV_PHUB_TDMEM4_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM4_ORIG_TD0 0x40007820u
#define CYDEV_PHUB_TDMEM4_ORIG_TD1 0x40007824u
#define CYDEV_PHUB_TDMEM5_BASE 0x40007828u
#define CYDEV_PHUB_TDMEM5_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM5_ORIG_TD0 0x40007828u
#define CYDEV_PHUB_TDMEM5_ORIG_TD1 0x4000782cu
#define CYDEV_PHUB_TDMEM6_BASE 0x40007830u
#define CYDEV_PHUB_TDMEM6_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM6_ORIG_TD0 0x40007830u
#define CYDEV_PHUB_TDMEM6_ORIG_TD1 0x40007834u
#define CYDEV_PHUB_TDMEM7_BASE 0x40007838u
#define CYDEV_PHUB_TDMEM7_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM7_ORIG_TD0 0x40007838u
#define CYDEV_PHUB_TDMEM7_ORIG_TD1 0x4000783cu
#define CYDEV_PHUB_TDMEM8_BASE 0x40007840u
#define CYDEV_PHUB_TDMEM8_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM8_ORIG_TD0 0x40007840u
#define CYDEV_PHUB_TDMEM8_ORIG_TD1 0x40007844u
#define CYDEV_PHUB_TDMEM9_BASE 0x40007848u
#define CYDEV_PHUB_TDMEM9_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM9_ORIG_TD0 0x40007848u
#define CYDEV_PHUB_TDMEM9_ORIG_TD1 0x4000784cu
#define CYDEV_PHUB_TDMEM10_BASE 0x40007850u
#define CYDEV_PHUB_TDMEM10_SIZE 0x00000008u
