MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
#define CYDEV_PHUB_TDMEM10_ORIG_TD0 0x40007850u
#define CYDEV_PHUB_TDMEM10_ORIG_TD1 0x40007854u
#define CYDEV_PHUB_TDMEM11_BASE 0x40007858u
#define CYDEV_PHUB_TDMEM11_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM11_ORIG_TD0 0x40007858u
#define CYDEV_PHUB_TDMEM11_ORIG_TD1 0x4000785cu
#define CYDEV_PHUB_TDMEM12_BASE 0x40007860u
#define CYDEV_PHUB_TDMEM12_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM12_ORIG_TD0 0x40007860u
#define CYDEV_PHUB_TDMEM12_ORIG_TD1 0x40007864u
#define CYDEV_PHUB_TDMEM13_BASE 0x40007868u
#define CYDEV_PHUB_TDMEM13_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM13_ORIG_TD0 0x40007868u
#define CYDEV_PHUB_TDMEM13_ORIG_TD1 0x4000786cu
#define CYDEV_PHUB_TDMEM14_BASE 0x40007870u
#define CYDEV_PHUB_TDMEM14_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM14_ORIG_TD0 0x40007870u
#define CYDEV_PHUB_TDMEM14_ORIG_TD1 0x40007874u
#define CYDEV_PHUB_TDMEM15_BASE 0x40007878u
#define CYDEV_PHUB_TDMEM15_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM15_ORIG_TD0 0x40007878u
#define CYDEV_PHUB_TDMEM15_ORIG_TD1 0x4000787cu
#define CYDEV_PHUB_TDMEM16_BASE 0x40007880u
#define CYDEV_PHUB_TDMEM16_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM16_ORIG_TD0 0x40007880u
#define CYDEV_PHUB_TDMEM16_ORIG_TD1 0x40007884u
#define CYDEV_PHUB_TDMEM17_BASE 0x40007888u
#define CYDEV_PHUB_TDMEM17_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM17_ORIG_TD0 0x40007888u
#define CYDEV_PHUB_TDMEM17_ORIG_TD1 0x4000788cu
#define CYDEV_PHUB_TDMEM18_BASE 0x40007890u
#define CYDEV_PHUB_TDMEM18_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM18_ORIG_TD0 0x40007890u
#define CYDEV_PHUB_TDMEM18_ORIG_TD1 0x40007894u
#define CYDEV_PHUB_TDMEM19_BASE 0x40007898u
#define CYDEV_PHUB_TDMEM19_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM19_ORIG_TD0 0x40007898u
#define CYDEV_PHUB_TDMEM19_ORIG_TD1 0x4000789cu
#define CYDEV_PHUB_TDMEM20_BASE 0x400078a0u
#define CYDEV_PHUB_TDMEM20_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM20_ORIG_TD0 0x400078a0u
#define CYDEV_PHUB_TDMEM20_ORIG_TD1 0x400078a4u
#define CYDEV_PHUB_TDMEM21_BASE 0x400078a8u
#define CYDEV_PHUB_TDMEM21_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM21_ORIG_TD0 0x400078a8u
#define CYDEV_PHUB_TDMEM21_ORIG_TD1 0x400078acu
#define CYDEV_PHUB_TDMEM22_BASE 0x400078b0u
#define CYDEV_PHUB_TDMEM22_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM22_ORIG_TD0 0x400078b0u
#define CYDEV_PHUB_TDMEM22_ORIG_TD1 0x400078b4u
#define CYDEV_PHUB_TDMEM23_BASE 0x400078b8u
#define CYDEV_PHUB_TDMEM23_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM23_ORIG_TD0 0x400078b8u
#define CYDEV_PHUB_TDMEM23_ORIG_TD1 0x400078bcu
#define CYDEV_PHUB_TDMEM24_BASE 0x400078c0u
#define CYDEV_PHUB_TDMEM24_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM24_ORIG_TD0 0x400078c0u
#define CYDEV_PHUB_TDMEM24_ORIG_TD1 0x400078c4u
#define CYDEV_PHUB_TDMEM25_BASE 0x400078c8u
#define CYDEV_PHUB_TDMEM25_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM25_ORIG_TD0 0x400078c8u
#define CYDEV_PHUB_TDMEM25_ORIG_TD1 0x400078ccu
#define CYDEV_PHUB_TDMEM26_BASE 0x400078d0u
#define CYDEV_PHUB_TDMEM26_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM26_ORIG_TD0 0x400078d0u
#define CYDEV_PHUB_TDMEM26_ORIG_TD1 0x400078d4u
#define CYDEV_PHUB_TDMEM27_BASE 0x400078d8u
#define CYDEV_PHUB_TDMEM27_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM27_ORIG_TD0 0x400078d8u
#define CYDEV_PHUB_TDMEM27_ORIG_TD1 0x400078dcu
#define CYDEV_PHUB_TDMEM28_BASE 0x400078e0u
#define CYDEV_PHUB_TDMEM28_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM28_ORIG_TD0 0x400078e0u
#define CYDEV_PHUB_TDMEM28_ORIG_TD1 0x400078e4u
#define CYDEV_PHUB_TDMEM29_BASE 0x400078e8u
#define CYDEV_PHUB_TDMEM29_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM29_ORIG_TD0 0x400078e8u
#define CYDEV_PHUB_TDMEM29_ORIG_TD1 0x400078ecu
#define CYDEV_PHUB_TDMEM30_BASE 0x400078f0u
#define CYDEV_PHUB_TDMEM30_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM30_ORIG_TD0 0x400078f0u
#define CYDEV_PHUB_TDMEM30_ORIG_TD1 0x400078f4u
#define CYDEV_PHUB_TDMEM31_BASE 0x400078f8u
#define CYDEV_PHUB_TDMEM31_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM31_ORIG_TD0 0x400078f8u
#define CYDEV_PHUB_TDMEM31_ORIG_TD1 0x400078fcu
#define CYDEV_PHUB_TDMEM32_BASE 0x40007900u
#define CYDEV_PHUB_TDMEM32_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM32_ORIG_TD0 0x40007900u
#define CYDEV_PHUB_TDMEM32_ORIG_TD1 0x40007904u
#define CYDEV_PHUB_TDMEM33_BASE 0x40007908u
#define CYDEV_PHUB_TDMEM33_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM33_ORIG_TD0 0x40007908u
#define CYDEV_PHUB_TDMEM33_ORIG_TD1 0x4000790cu
#define CYDEV_PHUB_TDMEM34_BASE 0x40007910u
#define CYDEV_PHUB_TDMEM34_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM34_ORIG_TD0 0x40007910u
#define CYDEV_PHUB_TDMEM34_ORIG_TD1 0x40007914u
#define CYDEV_PHUB_TDMEM35_BASE 0x40007918u
#define CYDEV_PHUB_TDMEM35_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM35_ORIG_TD0 0x40007918u
#define CYDEV_PHUB_TDMEM35_ORIG_TD1 0x4000791cu
#define CYDEV_PHUB_TDMEM36_BASE 0x40007920u
#define CYDEV_PHUB_TDMEM36_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM36_ORIG_TD0 0x40007920u
#define CYDEV_PHUB_TDMEM36_ORIG_TD1 0x40007924u
#define CYDEV_PHUB_TDMEM37_BASE 0x40007928u
#define CYDEV_PHUB_TDMEM37_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM37_ORIG_TD0 0x40007928u
#define CYDEV_PHUB_TDMEM37_ORIG_TD1 0x4000792cu
#define CYDEV_PHUB_TDMEM38_BASE 0x40007930u
#define CYDEV_PHUB_TDMEM38_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM38_ORIG_TD0 0x40007930u
#define CYDEV_PHUB_TDMEM38_ORIG_TD1 0x40007934u
#define CYDEV_PHUB_TDMEM39_BASE 0x40007938u
#define CYDEV_PHUB_TDMEM39_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM39_ORIG_TD0 0x40007938u
#define CYDEV_PHUB_TDMEM39_ORIG_TD1 0x4000793cu
#define CYDEV_PHUB_TDMEM40_BASE 0x40007940u
#define CYDEV_PHUB_TDMEM40_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM40_ORIG_TD0 0x40007940u
#define CYDEV_PHUB_TDMEM40_ORIG_TD1 0x40007944u
#define CYDEV_PHUB_TDMEM41_BASE 0x40007948u
#define CYDEV_PHUB_TDMEM41_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM41_ORIG_TD0 0x40007948u
#define CYDEV_PHUB_TDMEM41_ORIG_TD1 0x4000794cu
#define CYDEV_PHUB_TDMEM42_BASE 0x40007950u
#define CYDEV_PHUB_TDMEM42_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM42_ORIG_TD0 0x40007950u
#define CYDEV_PHUB_TDMEM42_ORIG_TD1 0x40007954u
#define CYDEV_PHUB_TDMEM43_BASE 0x40007958u
#define CYDEV_PHUB_TDMEM43_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM43_ORIG_TD0 0x40007958u
#define CYDEV_PHUB_TDMEM43_ORIG_TD1 0x4000795cu
#define CYDEV_PHUB_TDMEM44_BASE 0x40007960u
#define CYDEV_PHUB_TDMEM44_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM44_ORIG_TD0 0x40007960u
#define CYDEV_PHUB_TDMEM44_ORIG_TD1 0x40007964u
#define CYDEV_PHUB_TDMEM45_BASE 0x40007968u
#define CYDEV_PHUB_TDMEM45_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM45_ORIG_TD0 0x40007968u
#define CYDEV_PHUB_TDMEM45_ORIG_TD1 0x4000796cu
#define CYDEV_PHUB_TDMEM46_BASE 0x40007970u
#define CYDEV_PHUB_TDMEM46_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM46_ORIG_TD0 0x40007970u
#define CYDEV_PHUB_TDMEM46_ORIG_TD1 0x40007974u
#define CYDEV_PHUB_TDMEM47_BASE 0x40007978u
#define CYDEV_PHUB_TDMEM47_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM47_ORIG_TD0 0x40007978u
#define CYDEV_PHUB_TDMEM47_ORIG_TD1 0x4000797cu
#define CYDEV_PHUB_TDMEM48_BASE 0x40007980u
#define CYDEV_PHUB_TDMEM48_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM48_ORIG_TD0 0x40007980u
#define CYDEV_PHUB_TDMEM48_ORIG_TD1 0x40007984u
#define CYDEV_PHUB_TDMEM49_BASE 0x40007988u
#define CYDEV_PHUB_TDMEM49_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM49_ORIG_TD0 0x40007988u
#define CYDEV_PHUB_TDMEM49_ORIG_TD1 0x4000798cu
#define CYDEV_PHUB_TDMEM50_BASE 0x40007990u
#define CYDEV_PHUB_TDMEM50_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM50_ORIG_TD0 0x40007990u
#define CYDEV_PHUB_TDMEM50_ORIG_TD1 0x40007994u
#define CYDEV_PHUB_TDMEM51_BASE 0x40007998u
#define CYDEV_PHUB_TDMEM51_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM51_ORIG_TD0 0x40007998u
#define CYDEV_PHUB_TDMEM51_ORIG_TD1 0x4000799cu
#define CYDEV_PHUB_TDMEM52_BASE 0x400079a0u
#define CYDEV_PHUB_TDMEM52_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM52_ORIG_TD0 0x400079a0u
#define CYDEV_PHUB_TDMEM52_ORIG_TD1 0x400079a4u
#define CYDEV_PHUB_TDMEM53_BASE 0x400079a8u
#define CYDEV_PHUB_TDMEM53_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM53_ORIG_TD0 0x400079a8u
#define CYDEV_PHUB_TDMEM53_ORIG_TD1 0x400079acu
#define CYDEV_PHUB_TDMEM54_BASE 0x400079b0u
#define CYDEV_PHUB_TDMEM54_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM54_ORIG_TD0 0x400079b0u
#define CYDEV_PHUB_TDMEM54_ORIG_TD1 0x400079b4u
#define CYDEV_PHUB_TDMEM55_BASE 0x400079b8u
#define CYDEV_PHUB_TDMEM55_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM55_ORIG_TD0 0x400079b8u
#define CYDEV_PHUB_TDMEM55_ORIG_TD1 0x400079bcu
#define CYDEV_PHUB_TDMEM56_BASE 0x400079c0u
#define CYDEV_PHUB_TDMEM56_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM56_ORIG_TD0 0x400079c0u
#define CYDEV_PHUB_TDMEM56_ORIG_TD1 0x400079c4u
#define CYDEV_PHUB_TDMEM57_BASE 0x400079c8u
#define CYDEV_PHUB_TDMEM57_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM57_ORIG_TD0 0x400079c8u
#define CYDEV_PHUB_TDMEM57_ORIG_TD1 0x400079ccu
#define CYDEV_PHUB_TDMEM58_BASE 0x400079d0u
#define CYDEV_PHUB_TDMEM58_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM58_ORIG_TD0 0x400079d0u
#define CYDEV_PHUB_TDMEM58_ORIG_TD1 0x400079d4u
#define CYDEV_PHUB_TDMEM59_BASE 0x400079d8u
#define CYDEV_PHUB_TDMEM59_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM59_ORIG_TD0 0x400079d8u
#define CYDEV_PHUB_TDMEM59_ORIG_TD1 0x400079dcu
#define CYDEV_PHUB_TDMEM60_BASE 0x400079e0u
#define CYDEV_PHUB_TDMEM60_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM60_ORIG_TD0 0x400079e0u
#define CYDEV_PHUB_TDMEM60_ORIG_TD1 0x400079e4u
#define CYDEV_PHUB_TDMEM61_BASE 0x400079e8u
#define CYDEV_PHUB_TDMEM61_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM61_ORIG_TD0 0x400079e8u
#define CYDEV_PHUB_TDMEM61_ORIG_TD1 0x400079ecu
#define CYDEV_PHUB_TDMEM62_BASE 0x400079f0u
#define CYDEV_PHUB_TDMEM62_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM62_ORIG_TD0 0x400079f0u
#define CYDEV_PHUB_TDMEM62_ORIG_TD1 0x400079f4u
#define CYDEV_PHUB_TDMEM63_BASE 0x400079f8u
#define CYDEV_PHUB_TDMEM63_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM63_ORIG_TD0 0x400079f8u
#define CYDEV_PHUB_TDMEM63_ORIG_TD1 0x400079fcu
#define CYDEV_PHUB_TDMEM64_BASE 0x40007a00u
#define CYDEV_PHUB_TDMEM64_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM64_ORIG_TD0 0x40007a00u
#define CYDEV_PHUB_TDMEM64_ORIG_TD1 0x40007a04u
#define CYDEV_PHUB_TDMEM65_BASE 0x40007a08u
#define CYDEV_PHUB_TDMEM65_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM65_ORIG_TD0 0x40007a08u
#define CYDEV_PHUB_TDMEM65_ORIG_TD1 0x40007a0cu
#define CYDEV_PHUB_TDMEM66_BASE 0x40007a10u
#define CYDEV_PHUB_TDMEM66_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM66_ORIG_TD0 0x40007a10u
#define CYDEV_PHUB_TDMEM66_ORIG_TD1 0x40007a14u
#define CYDEV_PHUB_TDMEM67_BASE 0x40007a18u
#define CYDEV_PHUB_TDMEM67_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM67_ORIG_TD0 0x40007a18u
#define CYDEV_PHUB_TDMEM67_ORIG_TD1 0x40007a1cu
#define CYDEV_PHUB_TDMEM68_BASE 0x40007a20u
#define CYDEV_PHUB_TDMEM68_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM68_ORIG_TD0 0x40007a20u
#define CYDEV_PHUB_TDMEM68_ORIG_TD1 0x40007a24u
#define CYDEV_PHUB_TDMEM69_BASE 0x40007a28u
#define CYDEV_PHUB_TDMEM69_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM69_ORIG_TD0 0x40007a28u
#define CYDEV_PHUB_TDMEM69_ORIG_TD1 0x40007a2cu
#define CYDEV_PHUB_TDMEM70_BASE 0x40007a30u
#define CYDEV_PHUB_TDMEM70_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM70_ORIG_TD0 0x40007a30u
#define CYDEV_PHUB_TDMEM70_ORIG_TD1 0x40007a34u
#define CYDEV_PHUB_TDMEM71_BASE 0x40007a38u
#define CYDEV_PHUB_TDMEM71_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM71_ORIG_TD0 0x40007a38u
#define CYDEV_PHUB_TDMEM71_ORIG_TD1 0x40007a3cu
#define CYDEV_PHUB_TDMEM72_BASE 0x40007a40u
#define CYDEV_PHUB_TDMEM72_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM72_ORIG_TD0 0x40007a40u
#define CYDEV_PHUB_TDMEM72_ORIG_TD1 0x40007a44u
#define CYDEV_PHUB_TDMEM73_BASE 0x40007a48u
#define CYDEV_PHUB_TDMEM73_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM73_ORIG_TD0 0x40007a48u
#define CYDEV_PHUB_TDMEM73_ORIG_TD1 0x40007a4cu
#define CYDEV_PHUB_TDMEM74_BASE 0x40007a50u
#define CYDEV_PHUB_TDMEM74_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM74_ORIG_TD0 0x40007a50u
#define CYDEV_PHUB_TDMEM74_ORIG_TD1 0x40007a54u
#define CYDEV_PHUB_TDMEM75_BASE 0x40007a58u
#define CYDEV_PHUB_TDMEM75_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM75_ORIG_TD0 0x40007a58u
#define CYDEV_PHUB_TDMEM75_ORIG_TD1 0x40007a5cu
#define CYDEV_PHUB_TDMEM76_BASE 0x40007a60u
#define CYDEV_PHUB_TDMEM76_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM76_ORIG_TD0 0x40007a60u
#define CYDEV_PHUB_TDMEM76_ORIG_TD1 0x40007a64u
#define CYDEV_PHUB_TDMEM77_BASE 0x40007a68u
#define CYDEV_PHUB_TDMEM77_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM77_ORIG_TD0 0x40007a68u
#define CYDEV_PHUB_TDMEM77_ORIG_TD1 0x40007a6cu
#define CYDEV_PHUB_TDMEM78_BASE 0x40007a70u
#define CYDEV_PHUB_TDMEM78_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM78_ORIG_TD0 0x40007a70u
#define CYDEV_PHUB_TDMEM78_ORIG_TD1 0x40007a74u
#define CYDEV_PHUB_TDMEM79_BASE 0x40007a78u
#define CYDEV_PHUB_TDMEM79_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM79_ORIG_TD0 0x40007a78u
#define CYDEV_PHUB_TDMEM79_ORIG_TD1 0x40007a7cu
#define CYDEV_PHUB_TDMEM80_BASE 0x40007a80u
#define CYDEV_PHUB_TDMEM80_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM80_ORIG_TD0 0x40007a80u
#define CYDEV_PHUB_TDMEM80_ORIG_TD1 0x40007a84u
#define CYDEV_PHUB_TDMEM81_BASE 0x40007a88u
#define CYDEV_PHUB_TDMEM81_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM81_ORIG_TD0 0x40007a88u
#define CYDEV_PHUB_TDMEM81_ORIG_TD1 0x40007a8cu
#define CYDEV_PHUB_TDMEM82_BASE 0x40007a90u
#define CYDEV_PHUB_TDMEM82_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM82_ORIG_TD0 0x40007a90u
#define CYDEV_PHUB_TDMEM82_ORIG_TD1 0x40007a94u
#define CYDEV_PHUB_TDMEM83_BASE 0x40007a98u
#define CYDEV_PHUB_TDMEM83_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM83_ORIG_TD0 0x40007a98u
#define CYDEV_PHUB_TDMEM83_ORIG_TD1 0x40007a9cu
#define CYDEV_PHUB_TDMEM84_BASE 0x40007aa0u
#define CYDEV_PHUB_TDMEM84_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM84_ORIG_TD0 0x40007aa0u
#define CYDEV_PHUB_TDMEM84_ORIG_TD1 0x40007aa4u
#define CYDEV_PHUB_TDMEM85_BASE 0x40007aa8u
#define CYDEV_PHUB_TDMEM85_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM85_ORIG_TD0 0x40007aa8u
#define CYDEV_PHUB_TDMEM85_ORIG_TD1 0x40007aacu
#define CYDEV_PHUB_TDMEM86_BASE 0x40007ab0u
#define CYDEV_PHUB_TDMEM86_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM86_ORIG_TD0 0x40007ab0u
#define CYDEV_PHUB_TDMEM86_ORIG_TD1 0x40007ab4u
#define CYDEV_PHUB_TDMEM87_BASE 0x40007ab8u
#define CYDEV_PHUB_TDMEM87_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM87_ORIG_TD0 0x40007ab8u
#define CYDEV_PHUB_TDMEM87_ORIG_TD1 0x40007abcu
#define CYDEV_PHUB_TDMEM88_BASE 0x40007ac0u
#define CYDEV_PHUB_TDMEM88_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM88_ORIG_TD0 0x40007ac0u
#define CYDEV_PHUB_TDMEM88_ORIG_TD1 0x40007ac4u
#define CYDEV_PHUB_TDMEM89_BASE 0x40007ac8u
#define CYDEV_PHUB_TDMEM89_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM89_ORIG_TD0 0x40007ac8u
#define CYDEV_PHUB_TDMEM89_ORIG_TD1 0x40007accu
#define CYDEV_PHUB_TDMEM90_BASE 0x40007ad0u
#define CYDEV_PHUB_TDMEM90_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM90_ORIG_TD0 0x40007ad0u
#define CYDEV_PHUB_TDMEM90_ORIG_TD1 0x40007ad4u
#define CYDEV_PHUB_TDMEM91_BASE 0x40007ad8u
#define CYDEV_PHUB_TDMEM91_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM91_ORIG_TD0 0x40007ad8u
#define CYDEV_PHUB_TDMEM91_ORIG_TD1 0x40007adcu
#define CYDEV_PHUB_TDMEM92_BASE 0x40007ae0u
#define CYDEV_PHUB_TDMEM92_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM92_ORIG_TD0 0x40007ae0u
#define CYDEV_PHUB_TDMEM92_ORIG_TD1 0x40007ae4u
#define CYDEV_PHUB_TDMEM93_BASE 0x40007ae8u
#define CYDEV_PHUB_TDMEM93_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM93_ORIG_TD0 0x40007ae8u
#define CYDEV_PHUB_TDMEM93_ORIG_TD1 0x40007aecu
#define CYDEV_PHUB_TDMEM94_BASE 0x40007af0u
#define CYDEV_PHUB_TDMEM94_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM94_ORIG_TD0 0x40007af0u
#define CYDEV_PHUB_TDMEM94_ORIG_TD1 0x40007af4u
#define CYDEV_PHUB_TDMEM95_BASE 0x40007af8u
#define CYDEV_PHUB_TDMEM95_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM95_ORIG_TD0 0x40007af8u
#define CYDEV_PHUB_TDMEM95_ORIG_TD1 0x40007afcu
#define CYDEV_PHUB_TDMEM96_BASE 0x40007b00u
#define CYDEV_PHUB_TDMEM96_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM96_ORIG_TD0 0x40007b00u
#define CYDEV_PHUB_TDMEM96_ORIG_TD1 0x40007b04u
#define CYDEV_PHUB_TDMEM97_BASE 0x40007b08u
#define CYDEV_PHUB_TDMEM97_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM97_ORIG_TD0 0x40007b08u
#define CYDEV_PHUB_TDMEM97_ORIG_TD1 0x40007b0cu
#define CYDEV_PHUB_TDMEM98_BASE 0x40007b10u
#define CYDEV_PHUB_TDMEM98_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM98_ORIG_TD0 0x40007b10u
#define CYDEV_PHUB_TDMEM98_ORIG_TD1 0x40007b14u
#define CYDEV_PHUB_TDMEM99_BASE 0x40007b18u
#define CYDEV_PHUB_TDMEM99_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM99_ORIG_TD0 0x40007b18u
#define CYDEV_PHUB_TDMEM99_ORIG_TD1 0x40007b1cu
#define CYDEV_PHUB_TDMEM100_BASE 0x40007b20u
#define CYDEV_PHUB_TDMEM100_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM100_ORIG_TD0 0x40007b20u
#define CYDEV_PHUB_TDMEM100_ORIG_TD1 0x40007b24u
#define CYDEV_PHUB_TDMEM101_BASE 0x40007b28u
#define CYDEV_PHUB_TDMEM101_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM101_ORIG_TD0 0x40007b28u
#define CYDEV_PHUB_TDMEM101_ORIG_TD1 0x40007b2cu
#define CYDEV_PHUB_TDMEM102_BASE 0x40007b30u
#define CYDEV_PHUB_TDMEM102_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM102_ORIG_TD0 0x40007b30u
#define CYDEV_PHUB_TDMEM102_ORIG_TD1 0x40007b34u
#define CYDEV_PHUB_TDMEM103_BASE 0x40007b38u
#define CYDEV_PHUB_TDMEM103_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM103_ORIG_TD0 0x40007b38u
#define CYDEV_PHUB_TDMEM103_ORIG_TD1 0x40007b3cu
#define CYDEV_PHUB_TDMEM104_BASE 0x40007b40u
#define CYDEV_PHUB_TDMEM104_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM104_ORIG_TD0 0x40007b40u
#define CYDEV_PHUB_TDMEM104_ORIG_TD1 0x40007b44u
#define CYDEV_PHUB_TDMEM105_BASE 0x40007b48u
#define CYDEV_PHUB_TDMEM105_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM105_ORIG_TD0 0x40007b48u
#define CYDEV_PHUB_TDMEM105_ORIG_TD1 0x40007b4cu
#define CYDEV_PHUB_TDMEM106_BASE 0x40007b50u
#define CYDEV_PHUB_TDMEM106_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM106_ORIG_TD0 0x40007b50u
#define CYDEV_PHUB_TDMEM106_ORIG_TD1 0x40007b54u
#define CYDEV_PHUB_TDMEM107_BASE 0x40007b58u
#define CYDEV_PHUB_TDMEM107_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM107_ORIG_TD0 0x40007b58u
#define CYDEV_PHUB_TDMEM107_ORIG_TD1 0x40007b5cu
#define CYDEV_PHUB_TDMEM108_BASE 0x40007b60u
#define CYDEV_PHUB_TDMEM108_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM108_ORIG_TD0 0x40007b60u
#define CYDEV_PHUB_TDMEM108_ORIG_TD1 0x40007b64u
#define CYDEV_PHUB_TDMEM109_BASE 0x40007b68u
#define CYDEV_PHUB_TDMEM109_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM109_ORIG_TD0 0x40007b68u
#define CYDEV_PHUB_TDMEM109_ORIG_TD1 0x40007b6cu
#define CYDEV_PHUB_TDMEM110_BASE 0x40007b70u
#define CYDEV_PHUB_TDMEM110_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM110_ORIG_TD0 0x40007b70u
#define CYDEV_PHUB_TDMEM110_ORIG_TD1 0x40007b74u
#define CYDEV_PHUB_TDMEM111_BASE 0x40007b78u
#define CYDEV_PHUB_TDMEM111_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM111_ORIG_TD0 0x40007b78u
#define CYDEV_PHUB_TDMEM111_ORIG_TD1 0x40007b7cu
#define CYDEV_PHUB_TDMEM112_BASE 0x40007b80u
#define CYDEV_PHUB_TDMEM112_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM112_ORIG_TD0 0x40007b80u
#define CYDEV_PHUB_TDMEM112_ORIG_TD1 0x40007b84u
#define CYDEV_PHUB_TDMEM113_BASE 0x40007b88u
#define CYDEV_PHUB_TDMEM113_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM113_ORIG_TD0 0x40007b88u
#define CYDEV_PHUB_TDMEM113_ORIG_TD1 0x40007b8cu
#define CYDEV_PHUB_TDMEM114_BASE 0x40007b90u
#define CYDEV_PHUB_TDMEM114_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM114_ORIG_TD0 0x40007b90u
#define CYDEV_PHUB_TDMEM114_ORIG_TD1 0x40007b94u
#define CYDEV_PHUB_TDMEM115_BASE 0x40007b98u
#define CYDEV_PHUB_TDMEM115_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM115_ORIG_TD0 0x40007b98u
#define CYDEV_PHUB_TDMEM115_ORIG_TD1 0x40007b9cu
#define CYDEV_PHUB_TDMEM116_BASE 0x40007ba0u
#define CYDEV_PHUB_TDMEM116_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM116_ORIG_TD0 0x40007ba0u
#define CYDEV_PHUB_TDMEM116_ORIG_TD1 0x40007ba4u
#define CYDEV_PHUB_TDMEM117_BASE 0x40007ba8u
#define CYDEV_PHUB_TDMEM117_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM117_ORIG_TD0 0x40007ba8u
#define CYDEV_PHUB_TDMEM117_ORIG_TD1 0x40007bacu
#define CYDEV_PHUB_TDMEM118_BASE 0x40007bb0u
#define CYDEV_PHUB_TDMEM118_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM118_ORIG_TD0 0x40007bb0u
#define CYDEV_PHUB_TDMEM118_ORIG_TD1 0x40007bb4u
#define CYDEV_PHUB_TDMEM119_BASE 0x40007bb8u
#define CYDEV_PHUB_TDMEM119_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM119_ORIG_TD0 0x40007bb8u
#define CYDEV_PHUB_TDMEM119_ORIG_TD1 0x40007bbcu
#define CYDEV_PHUB_TDMEM120_BASE 0x40007bc0u
#define CYDEV_PHUB_TDMEM120_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM120_ORIG_TD0 0x40007bc0u
#define CYDEV_PHUB_TDMEM120_ORIG_TD1 0x40007bc4u
#define CYDEV_PHUB_TDMEM121_BASE 0x40007bc8u
#define CYDEV_PHUB_TDMEM121_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM121_ORIG_TD0 0x40007bc8u
#define CYDEV_PHUB_TDMEM121_ORIG_TD1 0x40007bccu
#define CYDEV_PHUB_TDMEM122_BASE 0x40007bd0u
#define CYDEV_PHUB_TDMEM122_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM122_ORIG_TD0 0x40007bd0u
#define CYDEV_PHUB_TDMEM122_ORIG_TD1 0x40007bd4u
#define CYDEV_PHUB_TDMEM123_BASE 0x40007bd8u
#define CYDEV_PHUB_TDMEM123_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM123_ORIG_TD0 0x40007bd8u
#define CYDEV_PHUB_TDMEM123_ORIG_TD1 0x40007bdcu
#define CYDEV_PHUB_TDMEM124_BASE 0x40007be0u
#define CYDEV_PHUB_TDMEM124_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM124_ORIG_TD0 0x40007be0u
#define CYDEV_PHUB_TDMEM124_ORIG_TD1 0x40007be4u
#define CYDEV_PHUB_TDMEM125_BASE 0x40007be8u
#define CYDEV_PHUB_TDMEM125_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM125_ORIG_TD0 0x40007be8u
#define CYDEV_PHUB_TDMEM125_ORIG_TD1 0x40007becu
#define CYDEV_PHUB_TDMEM126_BASE 0x40007bf0u
#define CYDEV_PHUB_TDMEM126_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM126_ORIG_TD0 0x40007bf0u
#define CYDEV_PHUB_TDMEM126_ORIG_TD1 0x40007bf4u
#define CYDEV_PHUB_TDMEM127_BASE 0x40007bf8u
#define CYDEV_PHUB_TDMEM127_SIZE 0x00000008u
#define CYDEV_PHUB_TDMEM127_ORIG_TD0 0x40007bf8u
#define CYDEV_PHUB_TDMEM127_ORIG_TD1 0x40007bfcu
#define CYDEV_EE_BASE 0x40008000u
#define CYDEV_EE_SIZE 0x00000800u
#define CYDEV_EE_DATA_MBASE 0x40008000u
#define CYDEV_EE_DATA_MSIZE 0x00000800u
#define CYDEV_CAN0_BASE 0x4000a000u
#define CYDEV_CAN0_SIZE 0x000002a0u
#define CYDEV_CAN0_CSR_BASE 0x4000a000u
#define CYDEV_CAN0_CSR_SIZE 0x00000018u
#define CYDEV_CAN0_CSR_INT_SR 0x4000a000u
#define CYDEV_CAN0_CSR_INT_EN 0x4000a004u
#define CYDEV_CAN0_CSR_BUF_SR 0x4000a008u
#define CYDEV_CAN0_CSR_ERR_SR 0x4000a00cu
#define CYDEV_CAN0_CSR_CMD 0x4000a010u
#define CYDEV_CAN0_CSR_CFG 0x4000a014u
#define CYDEV_CAN0_TX0_BASE 0x4000a020u
#define CYDEV_CAN0_TX0_SIZE 0x00000010u
#define CYDEV_CAN0_TX0_CMD 0x4000a020u
#define CYDEV_CAN0_TX0_ID 0x4000a024u
#define CYDEV_CAN0_TX0_DH 0x4000a028u
#define CYDEV_CAN0_TX0_DL 0x4000a02cu
#define CYDEV_CAN0_TX1_BASE 0x4000a030u
#define CYDEV_CAN0_TX1_SIZE 0x00000010u
#define CYDEV_CAN0_TX1_CMD 0x4000a030u
#define CYDEV_CAN0_TX1_ID 0x4000a034u
#define CYDEV_CAN0_TX1_DH 0x4000a038u
#define CYDEV_CAN0_TX1_DL 0x4000a03cu
#define CYDEV_CAN0_TX2_BASE 0x4000a040u
#define CYDEV_CAN0_TX2_SIZE 0x00000010u
#define CYDEV_CAN0_TX2_CMD 0x4000a040u
#define CYDEV_CAN0_TX2_ID 0x4000a044u
#define CYDEV_CAN0_TX2_DH 0x4000a048u
#define CYDEV_CAN0_TX2_DL 0x4000a04cu
#define CYDEV_CAN0_TX3_BASE 0x4000a050u
#define CYDEV_CAN0_TX3_SIZE 0x00000010u
#define CYDEV_CAN0_TX3_CMD 0x4000a050u
#define CYDEV_CAN0_TX3_ID 0x4000a054u
#define CYDEV_CAN0_TX3_DH 0x4000a058u
#define CYDEV_CAN0_TX3_DL 0x4000a05cu
#define CYDEV_CAN0_TX4_BASE 0x4000a060u
#define CYDEV_CAN0_TX4_SIZE 0x00000010u
#define CYDEV_CAN0_TX4_CMD 0x4000a060u
#define CYDEV_CAN0_TX4_ID 0x4000a064u
#define CYDEV_CAN0_TX4_DH 0x4000a068u
#define CYDEV_CAN0_TX4_DL 0x4000a06cu
