MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
#define CYDEV_CAN0_TX5_BASE 0x4000a070u
#define CYDEV_CAN0_TX5_SIZE 0x00000010u
#define CYDEV_CAN0_TX5_CMD 0x4000a070u
#define CYDEV_CAN0_TX5_ID 0x4000a074u
#define CYDEV_CAN0_TX5_DH 0x4000a078u
#define CYDEV_CAN0_TX5_DL 0x4000a07cu
#define CYDEV_CAN0_TX6_BASE 0x4000a080u
#define CYDEV_CAN0_TX6_SIZE 0x00000010u
#define CYDEV_CAN0_TX6_CMD 0x4000a080u
#define CYDEV_CAN0_TX6_ID 0x4000a084u
#define CYDEV_CAN0_TX6_DH 0x4000a088u
#define CYDEV_CAN0_TX6_DL 0x4000a08cu
#define CYDEV_CAN0_TX7_BASE 0x4000a090u
#define CYDEV_CAN0_TX7_SIZE 0x00000010u
#define CYDEV_CAN0_TX7_CMD 0x4000a090u
#define CYDEV_CAN0_TX7_ID 0x4000a094u
#define CYDEV_CAN0_TX7_DH 0x4000a098u
#define CYDEV_CAN0_TX7_DL 0x4000a09cu
#define CYDEV_CAN0_RX0_BASE 0x4000a0a0u
#define CYDEV_CAN0_RX0_SIZE 0x00000020u
#define CYDEV_CAN0_RX0_CMD 0x4000a0a0u
#define CYDEV_CAN0_RX0_ID 0x4000a0a4u
#define CYDEV_CAN0_RX0_DH 0x4000a0a8u
#define CYDEV_CAN0_RX0_DL 0x4000a0acu
#define CYDEV_CAN0_RX0_AMR 0x4000a0b0u
#define CYDEV_CAN0_RX0_ACR 0x4000a0b4u
#define CYDEV_CAN0_RX0_AMRD 0x4000a0b8u
#define CYDEV_CAN0_RX0_ACRD 0x4000a0bcu
#define CYDEV_CAN0_RX1_BASE 0x4000a0c0u
#define CYDEV_CAN0_RX1_SIZE 0x00000020u
#define CYDEV_CAN0_RX1_CMD 0x4000a0c0u
#define CYDEV_CAN0_RX1_ID 0x4000a0c4u
#define CYDEV_CAN0_RX1_DH 0x4000a0c8u
#define CYDEV_CAN0_RX1_DL 0x4000a0ccu
#define CYDEV_CAN0_RX1_AMR 0x4000a0d0u
#define CYDEV_CAN0_RX1_ACR 0x4000a0d4u
#define CYDEV_CAN0_RX1_AMRD 0x4000a0d8u
#define CYDEV_CAN0_RX1_ACRD 0x4000a0dcu
#define CYDEV_CAN0_RX2_BASE 0x4000a0e0u
#define CYDEV_CAN0_RX2_SIZE 0x00000020u
#define CYDEV_CAN0_RX2_CMD 0x4000a0e0u
#define CYDEV_CAN0_RX2_ID 0x4000a0e4u
#define CYDEV_CAN0_RX2_DH 0x4000a0e8u
#define CYDEV_CAN0_RX2_DL 0x4000a0ecu
#define CYDEV_CAN0_RX2_AMR 0x4000a0f0u
#define CYDEV_CAN0_RX2_ACR 0x4000a0f4u
#define CYDEV_CAN0_RX2_AMRD 0x4000a0f8u
#define CYDEV_CAN0_RX2_ACRD 0x4000a0fcu
#define CYDEV_CAN0_RX3_BASE 0x4000a100u
#define CYDEV_CAN0_RX3_SIZE 0x00000020u
#define CYDEV_CAN0_RX3_CMD 0x4000a100u
#define CYDEV_CAN0_RX3_ID 0x4000a104u
#define CYDEV_CAN0_RX3_DH 0x4000a108u
#define CYDEV_CAN0_RX3_DL 0x4000a10cu
#define CYDEV_CAN0_RX3_AMR 0x4000a110u
#define CYDEV_CAN0_RX3_ACR 0x4000a114u
#define CYDEV_CAN0_RX3_AMRD 0x4000a118u
#define CYDEV_CAN0_RX3_ACRD 0x4000a11cu
#define CYDEV_CAN0_RX4_BASE 0x4000a120u
#define CYDEV_CAN0_RX4_SIZE 0x00000020u
#define CYDEV_CAN0_RX4_CMD 0x4000a120u
#define CYDEV_CAN0_RX4_ID 0x4000a124u
#define CYDEV_CAN0_RX4_DH 0x4000a128u
#define CYDEV_CAN0_RX4_DL 0x4000a12cu
#define CYDEV_CAN0_RX4_AMR 0x4000a130u
#define CYDEV_CAN0_RX4_ACR 0x4000a134u
#define CYDEV_CAN0_RX4_AMRD 0x4000a138u
#define CYDEV_CAN0_RX4_ACRD 0x4000a13cu
#define CYDEV_CAN0_RX5_BASE 0x4000a140u
#define CYDEV_CAN0_RX5_SIZE 0x00000020u
#define CYDEV_CAN0_RX5_CMD 0x4000a140u
#define CYDEV_CAN0_RX5_ID 0x4000a144u
#define CYDEV_CAN0_RX5_DH 0x4000a148u
#define CYDEV_CAN0_RX5_DL 0x4000a14cu
#define CYDEV_CAN0_RX5_AMR 0x4000a150u
#define CYDEV_CAN0_RX5_ACR 0x4000a154u
#define CYDEV_CAN0_RX5_AMRD 0x4000a158u
#define CYDEV_CAN0_RX5_ACRD 0x4000a15cu
#define CYDEV_CAN0_RX6_BASE 0x4000a160u
#define CYDEV_CAN0_RX6_SIZE 0x00000020u
#define CYDEV_CAN0_RX6_CMD 0x4000a160u
#define CYDEV_CAN0_RX6_ID 0x4000a164u
#define CYDEV_CAN0_RX6_DH 0x4000a168u
#define CYDEV_CAN0_RX6_DL 0x4000a16cu
#define CYDEV_CAN0_RX6_AMR 0x4000a170u
#define CYDEV_CAN0_RX6_ACR 0x4000a174u
#define CYDEV_CAN0_RX6_AMRD 0x4000a178u
#define CYDEV_CAN0_RX6_ACRD 0x4000a17cu
#define CYDEV_CAN0_RX7_BASE 0x4000a180u
#define CYDEV_CAN0_RX7_SIZE 0x00000020u
#define CYDEV_CAN0_RX7_CMD 0x4000a180u
#define CYDEV_CAN0_RX7_ID 0x4000a184u
#define CYDEV_CAN0_RX7_DH 0x4000a188u
#define CYDEV_CAN0_RX7_DL 0x4000a18cu
#define CYDEV_CAN0_RX7_AMR 0x4000a190u
#define CYDEV_CAN0_RX7_ACR 0x4000a194u
#define CYDEV_CAN0_RX7_AMRD 0x4000a198u
#define CYDEV_CAN0_RX7_ACRD 0x4000a19cu
#define CYDEV_CAN0_RX8_BASE 0x4000a1a0u
#define CYDEV_CAN0_RX8_SIZE 0x00000020u
#define CYDEV_CAN0_RX8_CMD 0x4000a1a0u
#define CYDEV_CAN0_RX8_ID 0x4000a1a4u
#define CYDEV_CAN0_RX8_DH 0x4000a1a8u
#define CYDEV_CAN0_RX8_DL 0x4000a1acu
#define CYDEV_CAN0_RX8_AMR 0x4000a1b0u
#define CYDEV_CAN0_RX8_ACR 0x4000a1b4u
#define CYDEV_CAN0_RX8_AMRD 0x4000a1b8u
#define CYDEV_CAN0_RX8_ACRD 0x4000a1bcu
#define CYDEV_CAN0_RX9_BASE 0x4000a1c0u
#define CYDEV_CAN0_RX9_SIZE 0x00000020u
#define CYDEV_CAN0_RX9_CMD 0x4000a1c0u
#define CYDEV_CAN0_RX9_ID 0x4000a1c4u
#define CYDEV_CAN0_RX9_DH 0x4000a1c8u
#define CYDEV_CAN0_RX9_DL 0x4000a1ccu
#define CYDEV_CAN0_RX9_AMR 0x4000a1d0u
#define CYDEV_CAN0_RX9_ACR 0x4000a1d4u
#define CYDEV_CAN0_RX9_AMRD 0x4000a1d8u
#define CYDEV_CAN0_RX9_ACRD 0x4000a1dcu
#define CYDEV_CAN0_RX10_BASE 0x4000a1e0u
#define CYDEV_CAN0_RX10_SIZE 0x00000020u
#define CYDEV_CAN0_RX10_CMD 0x4000a1e0u
#define CYDEV_CAN0_RX10_ID 0x4000a1e4u
#define CYDEV_CAN0_RX10_DH 0x4000a1e8u
#define CYDEV_CAN0_RX10_DL 0x4000a1ecu
#define CYDEV_CAN0_RX10_AMR 0x4000a1f0u
#define CYDEV_CAN0_RX10_ACR 0x4000a1f4u
#define CYDEV_CAN0_RX10_AMRD 0x4000a1f8u
#define CYDEV_CAN0_RX10_ACRD 0x4000a1fcu
#define CYDEV_CAN0_RX11_BASE 0x4000a200u
#define CYDEV_CAN0_RX11_SIZE 0x00000020u
#define CYDEV_CAN0_RX11_CMD 0x4000a200u
#define CYDEV_CAN0_RX11_ID 0x4000a204u
#define CYDEV_CAN0_RX11_DH 0x4000a208u
#define CYDEV_CAN0_RX11_DL 0x4000a20cu
#define CYDEV_CAN0_RX11_AMR 0x4000a210u
#define CYDEV_CAN0_RX11_ACR 0x4000a214u
#define CYDEV_CAN0_RX11_AMRD 0x4000a218u
#define CYDEV_CAN0_RX11_ACRD 0x4000a21cu
#define CYDEV_CAN0_RX12_BASE 0x4000a220u
#define CYDEV_CAN0_RX12_SIZE 0x00000020u
#define CYDEV_CAN0_RX12_CMD 0x4000a220u
#define CYDEV_CAN0_RX12_ID 0x4000a224u
#define CYDEV_CAN0_RX12_DH 0x4000a228u
#define CYDEV_CAN0_RX12_DL 0x4000a22cu
#define CYDEV_CAN0_RX12_AMR 0x4000a230u
#define CYDEV_CAN0_RX12_ACR 0x4000a234u
#define CYDEV_CAN0_RX12_AMRD 0x4000a238u
#define CYDEV_CAN0_RX12_ACRD 0x4000a23cu
#define CYDEV_CAN0_RX13_BASE 0x4000a240u
#define CYDEV_CAN0_RX13_SIZE 0x00000020u
#define CYDEV_CAN0_RX13_CMD 0x4000a240u
#define CYDEV_CAN0_RX13_ID 0x4000a244u
#define CYDEV_CAN0_RX13_DH 0x4000a248u
#define CYDEV_CAN0_RX13_DL 0x4000a24cu
#define CYDEV_CAN0_RX13_AMR 0x4000a250u
#define CYDEV_CAN0_RX13_ACR 0x4000a254u
#define CYDEV_CAN0_RX13_AMRD 0x4000a258u
#define CYDEV_CAN0_RX13_ACRD 0x4000a25cu
#define CYDEV_CAN0_RX14_BASE 0x4000a260u
#define CYDEV_CAN0_RX14_SIZE 0x00000020u
#define CYDEV_CAN0_RX14_CMD 0x4000a260u
#define CYDEV_CAN0_RX14_ID 0x4000a264u
#define CYDEV_CAN0_RX14_DH 0x4000a268u
#define CYDEV_CAN0_RX14_DL 0x4000a26cu
#define CYDEV_CAN0_RX14_AMR 0x4000a270u
#define CYDEV_CAN0_RX14_ACR 0x4000a274u
#define CYDEV_CAN0_RX14_AMRD 0x4000a278u
#define CYDEV_CAN0_RX14_ACRD 0x4000a27cu
#define CYDEV_CAN0_RX15_BASE 0x4000a280u
#define CYDEV_CAN0_RX15_SIZE 0x00000020u
#define CYDEV_CAN0_RX15_CMD 0x4000a280u
#define CYDEV_CAN0_RX15_ID 0x4000a284u
#define CYDEV_CAN0_RX15_DH 0x4000a288u
#define CYDEV_CAN0_RX15_DL 0x4000a28cu
#define CYDEV_CAN0_RX15_AMR 0x4000a290u
#define CYDEV_CAN0_RX15_ACR 0x4000a294u
#define CYDEV_CAN0_RX15_AMRD 0x4000a298u
#define CYDEV_CAN0_RX15_ACRD 0x4000a29cu
#define CYDEV_DFB0_BASE 0x4000c000u
#define CYDEV_DFB0_SIZE 0x000007b5u
#define CYDEV_DFB0_DPA_SRAM_BASE 0x4000c000u
#define CYDEV_DFB0_DPA_SRAM_SIZE 0x00000200u
#define CYDEV_DFB0_DPA_SRAM_DATA_MBASE 0x4000c000u
#define CYDEV_DFB0_DPA_SRAM_DATA_MSIZE 0x00000200u
#define CYDEV_DFB0_DPB_SRAM_BASE 0x4000c200u
#define CYDEV_DFB0_DPB_SRAM_SIZE 0x00000200u
#define CYDEV_DFB0_DPB_SRAM_DATA_MBASE 0x4000c200u
#define CYDEV_DFB0_DPB_SRAM_DATA_MSIZE 0x00000200u
#define CYDEV_DFB0_CSA_SRAM_BASE 0x4000c400u
#define CYDEV_DFB0_CSA_SRAM_SIZE 0x00000100u
#define CYDEV_DFB0_CSA_SRAM_DATA_MBASE 0x4000c400u
#define CYDEV_DFB0_CSA_SRAM_DATA_MSIZE 0x00000100u
#define CYDEV_DFB0_CSB_SRAM_BASE 0x4000c500u
#define CYDEV_DFB0_CSB_SRAM_SIZE 0x00000100u
#define CYDEV_DFB0_CSB_SRAM_DATA_MBASE 0x4000c500u
#define CYDEV_DFB0_CSB_SRAM_DATA_MSIZE 0x00000100u
#define CYDEV_DFB0_FSM_SRAM_BASE 0x4000c600u
#define CYDEV_DFB0_FSM_SRAM_SIZE 0x00000100u
#define CYDEV_DFB0_FSM_SRAM_DATA_MBASE 0x4000c600u
#define CYDEV_DFB0_FSM_SRAM_DATA_MSIZE 0x00000100u
#define CYDEV_DFB0_ACU_SRAM_BASE 0x4000c700u
#define CYDEV_DFB0_ACU_SRAM_SIZE 0x00000040u
#define CYDEV_DFB0_ACU_SRAM_DATA_MBASE 0x4000c700u
#define CYDEV_DFB0_ACU_SRAM_DATA_MSIZE 0x00000040u
#define CYDEV_DFB0_CR 0x4000c780u
#define CYDEV_DFB0_SR 0x4000c784u
#define CYDEV_DFB0_RAM_EN 0x4000c788u
#define CYDEV_DFB0_RAM_DIR 0x4000c78cu
#define CYDEV_DFB0_SEMA 0x4000c790u
#define CYDEV_DFB0_DSI_CTRL 0x4000c794u
#define CYDEV_DFB0_INT_CTRL 0x4000c798u
#define CYDEV_DFB0_DMA_CTRL 0x4000c79cu
#define CYDEV_DFB0_STAGEA 0x4000c7a0u
#define CYDEV_DFB0_STAGEAM 0x4000c7a1u
#define CYDEV_DFB0_STAGEAH 0x4000c7a2u
#define CYDEV_DFB0_STAGEB 0x4000c7a4u
#define CYDEV_DFB0_STAGEBM 0x4000c7a5u
#define CYDEV_DFB0_STAGEBH 0x4000c7a6u
#define CYDEV_DFB0_HOLDA 0x4000c7a8u
#define CYDEV_DFB0_HOLDAM 0x4000c7a9u
#define CYDEV_DFB0_HOLDAH 0x4000c7aau
#define CYDEV_DFB0_HOLDAS 0x4000c7abu
#define CYDEV_DFB0_HOLDB 0x4000c7acu
#define CYDEV_DFB0_HOLDBM 0x4000c7adu
#define CYDEV_DFB0_HOLDBH 0x4000c7aeu
#define CYDEV_DFB0_HOLDBS 0x4000c7afu
#define CYDEV_DFB0_COHER 0x4000c7b0u
#define CYDEV_DFB0_DALIGN 0x4000c7b4u
#define CYDEV_UCFG_BASE 0x40010000u
#define CYDEV_UCFG_SIZE 0x00005040u
#define CYDEV_UCFG_B0_BASE 0x40010000u
#define CYDEV_UCFG_B0_SIZE 0x00000fefu
#define CYDEV_UCFG_B0_P0_BASE 0x40010000u
#define CYDEV_UCFG_B0_P0_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P0_U0_BASE 0x40010000u
#define CYDEV_UCFG_B0_P0_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT0 0x40010000u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT1 0x40010004u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT2 0x40010008u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT3 0x4001000cu
#define CYDEV_UCFG_B0_P0_U0_PLD_IT4 0x40010010u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT5 0x40010014u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT6 0x40010018u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT7 0x4001001cu
#define CYDEV_UCFG_B0_P0_U0_PLD_IT8 0x40010020u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT9 0x40010024u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT10 0x40010028u
#define CYDEV_UCFG_B0_P0_U0_PLD_IT11 0x4001002cu
#define CYDEV_UCFG_B0_P0_U0_PLD_ORT0 0x40010030u
#define CYDEV_UCFG_B0_P0_U0_PLD_ORT1 0x40010032u
#define CYDEV_UCFG_B0_P0_U0_PLD_ORT2 0x40010034u
#define CYDEV_UCFG_B0_P0_U0_PLD_ORT3 0x40010036u
#define CYDEV_UCFG_B0_P0_U0_MC_CFG_CEN_CONST 0x40010038u
#define CYDEV_UCFG_B0_P0_U0_MC_CFG_XORFB 0x4001003au
#define CYDEV_UCFG_B0_P0_U0_MC_CFG_SET_RESET 0x4001003cu
#define CYDEV_UCFG_B0_P0_U0_MC_CFG_BYPASS 0x4001003eu
#define CYDEV_UCFG_B0_P0_U0_CFG0 0x40010040u
#define CYDEV_UCFG_B0_P0_U0_CFG1 0x40010041u
#define CYDEV_UCFG_B0_P0_U0_CFG2 0x40010042u
#define CYDEV_UCFG_B0_P0_U0_CFG3 0x40010043u
#define CYDEV_UCFG_B0_P0_U0_CFG4 0x40010044u
#define CYDEV_UCFG_B0_P0_U0_CFG5 0x40010045u
#define CYDEV_UCFG_B0_P0_U0_CFG6 0x40010046u
#define CYDEV_UCFG_B0_P0_U0_CFG7 0x40010047u
#define CYDEV_UCFG_B0_P0_U0_CFG8 0x40010048u
#define CYDEV_UCFG_B0_P0_U0_CFG9 0x40010049u
#define CYDEV_UCFG_B0_P0_U0_CFG10 0x4001004au
#define CYDEV_UCFG_B0_P0_U0_CFG11 0x4001004bu
#define CYDEV_UCFG_B0_P0_U0_CFG12 0x4001004cu
#define CYDEV_UCFG_B0_P0_U0_CFG13 0x4001004du
#define CYDEV_UCFG_B0_P0_U0_CFG14 0x4001004eu
#define CYDEV_UCFG_B0_P0_U0_CFG15 0x4001004fu
#define CYDEV_UCFG_B0_P0_U0_CFG16 0x40010050u
#define CYDEV_UCFG_B0_P0_U0_CFG20 0x40010054u
#define CYDEV_UCFG_B0_P0_U0_CFG21 0x40010055u
#define CYDEV_UCFG_B0_P0_U0_CFG22 0x40010056u
#define CYDEV_UCFG_B0_P0_U0_CFG23 0x40010057u
#define CYDEV_UCFG_B0_P0_U0_CFG24 0x40010058u
#define CYDEV_UCFG_B0_P0_U0_CFG25 0x40010059u
#define CYDEV_UCFG_B0_P0_U0_CFG26 0x4001005au
#define CYDEV_UCFG_B0_P0_U0_CFG27 0x4001005bu
#define CYDEV_UCFG_B0_P0_U0_CFG28 0x4001005cu
#define CYDEV_UCFG_B0_P0_U0_CFG29 0x4001005du
#define CYDEV_UCFG_B0_P0_U0_CFG30 0x4001005eu
#define CYDEV_UCFG_B0_P0_U0_CFG31 0x4001005fu
#define CYDEV_UCFG_B0_P0_U0_DCFG0 0x40010060u
#define CYDEV_UCFG_B0_P0_U0_DCFG1 0x40010062u
#define CYDEV_UCFG_B0_P0_U0_DCFG2 0x40010064u
#define CYDEV_UCFG_B0_P0_U0_DCFG3 0x40010066u
#define CYDEV_UCFG_B0_P0_U0_DCFG4 0x40010068u
#define CYDEV_UCFG_B0_P0_U0_DCFG5 0x4001006au
#define CYDEV_UCFG_B0_P0_U0_DCFG6 0x4001006cu
#define CYDEV_UCFG_B0_P0_U0_DCFG7 0x4001006eu
#define CYDEV_UCFG_B0_P0_U1_BASE 0x40010080u
#define CYDEV_UCFG_B0_P0_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT0 0x40010080u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT1 0x40010084u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT2 0x40010088u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT3 0x4001008cu
#define CYDEV_UCFG_B0_P0_U1_PLD_IT4 0x40010090u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT5 0x40010094u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT6 0x40010098u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT7 0x4001009cu
#define CYDEV_UCFG_B0_P0_U1_PLD_IT8 0x400100a0u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT9 0x400100a4u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT10 0x400100a8u
#define CYDEV_UCFG_B0_P0_U1_PLD_IT11 0x400100acu
#define CYDEV_UCFG_B0_P0_U1_PLD_ORT0 0x400100b0u
#define CYDEV_UCFG_B0_P0_U1_PLD_ORT1 0x400100b2u
#define CYDEV_UCFG_B0_P0_U1_PLD_ORT2 0x400100b4u
#define CYDEV_UCFG_B0_P0_U1_PLD_ORT3 0x400100b6u
#define CYDEV_UCFG_B0_P0_U1_MC_CFG_CEN_CONST 0x400100b8u
#define CYDEV_UCFG_B0_P0_U1_MC_CFG_XORFB 0x400100bau
#define CYDEV_UCFG_B0_P0_U1_MC_CFG_SET_RESET 0x400100bcu
#define CYDEV_UCFG_B0_P0_U1_MC_CFG_BYPASS 0x400100beu
#define CYDEV_UCFG_B0_P0_U1_CFG0 0x400100c0u
#define CYDEV_UCFG_B0_P0_U1_CFG1 0x400100c1u
#define CYDEV_UCFG_B0_P0_U1_CFG2 0x400100c2u
#define CYDEV_UCFG_B0_P0_U1_CFG3 0x400100c3u
#define CYDEV_UCFG_B0_P0_U1_CFG4 0x400100c4u
#define CYDEV_UCFG_B0_P0_U1_CFG5 0x400100c5u
#define CYDEV_UCFG_B0_P0_U1_CFG6 0x400100c6u
#define CYDEV_UCFG_B0_P0_U1_CFG7 0x400100c7u
#define CYDEV_UCFG_B0_P0_U1_CFG8 0x400100c8u
#define CYDEV_UCFG_B0_P0_U1_CFG9 0x400100c9u
#define CYDEV_UCFG_B0_P0_U1_CFG10 0x400100cau
#define CYDEV_UCFG_B0_P0_U1_CFG11 0x400100cbu
#define CYDEV_UCFG_B0_P0_U1_CFG12 0x400100ccu
#define CYDEV_UCFG_B0_P0_U1_CFG13 0x400100cdu
#define CYDEV_UCFG_B0_P0_U1_CFG14 0x400100ceu
#define CYDEV_UCFG_B0_P0_U1_CFG15 0x400100cfu
#define CYDEV_UCFG_B0_P0_U1_CFG16 0x400100d0u
#define CYDEV_UCFG_B0_P0_U1_CFG20 0x400100d4u
#define CYDEV_UCFG_B0_P0_U1_CFG21 0x400100d5u
#define CYDEV_UCFG_B0_P0_U1_CFG22 0x400100d6u
#define CYDEV_UCFG_B0_P0_U1_CFG23 0x400100d7u
#define CYDEV_UCFG_B0_P0_U1_CFG24 0x400100d8u
#define CYDEV_UCFG_B0_P0_U1_CFG25 0x400100d9u
#define CYDEV_UCFG_B0_P0_U1_CFG26 0x400100dau
#define CYDEV_UCFG_B0_P0_U1_CFG27 0x400100dbu
#define CYDEV_UCFG_B0_P0_U1_CFG28 0x400100dcu
#define CYDEV_UCFG_B0_P0_U1_CFG29 0x400100ddu
#define CYDEV_UCFG_B0_P0_U1_CFG30 0x400100deu
#define CYDEV_UCFG_B0_P0_U1_CFG31 0x400100dfu
#define CYDEV_UCFG_B0_P0_U1_DCFG0 0x400100e0u
#define CYDEV_UCFG_B0_P0_U1_DCFG1 0x400100e2u
#define CYDEV_UCFG_B0_P0_U1_DCFG2 0x400100e4u
#define CYDEV_UCFG_B0_P0_U1_DCFG3 0x400100e6u
#define CYDEV_UCFG_B0_P0_U1_DCFG4 0x400100e8u
#define CYDEV_UCFG_B0_P0_U1_DCFG5 0x400100eau
#define CYDEV_UCFG_B0_P0_U1_DCFG6 0x400100ecu
#define CYDEV_UCFG_B0_P0_U1_DCFG7 0x400100eeu
#define CYDEV_UCFG_B0_P0_ROUTE_BASE 0x40010100u
#define CYDEV_UCFG_B0_P0_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P1_BASE 0x40010200u
#define CYDEV_UCFG_B0_P1_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P1_U0_BASE 0x40010200u
#define CYDEV_UCFG_B0_P1_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT0 0x40010200u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT1 0x40010204u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT2 0x40010208u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT3 0x4001020cu
#define CYDEV_UCFG_B0_P1_U0_PLD_IT4 0x40010210u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT5 0x40010214u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT6 0x40010218u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT7 0x4001021cu
#define CYDEV_UCFG_B0_P1_U0_PLD_IT8 0x40010220u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT9 0x40010224u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT10 0x40010228u
#define CYDEV_UCFG_B0_P1_U0_PLD_IT11 0x4001022cu
#define CYDEV_UCFG_B0_P1_U0_PLD_ORT0 0x40010230u
#define CYDEV_UCFG_B0_P1_U0_PLD_ORT1 0x40010232u
#define CYDEV_UCFG_B0_P1_U0_PLD_ORT2 0x40010234u
#define CYDEV_UCFG_B0_P1_U0_PLD_ORT3 0x40010236u
#define CYDEV_UCFG_B0_P1_U0_MC_CFG_CEN_CONST 0x40010238u
#define CYDEV_UCFG_B0_P1_U0_MC_CFG_XORFB 0x4001023au
#define CYDEV_UCFG_B0_P1_U0_MC_CFG_SET_RESET 0x4001023cu
#define CYDEV_UCFG_B0_P1_U0_MC_CFG_BYPASS 0x4001023eu
#define CYDEV_UCFG_B0_P1_U0_CFG0 0x40010240u
#define CYDEV_UCFG_B0_P1_U0_CFG1 0x40010241u
#define CYDEV_UCFG_B0_P1_U0_CFG2 0x40010242u
#define CYDEV_UCFG_B0_P1_U0_CFG3 0x40010243u
#define CYDEV_UCFG_B0_P1_U0_CFG4 0x40010244u
#define CYDEV_UCFG_B0_P1_U0_CFG5 0x40010245u
#define CYDEV_UCFG_B0_P1_U0_CFG6 0x40010246u
#define CYDEV_UCFG_B0_P1_U0_CFG7 0x40010247u
#define CYDEV_UCFG_B0_P1_U0_CFG8 0x40010248u
#define CYDEV_UCFG_B0_P1_U0_CFG9 0x40010249u
#define CYDEV_UCFG_B0_P1_U0_CFG10 0x4001024au
#define CYDEV_UCFG_B0_P1_U0_CFG11 0x4001024bu
#define CYDEV_UCFG_B0_P1_U0_CFG12 0x4001024cu
#define CYDEV_UCFG_B0_P1_U0_CFG13 0x4001024du
#define CYDEV_UCFG_B0_P1_U0_CFG14 0x4001024eu
#define CYDEV_UCFG_B0_P1_U0_CFG15 0x4001024fu
#define CYDEV_UCFG_B0_P1_U0_CFG16 0x40010250u
#define CYDEV_UCFG_B0_P1_U0_CFG20 0x40010254u
#define CYDEV_UCFG_B0_P1_U0_CFG21 0x40010255u
#define CYDEV_UCFG_B0_P1_U0_CFG22 0x40010256u
#define CYDEV_UCFG_B0_P1_U0_CFG23 0x40010257u
#define CYDEV_UCFG_B0_P1_U0_CFG24 0x40010258u
#define CYDEV_UCFG_B0_P1_U0_CFG25 0x40010259u
#define CYDEV_UCFG_B0_P1_U0_CFG26 0x4001025au
#define CYDEV_UCFG_B0_P1_U0_CFG27 0x4001025bu
#define CYDEV_UCFG_B0_P1_U0_CFG28 0x4001025cu
#define CYDEV_UCFG_B0_P1_U0_CFG29 0x4001025du
#define CYDEV_UCFG_B0_P1_U0_CFG30 0x4001025eu
#define CYDEV_UCFG_B0_P1_U0_CFG31 0x4001025fu
#define CYDEV_UCFG_B0_P1_U0_DCFG0 0x40010260u
#define CYDEV_UCFG_B0_P1_U0_DCFG1 0x40010262u
#define CYDEV_UCFG_B0_P1_U0_DCFG2 0x40010264u
#define CYDEV_UCFG_B0_P1_U0_DCFG3 0x40010266u
#define CYDEV_UCFG_B0_P1_U0_DCFG4 0x40010268u
#define CYDEV_UCFG_B0_P1_U0_DCFG5 0x4001026au
#define CYDEV_UCFG_B0_P1_U0_DCFG6 0x4001026cu
#define CYDEV_UCFG_B0_P1_U0_DCFG7 0x4001026eu
#define CYDEV_UCFG_B0_P1_U1_BASE 0x40010280u
#define CYDEV_UCFG_B0_P1_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT0 0x40010280u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT1 0x40010284u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT2 0x40010288u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT3 0x4001028cu
#define CYDEV_UCFG_B0_P1_U1_PLD_IT4 0x40010290u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT5 0x40010294u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT6 0x40010298u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT7 0x4001029cu
#define CYDEV_UCFG_B0_P1_U1_PLD_IT8 0x400102a0u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT9 0x400102a4u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT10 0x400102a8u
#define CYDEV_UCFG_B0_P1_U1_PLD_IT11 0x400102acu
#define CYDEV_UCFG_B0_P1_U1_PLD_ORT0 0x400102b0u
#define CYDEV_UCFG_B0_P1_U1_PLD_ORT1 0x400102b2u
#define CYDEV_UCFG_B0_P1_U1_PLD_ORT2 0x400102b4u
#define CYDEV_UCFG_B0_P1_U1_PLD_ORT3 0x400102b6u
#define CYDEV_UCFG_B0_P1_U1_MC_CFG_CEN_CONST 0x400102b8u
#define CYDEV_UCFG_B0_P1_U1_MC_CFG_XORFB 0x400102bau
#define CYDEV_UCFG_B0_P1_U1_MC_CFG_SET_RESET 0x400102bcu
#define CYDEV_UCFG_B0_P1_U1_MC_CFG_BYPASS 0x400102beu
#define CYDEV_UCFG_B0_P1_U1_CFG0 0x400102c0u
#define CYDEV_UCFG_B0_P1_U1_CFG1 0x400102c1u
#define CYDEV_UCFG_B0_P1_U1_CFG2 0x400102c2u
#define CYDEV_UCFG_B0_P1_U1_CFG3 0x400102c3u
#define CYDEV_UCFG_B0_P1_U1_CFG4 0x400102c4u
#define CYDEV_UCFG_B0_P1_U1_CFG5 0x400102c5u
#define CYDEV_UCFG_B0_P1_U1_CFG6 0x400102c6u
#define CYDEV_UCFG_B0_P1_U1_CFG7 0x400102c7u
#define CYDEV_UCFG_B0_P1_U1_CFG8 0x400102c8u
#define CYDEV_UCFG_B0_P1_U1_CFG9 0x400102c9u
#define CYDEV_UCFG_B0_P1_U1_CFG10 0x400102cau
#define CYDEV_UCFG_B0_P1_U1_CFG11 0x400102cbu
#define CYDEV_UCFG_B0_P1_U1_CFG12 0x400102ccu
#define CYDEV_UCFG_B0_P1_U1_CFG13 0x400102cdu
#define CYDEV_UCFG_B0_P1_U1_CFG14 0x400102ceu
#define CYDEV_UCFG_B0_P1_U1_CFG15 0x400102cfu
#define CYDEV_UCFG_B0_P1_U1_CFG16 0x400102d0u
#define CYDEV_UCFG_B0_P1_U1_CFG20 0x400102d4u
#define CYDEV_UCFG_B0_P1_U1_CFG21 0x400102d5u
#define CYDEV_UCFG_B0_P1_U1_CFG22 0x400102d6u
#define CYDEV_UCFG_B0_P1_U1_CFG23 0x400102d7u
#define CYDEV_UCFG_B0_P1_U1_CFG24 0x400102d8u
#define CYDEV_UCFG_B0_P1_U1_CFG25 0x400102d9u
#define CYDEV_UCFG_B0_P1_U1_CFG26 0x400102dau
#define CYDEV_UCFG_B0_P1_U1_CFG27 0x400102dbu
#define CYDEV_UCFG_B0_P1_U1_CFG28 0x400102dcu
#define CYDEV_UCFG_B0_P1_U1_CFG29 0x400102ddu
#define CYDEV_UCFG_B0_P1_U1_CFG30 0x400102deu
#define CYDEV_UCFG_B0_P1_U1_CFG31 0x400102dfu
#define CYDEV_UCFG_B0_P1_U1_DCFG0 0x400102e0u
#define CYDEV_UCFG_B0_P1_U1_DCFG1 0x400102e2u
#define CYDEV_UCFG_B0_P1_U1_DCFG2 0x400102e4u
#define CYDEV_UCFG_B0_P1_U1_DCFG3 0x400102e6u
#define CYDEV_UCFG_B0_P1_U1_DCFG4 0x400102e8u
#define CYDEV_UCFG_B0_P1_U1_DCFG5 0x400102eau
#define CYDEV_UCFG_B0_P1_U1_DCFG6 0x400102ecu
#define CYDEV_UCFG_B0_P1_U1_DCFG7 0x400102eeu
#define CYDEV_UCFG_B0_P1_ROUTE_BASE 0x40010300u
#define CYDEV_UCFG_B0_P1_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P2_BASE 0x40010400u
#define CYDEV_UCFG_B0_P2_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P2_U0_BASE 0x40010400u
#define CYDEV_UCFG_B0_P2_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT0 0x40010400u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT1 0x40010404u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT2 0x40010408u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT3 0x4001040cu
#define CYDEV_UCFG_B0_P2_U0_PLD_IT4 0x40010410u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT5 0x40010414u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT6 0x40010418u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT7 0x4001041cu
#define CYDEV_UCFG_B0_P2_U0_PLD_IT8 0x40010420u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT9 0x40010424u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT10 0x40010428u
#define CYDEV_UCFG_B0_P2_U0_PLD_IT11 0x4001042cu
#define CYDEV_UCFG_B0_P2_U0_PLD_ORT0 0x40010430u
#define CYDEV_UCFG_B0_P2_U0_PLD_ORT1 0x40010432u
#define CYDEV_UCFG_B0_P2_U0_PLD_ORT2 0x40010434u
#define CYDEV_UCFG_B0_P2_U0_PLD_ORT3 0x40010436u
#define CYDEV_UCFG_B0_P2_U0_MC_CFG_CEN_CONST 0x40010438u
#define CYDEV_UCFG_B0_P2_U0_MC_CFG_XORFB 0x4001043au
#define CYDEV_UCFG_B0_P2_U0_MC_CFG_SET_RESET 0x4001043cu
#define CYDEV_UCFG_B0_P2_U0_MC_CFG_BYPASS 0x4001043eu
#define CYDEV_UCFG_B0_P2_U0_CFG0 0x40010440u
#define CYDEV_UCFG_B0_P2_U0_CFG1 0x40010441u
#define CYDEV_UCFG_B0_P2_U0_CFG2 0x40010442u
#define CYDEV_UCFG_B0_P2_U0_CFG3 0x40010443u
#define CYDEV_UCFG_B0_P2_U0_CFG4 0x40010444u
#define CYDEV_UCFG_B0_P2_U0_CFG5 0x40010445u
#define CYDEV_UCFG_B0_P2_U0_CFG6 0x40010446u
#define CYDEV_UCFG_B0_P2_U0_CFG7 0x40010447u
#define CYDEV_UCFG_B0_P2_U0_CFG8 0x40010448u
#define CYDEV_UCFG_B0_P2_U0_CFG9 0x40010449u
#define CYDEV_UCFG_B0_P2_U0_CFG10 0x4001044au
#define CYDEV_UCFG_B0_P2_U0_CFG11 0x4001044bu
#define CYDEV_UCFG_B0_P2_U0_CFG12 0x4001044cu
#define CYDEV_UCFG_B0_P2_U0_CFG13 0x4001044du
#define CYDEV_UCFG_B0_P2_U0_CFG14 0x4001044eu
#define CYDEV_UCFG_B0_P2_U0_CFG15 0x4001044fu
#define CYDEV_UCFG_B0_P2_U0_CFG16 0x40010450u
#define CYDEV_UCFG_B0_P2_U0_CFG20 0x40010454u
#define CYDEV_UCFG_B0_P2_U0_CFG21 0x40010455u
#define CYDEV_UCFG_B0_P2_U0_CFG22 0x40010456u
#define CYDEV_UCFG_B0_P2_U0_CFG23 0x40010457u
#define CYDEV_UCFG_B0_P2_U0_CFG24 0x40010458u
#define CYDEV_UCFG_B0_P2_U0_CFG25 0x40010459u
#define CYDEV_UCFG_B0_P2_U0_CFG26 0x4001045au
#define CYDEV_UCFG_B0_P2_U0_CFG27 0x4001045bu
#define CYDEV_UCFG_B0_P2_U0_CFG28 0x4001045cu
#define CYDEV_UCFG_B0_P2_U0_CFG29 0x4001045du
#define CYDEV_UCFG_B0_P2_U0_CFG30 0x4001045eu
#define CYDEV_UCFG_B0_P2_U0_CFG31 0x4001045fu
#define CYDEV_UCFG_B0_P2_U0_DCFG0 0x40010460u
#define CYDEV_UCFG_B0_P2_U0_DCFG1 0x40010462u
#define CYDEV_UCFG_B0_P2_U0_DCFG2 0x40010464u
#define CYDEV_UCFG_B0_P2_U0_DCFG3 0x40010466u
