MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
#define CYDEV_UCFG_B0_P2_U0_DCFG4 0x40010468u
#define CYDEV_UCFG_B0_P2_U0_DCFG5 0x4001046au
#define CYDEV_UCFG_B0_P2_U0_DCFG6 0x4001046cu
#define CYDEV_UCFG_B0_P2_U0_DCFG7 0x4001046eu
#define CYDEV_UCFG_B0_P2_U1_BASE 0x40010480u
#define CYDEV_UCFG_B0_P2_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT0 0x40010480u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT1 0x40010484u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT2 0x40010488u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT3 0x4001048cu
#define CYDEV_UCFG_B0_P2_U1_PLD_IT4 0x40010490u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT5 0x40010494u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT6 0x40010498u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT7 0x4001049cu
#define CYDEV_UCFG_B0_P2_U1_PLD_IT8 0x400104a0u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT9 0x400104a4u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT10 0x400104a8u
#define CYDEV_UCFG_B0_P2_U1_PLD_IT11 0x400104acu
#define CYDEV_UCFG_B0_P2_U1_PLD_ORT0 0x400104b0u
#define CYDEV_UCFG_B0_P2_U1_PLD_ORT1 0x400104b2u
#define CYDEV_UCFG_B0_P2_U1_PLD_ORT2 0x400104b4u
#define CYDEV_UCFG_B0_P2_U1_PLD_ORT3 0x400104b6u
#define CYDEV_UCFG_B0_P2_U1_MC_CFG_CEN_CONST 0x400104b8u
#define CYDEV_UCFG_B0_P2_U1_MC_CFG_XORFB 0x400104bau
#define CYDEV_UCFG_B0_P2_U1_MC_CFG_SET_RESET 0x400104bcu
#define CYDEV_UCFG_B0_P2_U1_MC_CFG_BYPASS 0x400104beu
#define CYDEV_UCFG_B0_P2_U1_CFG0 0x400104c0u
#define CYDEV_UCFG_B0_P2_U1_CFG1 0x400104c1u
#define CYDEV_UCFG_B0_P2_U1_CFG2 0x400104c2u
#define CYDEV_UCFG_B0_P2_U1_CFG3 0x400104c3u
#define CYDEV_UCFG_B0_P2_U1_CFG4 0x400104c4u
#define CYDEV_UCFG_B0_P2_U1_CFG5 0x400104c5u
#define CYDEV_UCFG_B0_P2_U1_CFG6 0x400104c6u
#define CYDEV_UCFG_B0_P2_U1_CFG7 0x400104c7u
#define CYDEV_UCFG_B0_P2_U1_CFG8 0x400104c8u
#define CYDEV_UCFG_B0_P2_U1_CFG9 0x400104c9u
#define CYDEV_UCFG_B0_P2_U1_CFG10 0x400104cau
#define CYDEV_UCFG_B0_P2_U1_CFG11 0x400104cbu
#define CYDEV_UCFG_B0_P2_U1_CFG12 0x400104ccu
#define CYDEV_UCFG_B0_P2_U1_CFG13 0x400104cdu
#define CYDEV_UCFG_B0_P2_U1_CFG14 0x400104ceu
#define CYDEV_UCFG_B0_P2_U1_CFG15 0x400104cfu
#define CYDEV_UCFG_B0_P2_U1_CFG16 0x400104d0u
#define CYDEV_UCFG_B0_P2_U1_CFG20 0x400104d4u
#define CYDEV_UCFG_B0_P2_U1_CFG21 0x400104d5u
#define CYDEV_UCFG_B0_P2_U1_CFG22 0x400104d6u
#define CYDEV_UCFG_B0_P2_U1_CFG23 0x400104d7u
#define CYDEV_UCFG_B0_P2_U1_CFG24 0x400104d8u
#define CYDEV_UCFG_B0_P2_U1_CFG25 0x400104d9u
#define CYDEV_UCFG_B0_P2_U1_CFG26 0x400104dau
#define CYDEV_UCFG_B0_P2_U1_CFG27 0x400104dbu
#define CYDEV_UCFG_B0_P2_U1_CFG28 0x400104dcu
#define CYDEV_UCFG_B0_P2_U1_CFG29 0x400104ddu
#define CYDEV_UCFG_B0_P2_U1_CFG30 0x400104deu
#define CYDEV_UCFG_B0_P2_U1_CFG31 0x400104dfu
#define CYDEV_UCFG_B0_P2_U1_DCFG0 0x400104e0u
#define CYDEV_UCFG_B0_P2_U1_DCFG1 0x400104e2u
#define CYDEV_UCFG_B0_P2_U1_DCFG2 0x400104e4u
#define CYDEV_UCFG_B0_P2_U1_DCFG3 0x400104e6u
#define CYDEV_UCFG_B0_P2_U1_DCFG4 0x400104e8u
#define CYDEV_UCFG_B0_P2_U1_DCFG5 0x400104eau
#define CYDEV_UCFG_B0_P2_U1_DCFG6 0x400104ecu
#define CYDEV_UCFG_B0_P2_U1_DCFG7 0x400104eeu
#define CYDEV_UCFG_B0_P2_ROUTE_BASE 0x40010500u
#define CYDEV_UCFG_B0_P2_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P3_BASE 0x40010600u
#define CYDEV_UCFG_B0_P3_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P3_U0_BASE 0x40010600u
#define CYDEV_UCFG_B0_P3_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT0 0x40010600u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT1 0x40010604u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT2 0x40010608u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT3 0x4001060cu
#define CYDEV_UCFG_B0_P3_U0_PLD_IT4 0x40010610u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT5 0x40010614u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT6 0x40010618u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT7 0x4001061cu
#define CYDEV_UCFG_B0_P3_U0_PLD_IT8 0x40010620u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT9 0x40010624u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT10 0x40010628u
#define CYDEV_UCFG_B0_P3_U0_PLD_IT11 0x4001062cu
#define CYDEV_UCFG_B0_P3_U0_PLD_ORT0 0x40010630u
#define CYDEV_UCFG_B0_P3_U0_PLD_ORT1 0x40010632u
#define CYDEV_UCFG_B0_P3_U0_PLD_ORT2 0x40010634u
#define CYDEV_UCFG_B0_P3_U0_PLD_ORT3 0x40010636u
#define CYDEV_UCFG_B0_P3_U0_MC_CFG_CEN_CONST 0x40010638u
#define CYDEV_UCFG_B0_P3_U0_MC_CFG_XORFB 0x4001063au
#define CYDEV_UCFG_B0_P3_U0_MC_CFG_SET_RESET 0x4001063cu
#define CYDEV_UCFG_B0_P3_U0_MC_CFG_BYPASS 0x4001063eu
#define CYDEV_UCFG_B0_P3_U0_CFG0 0x40010640u
#define CYDEV_UCFG_B0_P3_U0_CFG1 0x40010641u
#define CYDEV_UCFG_B0_P3_U0_CFG2 0x40010642u
#define CYDEV_UCFG_B0_P3_U0_CFG3 0x40010643u
#define CYDEV_UCFG_B0_P3_U0_CFG4 0x40010644u
#define CYDEV_UCFG_B0_P3_U0_CFG5 0x40010645u
#define CYDEV_UCFG_B0_P3_U0_CFG6 0x40010646u
#define CYDEV_UCFG_B0_P3_U0_CFG7 0x40010647u
#define CYDEV_UCFG_B0_P3_U0_CFG8 0x40010648u
#define CYDEV_UCFG_B0_P3_U0_CFG9 0x40010649u
#define CYDEV_UCFG_B0_P3_U0_CFG10 0x4001064au
#define CYDEV_UCFG_B0_P3_U0_CFG11 0x4001064bu
#define CYDEV_UCFG_B0_P3_U0_CFG12 0x4001064cu
#define CYDEV_UCFG_B0_P3_U0_CFG13 0x4001064du
#define CYDEV_UCFG_B0_P3_U0_CFG14 0x4001064eu
#define CYDEV_UCFG_B0_P3_U0_CFG15 0x4001064fu
#define CYDEV_UCFG_B0_P3_U0_CFG16 0x40010650u
#define CYDEV_UCFG_B0_P3_U0_CFG20 0x40010654u
#define CYDEV_UCFG_B0_P3_U0_CFG21 0x40010655u
#define CYDEV_UCFG_B0_P3_U0_CFG22 0x40010656u
#define CYDEV_UCFG_B0_P3_U0_CFG23 0x40010657u
#define CYDEV_UCFG_B0_P3_U0_CFG24 0x40010658u
#define CYDEV_UCFG_B0_P3_U0_CFG25 0x40010659u
#define CYDEV_UCFG_B0_P3_U0_CFG26 0x4001065au
#define CYDEV_UCFG_B0_P3_U0_CFG27 0x4001065bu
#define CYDEV_UCFG_B0_P3_U0_CFG28 0x4001065cu
#define CYDEV_UCFG_B0_P3_U0_CFG29 0x4001065du
#define CYDEV_UCFG_B0_P3_U0_CFG30 0x4001065eu
#define CYDEV_UCFG_B0_P3_U0_CFG31 0x4001065fu
#define CYDEV_UCFG_B0_P3_U0_DCFG0 0x40010660u
#define CYDEV_UCFG_B0_P3_U0_DCFG1 0x40010662u
#define CYDEV_UCFG_B0_P3_U0_DCFG2 0x40010664u
#define CYDEV_UCFG_B0_P3_U0_DCFG3 0x40010666u
#define CYDEV_UCFG_B0_P3_U0_DCFG4 0x40010668u
#define CYDEV_UCFG_B0_P3_U0_DCFG5 0x4001066au
#define CYDEV_UCFG_B0_P3_U0_DCFG6 0x4001066cu
#define CYDEV_UCFG_B0_P3_U0_DCFG7 0x4001066eu
#define CYDEV_UCFG_B0_P3_U1_BASE 0x40010680u
#define CYDEV_UCFG_B0_P3_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT0 0x40010680u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT1 0x40010684u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT2 0x40010688u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT3 0x4001068cu
#define CYDEV_UCFG_B0_P3_U1_PLD_IT4 0x40010690u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT5 0x40010694u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT6 0x40010698u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT7 0x4001069cu
#define CYDEV_UCFG_B0_P3_U1_PLD_IT8 0x400106a0u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT9 0x400106a4u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT10 0x400106a8u
#define CYDEV_UCFG_B0_P3_U1_PLD_IT11 0x400106acu
#define CYDEV_UCFG_B0_P3_U1_PLD_ORT0 0x400106b0u
#define CYDEV_UCFG_B0_P3_U1_PLD_ORT1 0x400106b2u
#define CYDEV_UCFG_B0_P3_U1_PLD_ORT2 0x400106b4u
#define CYDEV_UCFG_B0_P3_U1_PLD_ORT3 0x400106b6u
#define CYDEV_UCFG_B0_P3_U1_MC_CFG_CEN_CONST 0x400106b8u
#define CYDEV_UCFG_B0_P3_U1_MC_CFG_XORFB 0x400106bau
#define CYDEV_UCFG_B0_P3_U1_MC_CFG_SET_RESET 0x400106bcu
#define CYDEV_UCFG_B0_P3_U1_MC_CFG_BYPASS 0x400106beu
#define CYDEV_UCFG_B0_P3_U1_CFG0 0x400106c0u
#define CYDEV_UCFG_B0_P3_U1_CFG1 0x400106c1u
#define CYDEV_UCFG_B0_P3_U1_CFG2 0x400106c2u
#define CYDEV_UCFG_B0_P3_U1_CFG3 0x400106c3u
#define CYDEV_UCFG_B0_P3_U1_CFG4 0x400106c4u
#define CYDEV_UCFG_B0_P3_U1_CFG5 0x400106c5u
#define CYDEV_UCFG_B0_P3_U1_CFG6 0x400106c6u
#define CYDEV_UCFG_B0_P3_U1_CFG7 0x400106c7u
#define CYDEV_UCFG_B0_P3_U1_CFG8 0x400106c8u
#define CYDEV_UCFG_B0_P3_U1_CFG9 0x400106c9u
#define CYDEV_UCFG_B0_P3_U1_CFG10 0x400106cau
#define CYDEV_UCFG_B0_P3_U1_CFG11 0x400106cbu
#define CYDEV_UCFG_B0_P3_U1_CFG12 0x400106ccu
#define CYDEV_UCFG_B0_P3_U1_CFG13 0x400106cdu
#define CYDEV_UCFG_B0_P3_U1_CFG14 0x400106ceu
#define CYDEV_UCFG_B0_P3_U1_CFG15 0x400106cfu
#define CYDEV_UCFG_B0_P3_U1_CFG16 0x400106d0u
#define CYDEV_UCFG_B0_P3_U1_CFG20 0x400106d4u
#define CYDEV_UCFG_B0_P3_U1_CFG21 0x400106d5u
#define CYDEV_UCFG_B0_P3_U1_CFG22 0x400106d6u
#define CYDEV_UCFG_B0_P3_U1_CFG23 0x400106d7u
#define CYDEV_UCFG_B0_P3_U1_CFG24 0x400106d8u
#define CYDEV_UCFG_B0_P3_U1_CFG25 0x400106d9u
#define CYDEV_UCFG_B0_P3_U1_CFG26 0x400106dau
#define CYDEV_UCFG_B0_P3_U1_CFG27 0x400106dbu
#define CYDEV_UCFG_B0_P3_U1_CFG28 0x400106dcu
#define CYDEV_UCFG_B0_P3_U1_CFG29 0x400106ddu
#define CYDEV_UCFG_B0_P3_U1_CFG30 0x400106deu
#define CYDEV_UCFG_B0_P3_U1_CFG31 0x400106dfu
#define CYDEV_UCFG_B0_P3_U1_DCFG0 0x400106e0u
#define CYDEV_UCFG_B0_P3_U1_DCFG1 0x400106e2u
#define CYDEV_UCFG_B0_P3_U1_DCFG2 0x400106e4u
#define CYDEV_UCFG_B0_P3_U1_DCFG3 0x400106e6u
#define CYDEV_UCFG_B0_P3_U1_DCFG4 0x400106e8u
#define CYDEV_UCFG_B0_P3_U1_DCFG5 0x400106eau
#define CYDEV_UCFG_B0_P3_U1_DCFG6 0x400106ecu
#define CYDEV_UCFG_B0_P3_U1_DCFG7 0x400106eeu
#define CYDEV_UCFG_B0_P3_ROUTE_BASE 0x40010700u
#define CYDEV_UCFG_B0_P3_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P4_BASE 0x40010800u
#define CYDEV_UCFG_B0_P4_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P4_U0_BASE 0x40010800u
#define CYDEV_UCFG_B0_P4_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT0 0x40010800u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT1 0x40010804u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT2 0x40010808u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT3 0x4001080cu
#define CYDEV_UCFG_B0_P4_U0_PLD_IT4 0x40010810u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT5 0x40010814u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT6 0x40010818u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT7 0x4001081cu
#define CYDEV_UCFG_B0_P4_U0_PLD_IT8 0x40010820u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT9 0x40010824u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT10 0x40010828u
#define CYDEV_UCFG_B0_P4_U0_PLD_IT11 0x4001082cu
#define CYDEV_UCFG_B0_P4_U0_PLD_ORT0 0x40010830u
#define CYDEV_UCFG_B0_P4_U0_PLD_ORT1 0x40010832u
#define CYDEV_UCFG_B0_P4_U0_PLD_ORT2 0x40010834u
#define CYDEV_UCFG_B0_P4_U0_PLD_ORT3 0x40010836u
#define CYDEV_UCFG_B0_P4_U0_MC_CFG_CEN_CONST 0x40010838u
#define CYDEV_UCFG_B0_P4_U0_MC_CFG_XORFB 0x4001083au
#define CYDEV_UCFG_B0_P4_U0_MC_CFG_SET_RESET 0x4001083cu
#define CYDEV_UCFG_B0_P4_U0_MC_CFG_BYPASS 0x4001083eu
#define CYDEV_UCFG_B0_P4_U0_CFG0 0x40010840u
#define CYDEV_UCFG_B0_P4_U0_CFG1 0x40010841u
#define CYDEV_UCFG_B0_P4_U0_CFG2 0x40010842u
#define CYDEV_UCFG_B0_P4_U0_CFG3 0x40010843u
#define CYDEV_UCFG_B0_P4_U0_CFG4 0x40010844u
#define CYDEV_UCFG_B0_P4_U0_CFG5 0x40010845u
#define CYDEV_UCFG_B0_P4_U0_CFG6 0x40010846u
#define CYDEV_UCFG_B0_P4_U0_CFG7 0x40010847u
#define CYDEV_UCFG_B0_P4_U0_CFG8 0x40010848u
#define CYDEV_UCFG_B0_P4_U0_CFG9 0x40010849u
#define CYDEV_UCFG_B0_P4_U0_CFG10 0x4001084au
#define CYDEV_UCFG_B0_P4_U0_CFG11 0x4001084bu
#define CYDEV_UCFG_B0_P4_U0_CFG12 0x4001084cu
#define CYDEV_UCFG_B0_P4_U0_CFG13 0x4001084du
#define CYDEV_UCFG_B0_P4_U0_CFG14 0x4001084eu
#define CYDEV_UCFG_B0_P4_U0_CFG15 0x4001084fu
#define CYDEV_UCFG_B0_P4_U0_CFG16 0x40010850u
#define CYDEV_UCFG_B0_P4_U0_CFG20 0x40010854u
#define CYDEV_UCFG_B0_P4_U0_CFG21 0x40010855u
#define CYDEV_UCFG_B0_P4_U0_CFG22 0x40010856u
#define CYDEV_UCFG_B0_P4_U0_CFG23 0x40010857u
#define CYDEV_UCFG_B0_P4_U0_CFG24 0x40010858u
#define CYDEV_UCFG_B0_P4_U0_CFG25 0x40010859u
#define CYDEV_UCFG_B0_P4_U0_CFG26 0x4001085au
#define CYDEV_UCFG_B0_P4_U0_CFG27 0x4001085bu
#define CYDEV_UCFG_B0_P4_U0_CFG28 0x4001085cu
#define CYDEV_UCFG_B0_P4_U0_CFG29 0x4001085du
#define CYDEV_UCFG_B0_P4_U0_CFG30 0x4001085eu
#define CYDEV_UCFG_B0_P4_U0_CFG31 0x4001085fu
#define CYDEV_UCFG_B0_P4_U0_DCFG0 0x40010860u
#define CYDEV_UCFG_B0_P4_U0_DCFG1 0x40010862u
#define CYDEV_UCFG_B0_P4_U0_DCFG2 0x40010864u
#define CYDEV_UCFG_B0_P4_U0_DCFG3 0x40010866u
#define CYDEV_UCFG_B0_P4_U0_DCFG4 0x40010868u
#define CYDEV_UCFG_B0_P4_U0_DCFG5 0x4001086au
#define CYDEV_UCFG_B0_P4_U0_DCFG6 0x4001086cu
#define CYDEV_UCFG_B0_P4_U0_DCFG7 0x4001086eu
#define CYDEV_UCFG_B0_P4_U1_BASE 0x40010880u
#define CYDEV_UCFG_B0_P4_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT0 0x40010880u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT1 0x40010884u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT2 0x40010888u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT3 0x4001088cu
#define CYDEV_UCFG_B0_P4_U1_PLD_IT4 0x40010890u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT5 0x40010894u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT6 0x40010898u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT7 0x4001089cu
#define CYDEV_UCFG_B0_P4_U1_PLD_IT8 0x400108a0u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT9 0x400108a4u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT10 0x400108a8u
#define CYDEV_UCFG_B0_P4_U1_PLD_IT11 0x400108acu
#define CYDEV_UCFG_B0_P4_U1_PLD_ORT0 0x400108b0u
#define CYDEV_UCFG_B0_P4_U1_PLD_ORT1 0x400108b2u
#define CYDEV_UCFG_B0_P4_U1_PLD_ORT2 0x400108b4u
#define CYDEV_UCFG_B0_P4_U1_PLD_ORT3 0x400108b6u
#define CYDEV_UCFG_B0_P4_U1_MC_CFG_CEN_CONST 0x400108b8u
#define CYDEV_UCFG_B0_P4_U1_MC_CFG_XORFB 0x400108bau
#define CYDEV_UCFG_B0_P4_U1_MC_CFG_SET_RESET 0x400108bcu
#define CYDEV_UCFG_B0_P4_U1_MC_CFG_BYPASS 0x400108beu
#define CYDEV_UCFG_B0_P4_U1_CFG0 0x400108c0u
#define CYDEV_UCFG_B0_P4_U1_CFG1 0x400108c1u
#define CYDEV_UCFG_B0_P4_U1_CFG2 0x400108c2u
#define CYDEV_UCFG_B0_P4_U1_CFG3 0x400108c3u
#define CYDEV_UCFG_B0_P4_U1_CFG4 0x400108c4u
#define CYDEV_UCFG_B0_P4_U1_CFG5 0x400108c5u
#define CYDEV_UCFG_B0_P4_U1_CFG6 0x400108c6u
#define CYDEV_UCFG_B0_P4_U1_CFG7 0x400108c7u
#define CYDEV_UCFG_B0_P4_U1_CFG8 0x400108c8u
#define CYDEV_UCFG_B0_P4_U1_CFG9 0x400108c9u
#define CYDEV_UCFG_B0_P4_U1_CFG10 0x400108cau
#define CYDEV_UCFG_B0_P4_U1_CFG11 0x400108cbu
#define CYDEV_UCFG_B0_P4_U1_CFG12 0x400108ccu
#define CYDEV_UCFG_B0_P4_U1_CFG13 0x400108cdu
#define CYDEV_UCFG_B0_P4_U1_CFG14 0x400108ceu
#define CYDEV_UCFG_B0_P4_U1_CFG15 0x400108cfu
#define CYDEV_UCFG_B0_P4_U1_CFG16 0x400108d0u
#define CYDEV_UCFG_B0_P4_U1_CFG20 0x400108d4u
#define CYDEV_UCFG_B0_P4_U1_CFG21 0x400108d5u
#define CYDEV_UCFG_B0_P4_U1_CFG22 0x400108d6u
#define CYDEV_UCFG_B0_P4_U1_CFG23 0x400108d7u
#define CYDEV_UCFG_B0_P4_U1_CFG24 0x400108d8u
#define CYDEV_UCFG_B0_P4_U1_CFG25 0x400108d9u
#define CYDEV_UCFG_B0_P4_U1_CFG26 0x400108dau
#define CYDEV_UCFG_B0_P4_U1_CFG27 0x400108dbu
#define CYDEV_UCFG_B0_P4_U1_CFG28 0x400108dcu
#define CYDEV_UCFG_B0_P4_U1_CFG29 0x400108ddu
#define CYDEV_UCFG_B0_P4_U1_CFG30 0x400108deu
#define CYDEV_UCFG_B0_P4_U1_CFG31 0x400108dfu
#define CYDEV_UCFG_B0_P4_U1_DCFG0 0x400108e0u
#define CYDEV_UCFG_B0_P4_U1_DCFG1 0x400108e2u
#define CYDEV_UCFG_B0_P4_U1_DCFG2 0x400108e4u
#define CYDEV_UCFG_B0_P4_U1_DCFG3 0x400108e6u
#define CYDEV_UCFG_B0_P4_U1_DCFG4 0x400108e8u
#define CYDEV_UCFG_B0_P4_U1_DCFG5 0x400108eau
#define CYDEV_UCFG_B0_P4_U1_DCFG6 0x400108ecu
#define CYDEV_UCFG_B0_P4_U1_DCFG7 0x400108eeu
#define CYDEV_UCFG_B0_P4_ROUTE_BASE 0x40010900u
#define CYDEV_UCFG_B0_P4_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P5_BASE 0x40010a00u
#define CYDEV_UCFG_B0_P5_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P5_U0_BASE 0x40010a00u
#define CYDEV_UCFG_B0_P5_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT0 0x40010a00u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT1 0x40010a04u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT2 0x40010a08u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT3 0x40010a0cu
#define CYDEV_UCFG_B0_P5_U0_PLD_IT4 0x40010a10u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT5 0x40010a14u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT6 0x40010a18u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT7 0x40010a1cu
#define CYDEV_UCFG_B0_P5_U0_PLD_IT8 0x40010a20u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT9 0x40010a24u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT10 0x40010a28u
#define CYDEV_UCFG_B0_P5_U0_PLD_IT11 0x40010a2cu
#define CYDEV_UCFG_B0_P5_U0_PLD_ORT0 0x40010a30u
#define CYDEV_UCFG_B0_P5_U0_PLD_ORT1 0x40010a32u
#define CYDEV_UCFG_B0_P5_U0_PLD_ORT2 0x40010a34u
#define CYDEV_UCFG_B0_P5_U0_PLD_ORT3 0x40010a36u
#define CYDEV_UCFG_B0_P5_U0_MC_CFG_CEN_CONST 0x40010a38u
#define CYDEV_UCFG_B0_P5_U0_MC_CFG_XORFB 0x40010a3au
#define CYDEV_UCFG_B0_P5_U0_MC_CFG_SET_RESET 0x40010a3cu
#define CYDEV_UCFG_B0_P5_U0_MC_CFG_BYPASS 0x40010a3eu
#define CYDEV_UCFG_B0_P5_U0_CFG0 0x40010a40u
#define CYDEV_UCFG_B0_P5_U0_CFG1 0x40010a41u
#define CYDEV_UCFG_B0_P5_U0_CFG2 0x40010a42u
#define CYDEV_UCFG_B0_P5_U0_CFG3 0x40010a43u
#define CYDEV_UCFG_B0_P5_U0_CFG4 0x40010a44u
#define CYDEV_UCFG_B0_P5_U0_CFG5 0x40010a45u
#define CYDEV_UCFG_B0_P5_U0_CFG6 0x40010a46u
#define CYDEV_UCFG_B0_P5_U0_CFG7 0x40010a47u
#define CYDEV_UCFG_B0_P5_U0_CFG8 0x40010a48u
#define CYDEV_UCFG_B0_P5_U0_CFG9 0x40010a49u
#define CYDEV_UCFG_B0_P5_U0_CFG10 0x40010a4au
#define CYDEV_UCFG_B0_P5_U0_CFG11 0x40010a4bu
#define CYDEV_UCFG_B0_P5_U0_CFG12 0x40010a4cu
#define CYDEV_UCFG_B0_P5_U0_CFG13 0x40010a4du
#define CYDEV_UCFG_B0_P5_U0_CFG14 0x40010a4eu
#define CYDEV_UCFG_B0_P5_U0_CFG15 0x40010a4fu
#define CYDEV_UCFG_B0_P5_U0_CFG16 0x40010a50u
#define CYDEV_UCFG_B0_P5_U0_CFG20 0x40010a54u
#define CYDEV_UCFG_B0_P5_U0_CFG21 0x40010a55u
#define CYDEV_UCFG_B0_P5_U0_CFG22 0x40010a56u
#define CYDEV_UCFG_B0_P5_U0_CFG23 0x40010a57u
#define CYDEV_UCFG_B0_P5_U0_CFG24 0x40010a58u
#define CYDEV_UCFG_B0_P5_U0_CFG25 0x40010a59u
#define CYDEV_UCFG_B0_P5_U0_CFG26 0x40010a5au
#define CYDEV_UCFG_B0_P5_U0_CFG27 0x40010a5bu
#define CYDEV_UCFG_B0_P5_U0_CFG28 0x40010a5cu
#define CYDEV_UCFG_B0_P5_U0_CFG29 0x40010a5du
#define CYDEV_UCFG_B0_P5_U0_CFG30 0x40010a5eu
#define CYDEV_UCFG_B0_P5_U0_CFG31 0x40010a5fu
#define CYDEV_UCFG_B0_P5_U0_DCFG0 0x40010a60u
#define CYDEV_UCFG_B0_P5_U0_DCFG1 0x40010a62u
#define CYDEV_UCFG_B0_P5_U0_DCFG2 0x40010a64u
#define CYDEV_UCFG_B0_P5_U0_DCFG3 0x40010a66u
#define CYDEV_UCFG_B0_P5_U0_DCFG4 0x40010a68u
#define CYDEV_UCFG_B0_P5_U0_DCFG5 0x40010a6au
#define CYDEV_UCFG_B0_P5_U0_DCFG6 0x40010a6cu
#define CYDEV_UCFG_B0_P5_U0_DCFG7 0x40010a6eu
#define CYDEV_UCFG_B0_P5_U1_BASE 0x40010a80u
#define CYDEV_UCFG_B0_P5_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT0 0x40010a80u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT1 0x40010a84u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT2 0x40010a88u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT3 0x40010a8cu
#define CYDEV_UCFG_B0_P5_U1_PLD_IT4 0x40010a90u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT5 0x40010a94u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT6 0x40010a98u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT7 0x40010a9cu
#define CYDEV_UCFG_B0_P5_U1_PLD_IT8 0x40010aa0u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT9 0x40010aa4u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT10 0x40010aa8u
#define CYDEV_UCFG_B0_P5_U1_PLD_IT11 0x40010aacu
#define CYDEV_UCFG_B0_P5_U1_PLD_ORT0 0x40010ab0u
#define CYDEV_UCFG_B0_P5_U1_PLD_ORT1 0x40010ab2u
#define CYDEV_UCFG_B0_P5_U1_PLD_ORT2 0x40010ab4u
#define CYDEV_UCFG_B0_P5_U1_PLD_ORT3 0x40010ab6u
#define CYDEV_UCFG_B0_P5_U1_MC_CFG_CEN_CONST 0x40010ab8u
#define CYDEV_UCFG_B0_P5_U1_MC_CFG_XORFB 0x40010abau
#define CYDEV_UCFG_B0_P5_U1_MC_CFG_SET_RESET 0x40010abcu
#define CYDEV_UCFG_B0_P5_U1_MC_CFG_BYPASS 0x40010abeu
#define CYDEV_UCFG_B0_P5_U1_CFG0 0x40010ac0u
#define CYDEV_UCFG_B0_P5_U1_CFG1 0x40010ac1u
#define CYDEV_UCFG_B0_P5_U1_CFG2 0x40010ac2u
#define CYDEV_UCFG_B0_P5_U1_CFG3 0x40010ac3u
#define CYDEV_UCFG_B0_P5_U1_CFG4 0x40010ac4u
#define CYDEV_UCFG_B0_P5_U1_CFG5 0x40010ac5u
#define CYDEV_UCFG_B0_P5_U1_CFG6 0x40010ac6u
#define CYDEV_UCFG_B0_P5_U1_CFG7 0x40010ac7u
#define CYDEV_UCFG_B0_P5_U1_CFG8 0x40010ac8u
#define CYDEV_UCFG_B0_P5_U1_CFG9 0x40010ac9u
#define CYDEV_UCFG_B0_P5_U1_CFG10 0x40010acau
#define CYDEV_UCFG_B0_P5_U1_CFG11 0x40010acbu
#define CYDEV_UCFG_B0_P5_U1_CFG12 0x40010accu
#define CYDEV_UCFG_B0_P5_U1_CFG13 0x40010acdu
#define CYDEV_UCFG_B0_P5_U1_CFG14 0x40010aceu
#define CYDEV_UCFG_B0_P5_U1_CFG15 0x40010acfu
#define CYDEV_UCFG_B0_P5_U1_CFG16 0x40010ad0u
#define CYDEV_UCFG_B0_P5_U1_CFG20 0x40010ad4u
#define CYDEV_UCFG_B0_P5_U1_CFG21 0x40010ad5u
#define CYDEV_UCFG_B0_P5_U1_CFG22 0x40010ad6u
#define CYDEV_UCFG_B0_P5_U1_CFG23 0x40010ad7u
#define CYDEV_UCFG_B0_P5_U1_CFG24 0x40010ad8u
#define CYDEV_UCFG_B0_P5_U1_CFG25 0x40010ad9u
#define CYDEV_UCFG_B0_P5_U1_CFG26 0x40010adau
#define CYDEV_UCFG_B0_P5_U1_CFG27 0x40010adbu
#define CYDEV_UCFG_B0_P5_U1_CFG28 0x40010adcu
#define CYDEV_UCFG_B0_P5_U1_CFG29 0x40010addu
#define CYDEV_UCFG_B0_P5_U1_CFG30 0x40010adeu
#define CYDEV_UCFG_B0_P5_U1_CFG31 0x40010adfu
#define CYDEV_UCFG_B0_P5_U1_DCFG0 0x40010ae0u
#define CYDEV_UCFG_B0_P5_U1_DCFG1 0x40010ae2u
#define CYDEV_UCFG_B0_P5_U1_DCFG2 0x40010ae4u
#define CYDEV_UCFG_B0_P5_U1_DCFG3 0x40010ae6u
#define CYDEV_UCFG_B0_P5_U1_DCFG4 0x40010ae8u
#define CYDEV_UCFG_B0_P5_U1_DCFG5 0x40010aeau
#define CYDEV_UCFG_B0_P5_U1_DCFG6 0x40010aecu
#define CYDEV_UCFG_B0_P5_U1_DCFG7 0x40010aeeu
#define CYDEV_UCFG_B0_P5_ROUTE_BASE 0x40010b00u
#define CYDEV_UCFG_B0_P5_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P6_BASE 0x40010c00u
#define CYDEV_UCFG_B0_P6_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P6_U0_BASE 0x40010c00u
#define CYDEV_UCFG_B0_P6_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT0 0x40010c00u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT1 0x40010c04u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT2 0x40010c08u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT3 0x40010c0cu
#define CYDEV_UCFG_B0_P6_U0_PLD_IT4 0x40010c10u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT5 0x40010c14u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT6 0x40010c18u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT7 0x40010c1cu
#define CYDEV_UCFG_B0_P6_U0_PLD_IT8 0x40010c20u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT9 0x40010c24u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT10 0x40010c28u
#define CYDEV_UCFG_B0_P6_U0_PLD_IT11 0x40010c2cu
#define CYDEV_UCFG_B0_P6_U0_PLD_ORT0 0x40010c30u
#define CYDEV_UCFG_B0_P6_U0_PLD_ORT1 0x40010c32u
#define CYDEV_UCFG_B0_P6_U0_PLD_ORT2 0x40010c34u
#define CYDEV_UCFG_B0_P6_U0_PLD_ORT3 0x40010c36u
#define CYDEV_UCFG_B0_P6_U0_MC_CFG_CEN_CONST 0x40010c38u
#define CYDEV_UCFG_B0_P6_U0_MC_CFG_XORFB 0x40010c3au
#define CYDEV_UCFG_B0_P6_U0_MC_CFG_SET_RESET 0x40010c3cu
#define CYDEV_UCFG_B0_P6_U0_MC_CFG_BYPASS 0x40010c3eu
#define CYDEV_UCFG_B0_P6_U0_CFG0 0x40010c40u
#define CYDEV_UCFG_B0_P6_U0_CFG1 0x40010c41u
#define CYDEV_UCFG_B0_P6_U0_CFG2 0x40010c42u
#define CYDEV_UCFG_B0_P6_U0_CFG3 0x40010c43u
#define CYDEV_UCFG_B0_P6_U0_CFG4 0x40010c44u
#define CYDEV_UCFG_B0_P6_U0_CFG5 0x40010c45u
#define CYDEV_UCFG_B0_P6_U0_CFG6 0x40010c46u
#define CYDEV_UCFG_B0_P6_U0_CFG7 0x40010c47u
#define CYDEV_UCFG_B0_P6_U0_CFG8 0x40010c48u
#define CYDEV_UCFG_B0_P6_U0_CFG9 0x40010c49u
#define CYDEV_UCFG_B0_P6_U0_CFG10 0x40010c4au
#define CYDEV_UCFG_B0_P6_U0_CFG11 0x40010c4bu
#define CYDEV_UCFG_B0_P6_U0_CFG12 0x40010c4cu
#define CYDEV_UCFG_B0_P6_U0_CFG13 0x40010c4du
#define CYDEV_UCFG_B0_P6_U0_CFG14 0x40010c4eu
#define CYDEV_UCFG_B0_P6_U0_CFG15 0x40010c4fu
#define CYDEV_UCFG_B0_P6_U0_CFG16 0x40010c50u
#define CYDEV_UCFG_B0_P6_U0_CFG20 0x40010c54u
#define CYDEV_UCFG_B0_P6_U0_CFG21 0x40010c55u
#define CYDEV_UCFG_B0_P6_U0_CFG22 0x40010c56u
#define CYDEV_UCFG_B0_P6_U0_CFG23 0x40010c57u
#define CYDEV_UCFG_B0_P6_U0_CFG24 0x40010c58u
#define CYDEV_UCFG_B0_P6_U0_CFG25 0x40010c59u
#define CYDEV_UCFG_B0_P6_U0_CFG26 0x40010c5au
#define CYDEV_UCFG_B0_P6_U0_CFG27 0x40010c5bu
#define CYDEV_UCFG_B0_P6_U0_CFG28 0x40010c5cu
#define CYDEV_UCFG_B0_P6_U0_CFG29 0x40010c5du
#define CYDEV_UCFG_B0_P6_U0_CFG30 0x40010c5eu
#define CYDEV_UCFG_B0_P6_U0_CFG31 0x40010c5fu
#define CYDEV_UCFG_B0_P6_U0_DCFG0 0x40010c60u
#define CYDEV_UCFG_B0_P6_U0_DCFG1 0x40010c62u
#define CYDEV_UCFG_B0_P6_U0_DCFG2 0x40010c64u
#define CYDEV_UCFG_B0_P6_U0_DCFG3 0x40010c66u
#define CYDEV_UCFG_B0_P6_U0_DCFG4 0x40010c68u
#define CYDEV_UCFG_B0_P6_U0_DCFG5 0x40010c6au
#define CYDEV_UCFG_B0_P6_U0_DCFG6 0x40010c6cu
#define CYDEV_UCFG_B0_P6_U0_DCFG7 0x40010c6eu
#define CYDEV_UCFG_B0_P6_U1_BASE 0x40010c80u
#define CYDEV_UCFG_B0_P6_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P6_U1_PLD_IT0 0x40010c80u
#define CYDEV_UCFG_B0_P6_U1_PLD_IT1 0x40010c84u
#define CYDEV_UCFG_B0_P6_U1_PLD_IT2 0x40010c88u
#define CYDEV_UCFG_B0_P6_U1_PLD_IT3 0x40010c8cu
#define CYDEV_UCFG_B0_P6_U1_PLD_IT4 0x40010c90u
#define CYDEV_UCFG_B0_P6_U1_PLD_IT5 0x40010c94u
