MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
#define CYDEV_UCFG_B0_P6_U1_PLD_IT6 0x40010c98u
#define CYDEV_UCFG_B0_P6_U1_PLD_IT7 0x40010c9cu
#define CYDEV_UCFG_B0_P6_U1_PLD_IT8 0x40010ca0u
#define CYDEV_UCFG_B0_P6_U1_PLD_IT9 0x40010ca4u
#define CYDEV_UCFG_B0_P6_U1_PLD_IT10 0x40010ca8u
#define CYDEV_UCFG_B0_P6_U1_PLD_IT11 0x40010cacu
#define CYDEV_UCFG_B0_P6_U1_PLD_ORT0 0x40010cb0u
#define CYDEV_UCFG_B0_P6_U1_PLD_ORT1 0x40010cb2u
#define CYDEV_UCFG_B0_P6_U1_PLD_ORT2 0x40010cb4u
#define CYDEV_UCFG_B0_P6_U1_PLD_ORT3 0x40010cb6u
#define CYDEV_UCFG_B0_P6_U1_MC_CFG_CEN_CONST 0x40010cb8u
#define CYDEV_UCFG_B0_P6_U1_MC_CFG_XORFB 0x40010cbau
#define CYDEV_UCFG_B0_P6_U1_MC_CFG_SET_RESET 0x40010cbcu
#define CYDEV_UCFG_B0_P6_U1_MC_CFG_BYPASS 0x40010cbeu
#define CYDEV_UCFG_B0_P6_U1_CFG0 0x40010cc0u
#define CYDEV_UCFG_B0_P6_U1_CFG1 0x40010cc1u
#define CYDEV_UCFG_B0_P6_U1_CFG2 0x40010cc2u
#define CYDEV_UCFG_B0_P6_U1_CFG3 0x40010cc3u
#define CYDEV_UCFG_B0_P6_U1_CFG4 0x40010cc4u
#define CYDEV_UCFG_B0_P6_U1_CFG5 0x40010cc5u
#define CYDEV_UCFG_B0_P6_U1_CFG6 0x40010cc6u
#define CYDEV_UCFG_B0_P6_U1_CFG7 0x40010cc7u
#define CYDEV_UCFG_B0_P6_U1_CFG8 0x40010cc8u
#define CYDEV_UCFG_B0_P6_U1_CFG9 0x40010cc9u
#define CYDEV_UCFG_B0_P6_U1_CFG10 0x40010ccau
#define CYDEV_UCFG_B0_P6_U1_CFG11 0x40010ccbu
#define CYDEV_UCFG_B0_P6_U1_CFG12 0x40010cccu
#define CYDEV_UCFG_B0_P6_U1_CFG13 0x40010ccdu
#define CYDEV_UCFG_B0_P6_U1_CFG14 0x40010cceu
#define CYDEV_UCFG_B0_P6_U1_CFG15 0x40010ccfu
#define CYDEV_UCFG_B0_P6_U1_CFG16 0x40010cd0u
#define CYDEV_UCFG_B0_P6_U1_CFG20 0x40010cd4u
#define CYDEV_UCFG_B0_P6_U1_CFG21 0x40010cd5u
#define CYDEV_UCFG_B0_P6_U1_CFG22 0x40010cd6u
#define CYDEV_UCFG_B0_P6_U1_CFG23 0x40010cd7u
#define CYDEV_UCFG_B0_P6_U1_CFG24 0x40010cd8u
#define CYDEV_UCFG_B0_P6_U1_CFG25 0x40010cd9u
#define CYDEV_UCFG_B0_P6_U1_CFG26 0x40010cdau
#define CYDEV_UCFG_B0_P6_U1_CFG27 0x40010cdbu
#define CYDEV_UCFG_B0_P6_U1_CFG28 0x40010cdcu
#define CYDEV_UCFG_B0_P6_U1_CFG29 0x40010cddu
#define CYDEV_UCFG_B0_P6_U1_CFG30 0x40010cdeu
#define CYDEV_UCFG_B0_P6_U1_CFG31 0x40010cdfu
#define CYDEV_UCFG_B0_P6_U1_DCFG0 0x40010ce0u
#define CYDEV_UCFG_B0_P6_U1_DCFG1 0x40010ce2u
#define CYDEV_UCFG_B0_P6_U1_DCFG2 0x40010ce4u
#define CYDEV_UCFG_B0_P6_U1_DCFG3 0x40010ce6u
#define CYDEV_UCFG_B0_P6_U1_DCFG4 0x40010ce8u
#define CYDEV_UCFG_B0_P6_U1_DCFG5 0x40010ceau
#define CYDEV_UCFG_B0_P6_U1_DCFG6 0x40010cecu
#define CYDEV_UCFG_B0_P6_U1_DCFG7 0x40010ceeu
#define CYDEV_UCFG_B0_P6_ROUTE_BASE 0x40010d00u
#define CYDEV_UCFG_B0_P6_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P7_BASE 0x40010e00u
#define CYDEV_UCFG_B0_P7_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P7_U0_BASE 0x40010e00u
#define CYDEV_UCFG_B0_P7_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT0 0x40010e00u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT1 0x40010e04u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT2 0x40010e08u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT3 0x40010e0cu
#define CYDEV_UCFG_B0_P7_U0_PLD_IT4 0x40010e10u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT5 0x40010e14u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT6 0x40010e18u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT7 0x40010e1cu
#define CYDEV_UCFG_B0_P7_U0_PLD_IT8 0x40010e20u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT9 0x40010e24u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT10 0x40010e28u
#define CYDEV_UCFG_B0_P7_U0_PLD_IT11 0x40010e2cu
#define CYDEV_UCFG_B0_P7_U0_PLD_ORT0 0x40010e30u
#define CYDEV_UCFG_B0_P7_U0_PLD_ORT1 0x40010e32u
#define CYDEV_UCFG_B0_P7_U0_PLD_ORT2 0x40010e34u
#define CYDEV_UCFG_B0_P7_U0_PLD_ORT3 0x40010e36u
#define CYDEV_UCFG_B0_P7_U0_MC_CFG_CEN_CONST 0x40010e38u
#define CYDEV_UCFG_B0_P7_U0_MC_CFG_XORFB 0x40010e3au
#define CYDEV_UCFG_B0_P7_U0_MC_CFG_SET_RESET 0x40010e3cu
#define CYDEV_UCFG_B0_P7_U0_MC_CFG_BYPASS 0x40010e3eu
#define CYDEV_UCFG_B0_P7_U0_CFG0 0x40010e40u
#define CYDEV_UCFG_B0_P7_U0_CFG1 0x40010e41u
#define CYDEV_UCFG_B0_P7_U0_CFG2 0x40010e42u
#define CYDEV_UCFG_B0_P7_U0_CFG3 0x40010e43u
#define CYDEV_UCFG_B0_P7_U0_CFG4 0x40010e44u
#define CYDEV_UCFG_B0_P7_U0_CFG5 0x40010e45u
#define CYDEV_UCFG_B0_P7_U0_CFG6 0x40010e46u
#define CYDEV_UCFG_B0_P7_U0_CFG7 0x40010e47u
#define CYDEV_UCFG_B0_P7_U0_CFG8 0x40010e48u
#define CYDEV_UCFG_B0_P7_U0_CFG9 0x40010e49u
#define CYDEV_UCFG_B0_P7_U0_CFG10 0x40010e4au
#define CYDEV_UCFG_B0_P7_U0_CFG11 0x40010e4bu
#define CYDEV_UCFG_B0_P7_U0_CFG12 0x40010e4cu
#define CYDEV_UCFG_B0_P7_U0_CFG13 0x40010e4du
#define CYDEV_UCFG_B0_P7_U0_CFG14 0x40010e4eu
#define CYDEV_UCFG_B0_P7_U0_CFG15 0x40010e4fu
#define CYDEV_UCFG_B0_P7_U0_CFG16 0x40010e50u
#define CYDEV_UCFG_B0_P7_U0_CFG20 0x40010e54u
#define CYDEV_UCFG_B0_P7_U0_CFG21 0x40010e55u
#define CYDEV_UCFG_B0_P7_U0_CFG22 0x40010e56u
#define CYDEV_UCFG_B0_P7_U0_CFG23 0x40010e57u
#define CYDEV_UCFG_B0_P7_U0_CFG24 0x40010e58u
#define CYDEV_UCFG_B0_P7_U0_CFG25 0x40010e59u
#define CYDEV_UCFG_B0_P7_U0_CFG26 0x40010e5au
#define CYDEV_UCFG_B0_P7_U0_CFG27 0x40010e5bu
#define CYDEV_UCFG_B0_P7_U0_CFG28 0x40010e5cu
#define CYDEV_UCFG_B0_P7_U0_CFG29 0x40010e5du
#define CYDEV_UCFG_B0_P7_U0_CFG30 0x40010e5eu
#define CYDEV_UCFG_B0_P7_U0_CFG31 0x40010e5fu
#define CYDEV_UCFG_B0_P7_U0_DCFG0 0x40010e60u
#define CYDEV_UCFG_B0_P7_U0_DCFG1 0x40010e62u
#define CYDEV_UCFG_B0_P7_U0_DCFG2 0x40010e64u
#define CYDEV_UCFG_B0_P7_U0_DCFG3 0x40010e66u
#define CYDEV_UCFG_B0_P7_U0_DCFG4 0x40010e68u
#define CYDEV_UCFG_B0_P7_U0_DCFG5 0x40010e6au
#define CYDEV_UCFG_B0_P7_U0_DCFG6 0x40010e6cu
#define CYDEV_UCFG_B0_P7_U0_DCFG7 0x40010e6eu
#define CYDEV_UCFG_B0_P7_U1_BASE 0x40010e80u
#define CYDEV_UCFG_B0_P7_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT0 0x40010e80u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT1 0x40010e84u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT2 0x40010e88u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT3 0x40010e8cu
#define CYDEV_UCFG_B0_P7_U1_PLD_IT4 0x40010e90u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT5 0x40010e94u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT6 0x40010e98u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT7 0x40010e9cu
#define CYDEV_UCFG_B0_P7_U1_PLD_IT8 0x40010ea0u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT9 0x40010ea4u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT10 0x40010ea8u
#define CYDEV_UCFG_B0_P7_U1_PLD_IT11 0x40010eacu
#define CYDEV_UCFG_B0_P7_U1_PLD_ORT0 0x40010eb0u
#define CYDEV_UCFG_B0_P7_U1_PLD_ORT1 0x40010eb2u
#define CYDEV_UCFG_B0_P7_U1_PLD_ORT2 0x40010eb4u
#define CYDEV_UCFG_B0_P7_U1_PLD_ORT3 0x40010eb6u
#define CYDEV_UCFG_B0_P7_U1_MC_CFG_CEN_CONST 0x40010eb8u
#define CYDEV_UCFG_B0_P7_U1_MC_CFG_XORFB 0x40010ebau
#define CYDEV_UCFG_B0_P7_U1_MC_CFG_SET_RESET 0x40010ebcu
#define CYDEV_UCFG_B0_P7_U1_MC_CFG_BYPASS 0x40010ebeu
#define CYDEV_UCFG_B0_P7_U1_CFG0 0x40010ec0u
#define CYDEV_UCFG_B0_P7_U1_CFG1 0x40010ec1u
#define CYDEV_UCFG_B0_P7_U1_CFG2 0x40010ec2u
#define CYDEV_UCFG_B0_P7_U1_CFG3 0x40010ec3u
#define CYDEV_UCFG_B0_P7_U1_CFG4 0x40010ec4u
#define CYDEV_UCFG_B0_P7_U1_CFG5 0x40010ec5u
#define CYDEV_UCFG_B0_P7_U1_CFG6 0x40010ec6u
#define CYDEV_UCFG_B0_P7_U1_CFG7 0x40010ec7u
#define CYDEV_UCFG_B0_P7_U1_CFG8 0x40010ec8u
#define CYDEV_UCFG_B0_P7_U1_CFG9 0x40010ec9u
#define CYDEV_UCFG_B0_P7_U1_CFG10 0x40010ecau
#define CYDEV_UCFG_B0_P7_U1_CFG11 0x40010ecbu
#define CYDEV_UCFG_B0_P7_U1_CFG12 0x40010eccu
#define CYDEV_UCFG_B0_P7_U1_CFG13 0x40010ecdu
#define CYDEV_UCFG_B0_P7_U1_CFG14 0x40010eceu
#define CYDEV_UCFG_B0_P7_U1_CFG15 0x40010ecfu
#define CYDEV_UCFG_B0_P7_U1_CFG16 0x40010ed0u
#define CYDEV_UCFG_B0_P7_U1_CFG20 0x40010ed4u
#define CYDEV_UCFG_B0_P7_U1_CFG21 0x40010ed5u
#define CYDEV_UCFG_B0_P7_U1_CFG22 0x40010ed6u
#define CYDEV_UCFG_B0_P7_U1_CFG23 0x40010ed7u
#define CYDEV_UCFG_B0_P7_U1_CFG24 0x40010ed8u
#define CYDEV_UCFG_B0_P7_U1_CFG25 0x40010ed9u
#define CYDEV_UCFG_B0_P7_U1_CFG26 0x40010edau
#define CYDEV_UCFG_B0_P7_U1_CFG27 0x40010edbu
#define CYDEV_UCFG_B0_P7_U1_CFG28 0x40010edcu
#define CYDEV_UCFG_B0_P7_U1_CFG29 0x40010eddu
#define CYDEV_UCFG_B0_P7_U1_CFG30 0x40010edeu
#define CYDEV_UCFG_B0_P7_U1_CFG31 0x40010edfu
#define CYDEV_UCFG_B0_P7_U1_DCFG0 0x40010ee0u
#define CYDEV_UCFG_B0_P7_U1_DCFG1 0x40010ee2u
#define CYDEV_UCFG_B0_P7_U1_DCFG2 0x40010ee4u
#define CYDEV_UCFG_B0_P7_U1_DCFG3 0x40010ee6u
#define CYDEV_UCFG_B0_P7_U1_DCFG4 0x40010ee8u
#define CYDEV_UCFG_B0_P7_U1_DCFG5 0x40010eeau
#define CYDEV_UCFG_B0_P7_U1_DCFG6 0x40010eecu
#define CYDEV_UCFG_B0_P7_U1_DCFG7 0x40010eeeu
#define CYDEV_UCFG_B0_P7_ROUTE_BASE 0x40010f00u
#define CYDEV_UCFG_B0_P7_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B1_BASE 0x40011000u
#define CYDEV_UCFG_B1_SIZE 0x00000fefu
#define CYDEV_UCFG_B1_P2_BASE 0x40011400u
#define CYDEV_UCFG_B1_P2_SIZE 0x000001efu
#define CYDEV_UCFG_B1_P2_U0_BASE 0x40011400u
#define CYDEV_UCFG_B1_P2_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT0 0x40011400u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT1 0x40011404u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT2 0x40011408u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT3 0x4001140cu
#define CYDEV_UCFG_B1_P2_U0_PLD_IT4 0x40011410u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT5 0x40011414u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT6 0x40011418u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT7 0x4001141cu
#define CYDEV_UCFG_B1_P2_U0_PLD_IT8 0x40011420u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT9 0x40011424u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT10 0x40011428u
#define CYDEV_UCFG_B1_P2_U0_PLD_IT11 0x4001142cu
#define CYDEV_UCFG_B1_P2_U0_PLD_ORT0 0x40011430u
#define CYDEV_UCFG_B1_P2_U0_PLD_ORT1 0x40011432u
#define CYDEV_UCFG_B1_P2_U0_PLD_ORT2 0x40011434u
#define CYDEV_UCFG_B1_P2_U0_PLD_ORT3 0x40011436u
#define CYDEV_UCFG_B1_P2_U0_MC_CFG_CEN_CONST 0x40011438u
#define CYDEV_UCFG_B1_P2_U0_MC_CFG_XORFB 0x4001143au
#define CYDEV_UCFG_B1_P2_U0_MC_CFG_SET_RESET 0x4001143cu
#define CYDEV_UCFG_B1_P2_U0_MC_CFG_BYPASS 0x4001143eu
#define CYDEV_UCFG_B1_P2_U0_CFG0 0x40011440u
#define CYDEV_UCFG_B1_P2_U0_CFG1 0x40011441u
#define CYDEV_UCFG_B1_P2_U0_CFG2 0x40011442u
#define CYDEV_UCFG_B1_P2_U0_CFG3 0x40011443u
#define CYDEV_UCFG_B1_P2_U0_CFG4 0x40011444u
#define CYDEV_UCFG_B1_P2_U0_CFG5 0x40011445u
#define CYDEV_UCFG_B1_P2_U0_CFG6 0x40011446u
#define CYDEV_UCFG_B1_P2_U0_CFG7 0x40011447u
#define CYDEV_UCFG_B1_P2_U0_CFG8 0x40011448u
#define CYDEV_UCFG_B1_P2_U0_CFG9 0x40011449u
#define CYDEV_UCFG_B1_P2_U0_CFG10 0x4001144au
#define CYDEV_UCFG_B1_P2_U0_CFG11 0x4001144bu
#define CYDEV_UCFG_B1_P2_U0_CFG12 0x4001144cu
#define CYDEV_UCFG_B1_P2_U0_CFG13 0x4001144du
#define CYDEV_UCFG_B1_P2_U0_CFG14 0x4001144eu
#define CYDEV_UCFG_B1_P2_U0_CFG15 0x4001144fu
#define CYDEV_UCFG_B1_P2_U0_CFG16 0x40011450u
#define CYDEV_UCFG_B1_P2_U0_CFG20 0x40011454u
#define CYDEV_UCFG_B1_P2_U0_CFG21 0x40011455u
#define CYDEV_UCFG_B1_P2_U0_CFG22 0x40011456u
#define CYDEV_UCFG_B1_P2_U0_CFG23 0x40011457u
#define CYDEV_UCFG_B1_P2_U0_CFG24 0x40011458u
#define CYDEV_UCFG_B1_P2_U0_CFG25 0x40011459u
#define CYDEV_UCFG_B1_P2_U0_CFG26 0x4001145au
#define CYDEV_UCFG_B1_P2_U0_CFG27 0x4001145bu
#define CYDEV_UCFG_B1_P2_U0_CFG28 0x4001145cu
#define CYDEV_UCFG_B1_P2_U0_CFG29 0x4001145du
#define CYDEV_UCFG_B1_P2_U0_CFG30 0x4001145eu
#define CYDEV_UCFG_B1_P2_U0_CFG31 0x4001145fu
#define CYDEV_UCFG_B1_P2_U0_DCFG0 0x40011460u
#define CYDEV_UCFG_B1_P2_U0_DCFG1 0x40011462u
#define CYDEV_UCFG_B1_P2_U0_DCFG2 0x40011464u
#define CYDEV_UCFG_B1_P2_U0_DCFG3 0x40011466u
#define CYDEV_UCFG_B1_P2_U0_DCFG4 0x40011468u
#define CYDEV_UCFG_B1_P2_U0_DCFG5 0x4001146au
#define CYDEV_UCFG_B1_P2_U0_DCFG6 0x4001146cu
#define CYDEV_UCFG_B1_P2_U0_DCFG7 0x4001146eu
#define CYDEV_UCFG_B1_P2_U1_BASE 0x40011480u
#define CYDEV_UCFG_B1_P2_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT0 0x40011480u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT1 0x40011484u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT2 0x40011488u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT3 0x4001148cu
#define CYDEV_UCFG_B1_P2_U1_PLD_IT4 0x40011490u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT5 0x40011494u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT6 0x40011498u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT7 0x4001149cu
#define CYDEV_UCFG_B1_P2_U1_PLD_IT8 0x400114a0u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT9 0x400114a4u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT10 0x400114a8u
#define CYDEV_UCFG_B1_P2_U1_PLD_IT11 0x400114acu
#define CYDEV_UCFG_B1_P2_U1_PLD_ORT0 0x400114b0u
#define CYDEV_UCFG_B1_P2_U1_PLD_ORT1 0x400114b2u
#define CYDEV_UCFG_B1_P2_U1_PLD_ORT2 0x400114b4u
#define CYDEV_UCFG_B1_P2_U1_PLD_ORT3 0x400114b6u
#define CYDEV_UCFG_B1_P2_U1_MC_CFG_CEN_CONST 0x400114b8u
#define CYDEV_UCFG_B1_P2_U1_MC_CFG_XORFB 0x400114bau
#define CYDEV_UCFG_B1_P2_U1_MC_CFG_SET_RESET 0x400114bcu
#define CYDEV_UCFG_B1_P2_U1_MC_CFG_BYPASS 0x400114beu
#define CYDEV_UCFG_B1_P2_U1_CFG0 0x400114c0u
#define CYDEV_UCFG_B1_P2_U1_CFG1 0x400114c1u
#define CYDEV_UCFG_B1_P2_U1_CFG2 0x400114c2u
#define CYDEV_UCFG_B1_P2_U1_CFG3 0x400114c3u
#define CYDEV_UCFG_B1_P2_U1_CFG4 0x400114c4u
#define CYDEV_UCFG_B1_P2_U1_CFG5 0x400114c5u
#define CYDEV_UCFG_B1_P2_U1_CFG6 0x400114c6u
#define CYDEV_UCFG_B1_P2_U1_CFG7 0x400114c7u
#define CYDEV_UCFG_B1_P2_U1_CFG8 0x400114c8u
#define CYDEV_UCFG_B1_P2_U1_CFG9 0x400114c9u
#define CYDEV_UCFG_B1_P2_U1_CFG10 0x400114cau
#define CYDEV_UCFG_B1_P2_U1_CFG11 0x400114cbu
#define CYDEV_UCFG_B1_P2_U1_CFG12 0x400114ccu
#define CYDEV_UCFG_B1_P2_U1_CFG13 0x400114cdu
#define CYDEV_UCFG_B1_P2_U1_CFG14 0x400114ceu
#define CYDEV_UCFG_B1_P2_U1_CFG15 0x400114cfu
#define CYDEV_UCFG_B1_P2_U1_CFG16 0x400114d0u
#define CYDEV_UCFG_B1_P2_U1_CFG20 0x400114d4u
#define CYDEV_UCFG_B1_P2_U1_CFG21 0x400114d5u
#define CYDEV_UCFG_B1_P2_U1_CFG22 0x400114d6u
#define CYDEV_UCFG_B1_P2_U1_CFG23 0x400114d7u
#define CYDEV_UCFG_B1_P2_U1_CFG24 0x400114d8u
#define CYDEV_UCFG_B1_P2_U1_CFG25 0x400114d9u
#define CYDEV_UCFG_B1_P2_U1_CFG26 0x400114dau
#define CYDEV_UCFG_B1_P2_U1_CFG27 0x400114dbu
#define CYDEV_UCFG_B1_P2_U1_CFG28 0x400114dcu
#define CYDEV_UCFG_B1_P2_U1_CFG29 0x400114ddu
#define CYDEV_UCFG_B1_P2_U1_CFG30 0x400114deu
#define CYDEV_UCFG_B1_P2_U1_CFG31 0x400114dfu
#define CYDEV_UCFG_B1_P2_U1_DCFG0 0x400114e0u
#define CYDEV_UCFG_B1_P2_U1_DCFG1 0x400114e2u
#define CYDEV_UCFG_B1_P2_U1_DCFG2 0x400114e4u
#define CYDEV_UCFG_B1_P2_U1_DCFG3 0x400114e6u
#define CYDEV_UCFG_B1_P2_U1_DCFG4 0x400114e8u
#define CYDEV_UCFG_B1_P2_U1_DCFG5 0x400114eau
#define CYDEV_UCFG_B1_P2_U1_DCFG6 0x400114ecu
#define CYDEV_UCFG_B1_P2_U1_DCFG7 0x400114eeu
#define CYDEV_UCFG_B1_P2_ROUTE_BASE 0x40011500u
#define CYDEV_UCFG_B1_P2_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B1_P3_BASE 0x40011600u
#define CYDEV_UCFG_B1_P3_SIZE 0x000001efu
#define CYDEV_UCFG_B1_P3_U0_BASE 0x40011600u
#define CYDEV_UCFG_B1_P3_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT0 0x40011600u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT1 0x40011604u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT2 0x40011608u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT3 0x4001160cu
#define CYDEV_UCFG_B1_P3_U0_PLD_IT4 0x40011610u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT5 0x40011614u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT6 0x40011618u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT7 0x4001161cu
#define CYDEV_UCFG_B1_P3_U0_PLD_IT8 0x40011620u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT9 0x40011624u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT10 0x40011628u
#define CYDEV_UCFG_B1_P3_U0_PLD_IT11 0x4001162cu
#define CYDEV_UCFG_B1_P3_U0_PLD_ORT0 0x40011630u
#define CYDEV_UCFG_B1_P3_U0_PLD_ORT1 0x40011632u
#define CYDEV_UCFG_B1_P3_U0_PLD_ORT2 0x40011634u
#define CYDEV_UCFG_B1_P3_U0_PLD_ORT3 0x40011636u
#define CYDEV_UCFG_B1_P3_U0_MC_CFG_CEN_CONST 0x40011638u
#define CYDEV_UCFG_B1_P3_U0_MC_CFG_XORFB 0x4001163au
#define CYDEV_UCFG_B1_P3_U0_MC_CFG_SET_RESET 0x4001163cu
#define CYDEV_UCFG_B1_P3_U0_MC_CFG_BYPASS 0x4001163eu
#define CYDEV_UCFG_B1_P3_U0_CFG0 0x40011640u
#define CYDEV_UCFG_B1_P3_U0_CFG1 0x40011641u
#define CYDEV_UCFG_B1_P3_U0_CFG2 0x40011642u
#define CYDEV_UCFG_B1_P3_U0_CFG3 0x40011643u
#define CYDEV_UCFG_B1_P3_U0_CFG4 0x40011644u
#define CYDEV_UCFG_B1_P3_U0_CFG5 0x40011645u
#define CYDEV_UCFG_B1_P3_U0_CFG6 0x40011646u
#define CYDEV_UCFG_B1_P3_U0_CFG7 0x40011647u
#define CYDEV_UCFG_B1_P3_U0_CFG8 0x40011648u
#define CYDEV_UCFG_B1_P3_U0_CFG9 0x40011649u
#define CYDEV_UCFG_B1_P3_U0_CFG10 0x4001164au
#define CYDEV_UCFG_B1_P3_U0_CFG11 0x4001164bu
#define CYDEV_UCFG_B1_P3_U0_CFG12 0x4001164cu
#define CYDEV_UCFG_B1_P3_U0_CFG13 0x4001164du
#define CYDEV_UCFG_B1_P3_U0_CFG14 0x4001164eu
#define CYDEV_UCFG_B1_P3_U0_CFG15 0x4001164fu
#define CYDEV_UCFG_B1_P3_U0_CFG16 0x40011650u
#define CYDEV_UCFG_B1_P3_U0_CFG20 0x40011654u
#define CYDEV_UCFG_B1_P3_U0_CFG21 0x40011655u
#define CYDEV_UCFG_B1_P3_U0_CFG22 0x40011656u
#define CYDEV_UCFG_B1_P3_U0_CFG23 0x40011657u
#define CYDEV_UCFG_B1_P3_U0_CFG24 0x40011658u
#define CYDEV_UCFG_B1_P3_U0_CFG25 0x40011659u
#define CYDEV_UCFG_B1_P3_U0_CFG26 0x4001165au
#define CYDEV_UCFG_B1_P3_U0_CFG27 0x4001165bu
#define CYDEV_UCFG_B1_P3_U0_CFG28 0x4001165cu
#define CYDEV_UCFG_B1_P3_U0_CFG29 0x4001165du
#define CYDEV_UCFG_B1_P3_U0_CFG30 0x4001165eu
#define CYDEV_UCFG_B1_P3_U0_CFG31 0x4001165fu
#define CYDEV_UCFG_B1_P3_U0_DCFG0 0x40011660u
#define CYDEV_UCFG_B1_P3_U0_DCFG1 0x40011662u
#define CYDEV_UCFG_B1_P3_U0_DCFG2 0x40011664u
#define CYDEV_UCFG_B1_P3_U0_DCFG3 0x40011666u
#define CYDEV_UCFG_B1_P3_U0_DCFG4 0x40011668u
#define CYDEV_UCFG_B1_P3_U0_DCFG5 0x4001166au
#define CYDEV_UCFG_B1_P3_U0_DCFG6 0x4001166cu
#define CYDEV_UCFG_B1_P3_U0_DCFG7 0x4001166eu
#define CYDEV_UCFG_B1_P3_U1_BASE 0x40011680u
#define CYDEV_UCFG_B1_P3_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT0 0x40011680u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT1 0x40011684u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT2 0x40011688u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT3 0x4001168cu
#define CYDEV_UCFG_B1_P3_U1_PLD_IT4 0x40011690u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT5 0x40011694u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT6 0x40011698u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT7 0x4001169cu
#define CYDEV_UCFG_B1_P3_U1_PLD_IT8 0x400116a0u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT9 0x400116a4u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT10 0x400116a8u
#define CYDEV_UCFG_B1_P3_U1_PLD_IT11 0x400116acu
#define CYDEV_UCFG_B1_P3_U1_PLD_ORT0 0x400116b0u
#define CYDEV_UCFG_B1_P3_U1_PLD_ORT1 0x400116b2u
#define CYDEV_UCFG_B1_P3_U1_PLD_ORT2 0x400116b4u
#define CYDEV_UCFG_B1_P3_U1_PLD_ORT3 0x400116b6u
#define CYDEV_UCFG_B1_P3_U1_MC_CFG_CEN_CONST 0x400116b8u
#define CYDEV_UCFG_B1_P3_U1_MC_CFG_XORFB 0x400116bau
#define CYDEV_UCFG_B1_P3_U1_MC_CFG_SET_RESET 0x400116bcu
#define CYDEV_UCFG_B1_P3_U1_MC_CFG_BYPASS 0x400116beu
#define CYDEV_UCFG_B1_P3_U1_CFG0 0x400116c0u
#define CYDEV_UCFG_B1_P3_U1_CFG1 0x400116c1u
#define CYDEV_UCFG_B1_P3_U1_CFG2 0x400116c2u
#define CYDEV_UCFG_B1_P3_U1_CFG3 0x400116c3u
#define CYDEV_UCFG_B1_P3_U1_CFG4 0x400116c4u
#define CYDEV_UCFG_B1_P3_U1_CFG5 0x400116c5u
#define CYDEV_UCFG_B1_P3_U1_CFG6 0x400116c6u
#define CYDEV_UCFG_B1_P3_U1_CFG7 0x400116c7u
#define CYDEV_UCFG_B1_P3_U1_CFG8 0x400116c8u
#define CYDEV_UCFG_B1_P3_U1_CFG9 0x400116c9u
#define CYDEV_UCFG_B1_P3_U1_CFG10 0x400116cau
#define CYDEV_UCFG_B1_P3_U1_CFG11 0x400116cbu
#define CYDEV_UCFG_B1_P3_U1_CFG12 0x400116ccu
#define CYDEV_UCFG_B1_P3_U1_CFG13 0x400116cdu
#define CYDEV_UCFG_B1_P3_U1_CFG14 0x400116ceu
#define CYDEV_UCFG_B1_P3_U1_CFG15 0x400116cfu
#define CYDEV_UCFG_B1_P3_U1_CFG16 0x400116d0u
#define CYDEV_UCFG_B1_P3_U1_CFG20 0x400116d4u
#define CYDEV_UCFG_B1_P3_U1_CFG21 0x400116d5u
#define CYDEV_UCFG_B1_P3_U1_CFG22 0x400116d6u
#define CYDEV_UCFG_B1_P3_U1_CFG23 0x400116d7u
#define CYDEV_UCFG_B1_P3_U1_CFG24 0x400116d8u
#define CYDEV_UCFG_B1_P3_U1_CFG25 0x400116d9u
#define CYDEV_UCFG_B1_P3_U1_CFG26 0x400116dau
#define CYDEV_UCFG_B1_P3_U1_CFG27 0x400116dbu
#define CYDEV_UCFG_B1_P3_U1_CFG28 0x400116dcu
#define CYDEV_UCFG_B1_P3_U1_CFG29 0x400116ddu
#define CYDEV_UCFG_B1_P3_U1_CFG30 0x400116deu
#define CYDEV_UCFG_B1_P3_U1_CFG31 0x400116dfu
#define CYDEV_UCFG_B1_P3_U1_DCFG0 0x400116e0u
#define CYDEV_UCFG_B1_P3_U1_DCFG1 0x400116e2u
#define CYDEV_UCFG_B1_P3_U1_DCFG2 0x400116e4u
#define CYDEV_UCFG_B1_P3_U1_DCFG3 0x400116e6u
#define CYDEV_UCFG_B1_P3_U1_DCFG4 0x400116e8u
#define CYDEV_UCFG_B1_P3_U1_DCFG5 0x400116eau
#define CYDEV_UCFG_B1_P3_U1_DCFG6 0x400116ecu
#define CYDEV_UCFG_B1_P3_U1_DCFG7 0x400116eeu
#define CYDEV_UCFG_B1_P3_ROUTE_BASE 0x40011700u
#define CYDEV_UCFG_B1_P3_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B1_P4_BASE 0x40011800u
#define CYDEV_UCFG_B1_P4_SIZE 0x000001efu
#define CYDEV_UCFG_B1_P4_U0_BASE 0x40011800u
#define CYDEV_UCFG_B1_P4_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT0 0x40011800u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT1 0x40011804u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT2 0x40011808u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT3 0x4001180cu
#define CYDEV_UCFG_B1_P4_U0_PLD_IT4 0x40011810u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT5 0x40011814u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT6 0x40011818u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT7 0x4001181cu
#define CYDEV_UCFG_B1_P4_U0_PLD_IT8 0x40011820u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT9 0x40011824u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT10 0x40011828u
#define CYDEV_UCFG_B1_P4_U0_PLD_IT11 0x4001182cu
#define CYDEV_UCFG_B1_P4_U0_PLD_ORT0 0x40011830u
#define CYDEV_UCFG_B1_P4_U0_PLD_ORT1 0x40011832u
#define CYDEV_UCFG_B1_P4_U0_PLD_ORT2 0x40011834u
#define CYDEV_UCFG_B1_P4_U0_PLD_ORT3 0x40011836u
#define CYDEV_UCFG_B1_P4_U0_MC_CFG_CEN_CONST 0x40011838u
#define CYDEV_UCFG_B1_P4_U0_MC_CFG_XORFB 0x4001183au
#define CYDEV_UCFG_B1_P4_U0_MC_CFG_SET_RESET 0x4001183cu
#define CYDEV_UCFG_B1_P4_U0_MC_CFG_BYPASS 0x4001183eu
#define CYDEV_UCFG_B1_P4_U0_CFG0 0x40011840u
#define CYDEV_UCFG_B1_P4_U0_CFG1 0x40011841u
#define CYDEV_UCFG_B1_P4_U0_CFG2 0x40011842u
#define CYDEV_UCFG_B1_P4_U0_CFG3 0x40011843u
#define CYDEV_UCFG_B1_P4_U0_CFG4 0x40011844u
#define CYDEV_UCFG_B1_P4_U0_CFG5 0x40011845u
#define CYDEV_UCFG_B1_P4_U0_CFG6 0x40011846u
#define CYDEV_UCFG_B1_P4_U0_CFG7 0x40011847u
#define CYDEV_UCFG_B1_P4_U0_CFG8 0x40011848u
#define CYDEV_UCFG_B1_P4_U0_CFG9 0x40011849u
#define CYDEV_UCFG_B1_P4_U0_CFG10 0x4001184au
#define CYDEV_UCFG_B1_P4_U0_CFG11 0x4001184bu
#define CYDEV_UCFG_B1_P4_U0_CFG12 0x4001184cu
#define CYDEV_UCFG_B1_P4_U0_CFG13 0x4001184du
#define CYDEV_UCFG_B1_P4_U0_CFG14 0x4001184eu
#define CYDEV_UCFG_B1_P4_U0_CFG15 0x4001184fu
#define CYDEV_UCFG_B1_P4_U0_CFG16 0x40011850u
#define CYDEV_UCFG_B1_P4_U0_CFG20 0x40011854u
#define CYDEV_UCFG_B1_P4_U0_CFG21 0x40011855u
#define CYDEV_UCFG_B1_P4_U0_CFG22 0x40011856u
#define CYDEV_UCFG_B1_P4_U0_CFG23 0x40011857u
#define CYDEV_UCFG_B1_P4_U0_CFG24 0x40011858u
#define CYDEV_UCFG_B1_P4_U0_CFG25 0x40011859u
#define CYDEV_UCFG_B1_P4_U0_CFG26 0x4001185au
#define CYDEV_UCFG_B1_P4_U0_CFG27 0x4001185bu
#define CYDEV_UCFG_B1_P4_U0_CFG28 0x4001185cu
#define CYDEV_UCFG_B1_P4_U0_CFG29 0x4001185du
#define CYDEV_UCFG_B1_P4_U0_CFG30 0x4001185eu
#define CYDEV_UCFG_B1_P4_U0_CFG31 0x4001185fu
#define CYDEV_UCFG_B1_P4_U0_DCFG0 0x40011860u
#define CYDEV_UCFG_B1_P4_U0_DCFG1 0x40011862u
#define CYDEV_UCFG_B1_P4_U0_DCFG2 0x40011864u
#define CYDEV_UCFG_B1_P4_U0_DCFG3 0x40011866u
#define CYDEV_UCFG_B1_P4_U0_DCFG4 0x40011868u
#define CYDEV_UCFG_B1_P4_U0_DCFG5 0x4001186au
#define CYDEV_UCFG_B1_P4_U0_DCFG6 0x4001186cu
#define CYDEV_UCFG_B1_P4_U0_DCFG7 0x4001186eu
#define CYDEV_UCFG_B1_P4_U1_BASE 0x40011880u
#define CYDEV_UCFG_B1_P4_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT0 0x40011880u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT1 0x40011884u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT2 0x40011888u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT3 0x4001188cu
#define CYDEV_UCFG_B1_P4_U1_PLD_IT4 0x40011890u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT5 0x40011894u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT6 0x40011898u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT7 0x4001189cu
#define CYDEV_UCFG_B1_P4_U1_PLD_IT8 0x400118a0u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT9 0x400118a4u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT10 0x400118a8u
#define CYDEV_UCFG_B1_P4_U1_PLD_IT11 0x400118acu
#define CYDEV_UCFG_B1_P4_U1_PLD_ORT0 0x400118b0u
#define CYDEV_UCFG_B1_P4_U1_PLD_ORT1 0x400118b2u
#define CYDEV_UCFG_B1_P4_U1_PLD_ORT2 0x400118b4u
#define CYDEV_UCFG_B1_P4_U1_PLD_ORT3 0x400118b6u
