MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice.h
#define CYDEV_UCFG_B1_P4_U1_MC_CFG_CEN_CONST 0x400118b8u
#define CYDEV_UCFG_B1_P4_U1_MC_CFG_XORFB 0x400118bau
#define CYDEV_UCFG_B1_P4_U1_MC_CFG_SET_RESET 0x400118bcu
#define CYDEV_UCFG_B1_P4_U1_MC_CFG_BYPASS 0x400118beu
#define CYDEV_UCFG_B1_P4_U1_CFG0 0x400118c0u
#define CYDEV_UCFG_B1_P4_U1_CFG1 0x400118c1u
#define CYDEV_UCFG_B1_P4_U1_CFG2 0x400118c2u
#define CYDEV_UCFG_B1_P4_U1_CFG3 0x400118c3u
#define CYDEV_UCFG_B1_P4_U1_CFG4 0x400118c4u
#define CYDEV_UCFG_B1_P4_U1_CFG5 0x400118c5u
#define CYDEV_UCFG_B1_P4_U1_CFG6 0x400118c6u
#define CYDEV_UCFG_B1_P4_U1_CFG7 0x400118c7u
#define CYDEV_UCFG_B1_P4_U1_CFG8 0x400118c8u
#define CYDEV_UCFG_B1_P4_U1_CFG9 0x400118c9u
#define CYDEV_UCFG_B1_P4_U1_CFG10 0x400118cau
#define CYDEV_UCFG_B1_P4_U1_CFG11 0x400118cbu
#define CYDEV_UCFG_B1_P4_U1_CFG12 0x400118ccu
#define CYDEV_UCFG_B1_P4_U1_CFG13 0x400118cdu
#define CYDEV_UCFG_B1_P4_U1_CFG14 0x400118ceu
#define CYDEV_UCFG_B1_P4_U1_CFG15 0x400118cfu
#define CYDEV_UCFG_B1_P4_U1_CFG16 0x400118d0u
#define CYDEV_UCFG_B1_P4_U1_CFG20 0x400118d4u
#define CYDEV_UCFG_B1_P4_U1_CFG21 0x400118d5u
#define CYDEV_UCFG_B1_P4_U1_CFG22 0x400118d6u
#define CYDEV_UCFG_B1_P4_U1_CFG23 0x400118d7u
#define CYDEV_UCFG_B1_P4_U1_CFG24 0x400118d8u
#define CYDEV_UCFG_B1_P4_U1_CFG25 0x400118d9u
#define CYDEV_UCFG_B1_P4_U1_CFG26 0x400118dau
#define CYDEV_UCFG_B1_P4_U1_CFG27 0x400118dbu
#define CYDEV_UCFG_B1_P4_U1_CFG28 0x400118dcu
#define CYDEV_UCFG_B1_P4_U1_CFG29 0x400118ddu
#define CYDEV_UCFG_B1_P4_U1_CFG30 0x400118deu
#define CYDEV_UCFG_B1_P4_U1_CFG31 0x400118dfu
#define CYDEV_UCFG_B1_P4_U1_DCFG0 0x400118e0u
#define CYDEV_UCFG_B1_P4_U1_DCFG1 0x400118e2u
#define CYDEV_UCFG_B1_P4_U1_DCFG2 0x400118e4u
#define CYDEV_UCFG_B1_P4_U1_DCFG3 0x400118e6u
#define CYDEV_UCFG_B1_P4_U1_DCFG4 0x400118e8u
#define CYDEV_UCFG_B1_P4_U1_DCFG5 0x400118eau
#define CYDEV_UCFG_B1_P4_U1_DCFG6 0x400118ecu
#define CYDEV_UCFG_B1_P4_U1_DCFG7 0x400118eeu
#define CYDEV_UCFG_B1_P4_ROUTE_BASE 0x40011900u
#define CYDEV_UCFG_B1_P4_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B1_P5_BASE 0x40011a00u
#define CYDEV_UCFG_B1_P5_SIZE 0x000001efu
#define CYDEV_UCFG_B1_P5_U0_BASE 0x40011a00u
#define CYDEV_UCFG_B1_P5_U0_SIZE 0x00000070u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT0 0x40011a00u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT1 0x40011a04u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT2 0x40011a08u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT3 0x40011a0cu
#define CYDEV_UCFG_B1_P5_U0_PLD_IT4 0x40011a10u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT5 0x40011a14u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT6 0x40011a18u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT7 0x40011a1cu
#define CYDEV_UCFG_B1_P5_U0_PLD_IT8 0x40011a20u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT9 0x40011a24u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT10 0x40011a28u
#define CYDEV_UCFG_B1_P5_U0_PLD_IT11 0x40011a2cu
#define CYDEV_UCFG_B1_P5_U0_PLD_ORT0 0x40011a30u
#define CYDEV_UCFG_B1_P5_U0_PLD_ORT1 0x40011a32u
#define CYDEV_UCFG_B1_P5_U0_PLD_ORT2 0x40011a34u
#define CYDEV_UCFG_B1_P5_U0_PLD_ORT3 0x40011a36u
#define CYDEV_UCFG_B1_P5_U0_MC_CFG_CEN_CONST 0x40011a38u
#define CYDEV_UCFG_B1_P5_U0_MC_CFG_XORFB 0x40011a3au
#define CYDEV_UCFG_B1_P5_U0_MC_CFG_SET_RESET 0x40011a3cu
#define CYDEV_UCFG_B1_P5_U0_MC_CFG_BYPASS 0x40011a3eu
#define CYDEV_UCFG_B1_P5_U0_CFG0 0x40011a40u
#define CYDEV_UCFG_B1_P5_U0_CFG1 0x40011a41u
#define CYDEV_UCFG_B1_P5_U0_CFG2 0x40011a42u
#define CYDEV_UCFG_B1_P5_U0_CFG3 0x40011a43u
#define CYDEV_UCFG_B1_P5_U0_CFG4 0x40011a44u
#define CYDEV_UCFG_B1_P5_U0_CFG5 0x40011a45u
#define CYDEV_UCFG_B1_P5_U0_CFG6 0x40011a46u
#define CYDEV_UCFG_B1_P5_U0_CFG7 0x40011a47u
#define CYDEV_UCFG_B1_P5_U0_CFG8 0x40011a48u
#define CYDEV_UCFG_B1_P5_U0_CFG9 0x40011a49u
#define CYDEV_UCFG_B1_P5_U0_CFG10 0x40011a4au
#define CYDEV_UCFG_B1_P5_U0_CFG11 0x40011a4bu
#define CYDEV_UCFG_B1_P5_U0_CFG12 0x40011a4cu
#define CYDEV_UCFG_B1_P5_U0_CFG13 0x40011a4du
#define CYDEV_UCFG_B1_P5_U0_CFG14 0x40011a4eu
#define CYDEV_UCFG_B1_P5_U0_CFG15 0x40011a4fu
#define CYDEV_UCFG_B1_P5_U0_CFG16 0x40011a50u
#define CYDEV_UCFG_B1_P5_U0_CFG20 0x40011a54u
#define CYDEV_UCFG_B1_P5_U0_CFG21 0x40011a55u
#define CYDEV_UCFG_B1_P5_U0_CFG22 0x40011a56u
#define CYDEV_UCFG_B1_P5_U0_CFG23 0x40011a57u
#define CYDEV_UCFG_B1_P5_U0_CFG24 0x40011a58u
#define CYDEV_UCFG_B1_P5_U0_CFG25 0x40011a59u
#define CYDEV_UCFG_B1_P5_U0_CFG26 0x40011a5au
#define CYDEV_UCFG_B1_P5_U0_CFG27 0x40011a5bu
#define CYDEV_UCFG_B1_P5_U0_CFG28 0x40011a5cu
#define CYDEV_UCFG_B1_P5_U0_CFG29 0x40011a5du
#define CYDEV_UCFG_B1_P5_U0_CFG30 0x40011a5eu
#define CYDEV_UCFG_B1_P5_U0_CFG31 0x40011a5fu
#define CYDEV_UCFG_B1_P5_U0_DCFG0 0x40011a60u
#define CYDEV_UCFG_B1_P5_U0_DCFG1 0x40011a62u
#define CYDEV_UCFG_B1_P5_U0_DCFG2 0x40011a64u
#define CYDEV_UCFG_B1_P5_U0_DCFG3 0x40011a66u
#define CYDEV_UCFG_B1_P5_U0_DCFG4 0x40011a68u
#define CYDEV_UCFG_B1_P5_U0_DCFG5 0x40011a6au
#define CYDEV_UCFG_B1_P5_U0_DCFG6 0x40011a6cu
#define CYDEV_UCFG_B1_P5_U0_DCFG7 0x40011a6eu
#define CYDEV_UCFG_B1_P5_U1_BASE 0x40011a80u
#define CYDEV_UCFG_B1_P5_U1_SIZE 0x00000070u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT0 0x40011a80u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT1 0x40011a84u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT2 0x40011a88u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT3 0x40011a8cu
#define CYDEV_UCFG_B1_P5_U1_PLD_IT4 0x40011a90u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT5 0x40011a94u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT6 0x40011a98u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT7 0x40011a9cu
#define CYDEV_UCFG_B1_P5_U1_PLD_IT8 0x40011aa0u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT9 0x40011aa4u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT10 0x40011aa8u
#define CYDEV_UCFG_B1_P5_U1_PLD_IT11 0x40011aacu
#define CYDEV_UCFG_B1_P5_U1_PLD_ORT0 0x40011ab0u
#define CYDEV_UCFG_B1_P5_U1_PLD_ORT1 0x40011ab2u
#define CYDEV_UCFG_B1_P5_U1_PLD_ORT2 0x40011ab4u
#define CYDEV_UCFG_B1_P5_U1_PLD_ORT3 0x40011ab6u
#define CYDEV_UCFG_B1_P5_U1_MC_CFG_CEN_CONST 0x40011ab8u
#define CYDEV_UCFG_B1_P5_U1_MC_CFG_XORFB 0x40011abau
#define CYDEV_UCFG_B1_P5_U1_MC_CFG_SET_RESET 0x40011abcu
#define CYDEV_UCFG_B1_P5_U1_MC_CFG_BYPASS 0x40011abeu
#define CYDEV_UCFG_B1_P5_U1_CFG0 0x40011ac0u
#define CYDEV_UCFG_B1_P5_U1_CFG1 0x40011ac1u
#define CYDEV_UCFG_B1_P5_U1_CFG2 0x40011ac2u
#define CYDEV_UCFG_B1_P5_U1_CFG3 0x40011ac3u
#define CYDEV_UCFG_B1_P5_U1_CFG4 0x40011ac4u
#define CYDEV_UCFG_B1_P5_U1_CFG5 0x40011ac5u
#define CYDEV_UCFG_B1_P5_U1_CFG6 0x40011ac6u
#define CYDEV_UCFG_B1_P5_U1_CFG7 0x40011ac7u
#define CYDEV_UCFG_B1_P5_U1_CFG8 0x40011ac8u
#define CYDEV_UCFG_B1_P5_U1_CFG9 0x40011ac9u
#define CYDEV_UCFG_B1_P5_U1_CFG10 0x40011acau
#define CYDEV_UCFG_B1_P5_U1_CFG11 0x40011acbu
#define CYDEV_UCFG_B1_P5_U1_CFG12 0x40011accu
#define CYDEV_UCFG_B1_P5_U1_CFG13 0x40011acdu
#define CYDEV_UCFG_B1_P5_U1_CFG14 0x40011aceu
#define CYDEV_UCFG_B1_P5_U1_CFG15 0x40011acfu
#define CYDEV_UCFG_B1_P5_U1_CFG16 0x40011ad0u
#define CYDEV_UCFG_B1_P5_U1_CFG20 0x40011ad4u
#define CYDEV_UCFG_B1_P5_U1_CFG21 0x40011ad5u
#define CYDEV_UCFG_B1_P5_U1_CFG22 0x40011ad6u
#define CYDEV_UCFG_B1_P5_U1_CFG23 0x40011ad7u
#define CYDEV_UCFG_B1_P5_U1_CFG24 0x40011ad8u
#define CYDEV_UCFG_B1_P5_U1_CFG25 0x40011ad9u
#define CYDEV_UCFG_B1_P5_U1_CFG26 0x40011adau
#define CYDEV_UCFG_B1_P5_U1_CFG27 0x40011adbu
#define CYDEV_UCFG_B1_P5_U1_CFG28 0x40011adcu
#define CYDEV_UCFG_B1_P5_U1_CFG29 0x40011addu
#define CYDEV_UCFG_B1_P5_U1_CFG30 0x40011adeu
#define CYDEV_UCFG_B1_P5_U1_CFG31 0x40011adfu
#define CYDEV_UCFG_B1_P5_U1_DCFG0 0x40011ae0u
#define CYDEV_UCFG_B1_P5_U1_DCFG1 0x40011ae2u
#define CYDEV_UCFG_B1_P5_U1_DCFG2 0x40011ae4u
#define CYDEV_UCFG_B1_P5_U1_DCFG3 0x40011ae6u
#define CYDEV_UCFG_B1_P5_U1_DCFG4 0x40011ae8u
#define CYDEV_UCFG_B1_P5_U1_DCFG5 0x40011aeau
#define CYDEV_UCFG_B1_P5_U1_DCFG6 0x40011aecu
#define CYDEV_UCFG_B1_P5_U1_DCFG7 0x40011aeeu
#define CYDEV_UCFG_B1_P5_ROUTE_BASE 0x40011b00u
#define CYDEV_UCFG_B1_P5_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_DSI0_BASE 0x40014000u
#define CYDEV_UCFG_DSI0_SIZE 0x000000efu
#define CYDEV_UCFG_DSI1_BASE 0x40014100u
#define CYDEV_UCFG_DSI1_SIZE 0x000000efu
#define CYDEV_UCFG_DSI2_BASE 0x40014200u
#define CYDEV_UCFG_DSI2_SIZE 0x000000efu
#define CYDEV_UCFG_DSI3_BASE 0x40014300u
#define CYDEV_UCFG_DSI3_SIZE 0x000000efu
#define CYDEV_UCFG_DSI4_BASE 0x40014400u
#define CYDEV_UCFG_DSI4_SIZE 0x000000efu
#define CYDEV_UCFG_DSI5_BASE 0x40014500u
#define CYDEV_UCFG_DSI5_SIZE 0x000000efu
#define CYDEV_UCFG_DSI6_BASE 0x40014600u
#define CYDEV_UCFG_DSI6_SIZE 0x000000efu
#define CYDEV_UCFG_DSI7_BASE 0x40014700u
#define CYDEV_UCFG_DSI7_SIZE 0x000000efu
#define CYDEV_UCFG_DSI8_BASE 0x40014800u
#define CYDEV_UCFG_DSI8_SIZE 0x000000efu
#define CYDEV_UCFG_DSI9_BASE 0x40014900u
#define CYDEV_UCFG_DSI9_SIZE 0x000000efu
#define CYDEV_UCFG_DSI12_BASE 0x40014c00u
#define CYDEV_UCFG_DSI12_SIZE 0x000000efu
#define CYDEV_UCFG_DSI13_BASE 0x40014d00u
#define CYDEV_UCFG_DSI13_SIZE 0x000000efu
#define CYDEV_UCFG_BCTL0_BASE 0x40015000u
#define CYDEV_UCFG_BCTL0_SIZE 0x00000010u
#define CYDEV_UCFG_BCTL0_MDCLK_EN 0x40015000u
#define CYDEV_UCFG_BCTL0_MBCLK_EN 0x40015001u
#define CYDEV_UCFG_BCTL0_WAIT_CFG 0x40015002u
#define CYDEV_UCFG_BCTL0_BANK_CTL 0x40015003u
#define CYDEV_UCFG_BCTL0_DCLK_EN0 0x40015008u
#define CYDEV_UCFG_BCTL0_BCLK_EN0 0x40015009u
#define CYDEV_UCFG_BCTL0_DCLK_EN1 0x4001500au
#define CYDEV_UCFG_BCTL0_BCLK_EN1 0x4001500bu
#define CYDEV_UCFG_BCTL0_DCLK_EN2 0x4001500cu
#define CYDEV_UCFG_BCTL0_BCLK_EN2 0x4001500du
#define CYDEV_UCFG_BCTL0_DCLK_EN3 0x4001500eu
#define CYDEV_UCFG_BCTL0_BCLK_EN3 0x4001500fu
#define CYDEV_UCFG_BCTL1_BASE 0x40015010u
#define CYDEV_UCFG_BCTL1_SIZE 0x00000010u
#define CYDEV_UCFG_BCTL1_MDCLK_EN 0x40015010u
#define CYDEV_UCFG_BCTL1_MBCLK_EN 0x40015011u
#define CYDEV_UCFG_BCTL1_WAIT_CFG 0x40015012u
#define CYDEV_UCFG_BCTL1_BANK_CTL 0x40015013u
#define CYDEV_UCFG_BCTL1_DCLK_EN0 0x40015018u
#define CYDEV_UCFG_BCTL1_BCLK_EN0 0x40015019u
#define CYDEV_UCFG_BCTL1_DCLK_EN1 0x4001501au
#define CYDEV_UCFG_BCTL1_BCLK_EN1 0x4001501bu
#define CYDEV_UCFG_BCTL1_DCLK_EN2 0x4001501cu
#define CYDEV_UCFG_BCTL1_BCLK_EN2 0x4001501du
#define CYDEV_UCFG_BCTL1_DCLK_EN3 0x4001501eu
#define CYDEV_UCFG_BCTL1_BCLK_EN3 0x4001501fu
#define CYDEV_IDMUX_BASE 0x40015100u
#define CYDEV_IDMUX_SIZE 0x00000016u
#define CYDEV_IDMUX_IRQ_CTL0 0x40015100u
#define CYDEV_IDMUX_IRQ_CTL1 0x40015101u
#define CYDEV_IDMUX_IRQ_CTL2 0x40015102u
#define CYDEV_IDMUX_IRQ_CTL3 0x40015103u
#define CYDEV_IDMUX_IRQ_CTL4 0x40015104u
#define CYDEV_IDMUX_IRQ_CTL5 0x40015105u
#define CYDEV_IDMUX_IRQ_CTL6 0x40015106u
#define CYDEV_IDMUX_IRQ_CTL7 0x40015107u
#define CYDEV_IDMUX_DRQ_CTL0 0x40015110u
#define CYDEV_IDMUX_DRQ_CTL1 0x40015111u
#define CYDEV_IDMUX_DRQ_CTL2 0x40015112u
#define CYDEV_IDMUX_DRQ_CTL3 0x40015113u
#define CYDEV_IDMUX_DRQ_CTL4 0x40015114u
#define CYDEV_IDMUX_DRQ_CTL5 0x40015115u
#define CYDEV_P3BA_BASE 0x40050300u
#define CYDEV_P3BA_SIZE 0x0000002bu
#define CYDEV_P3BA_Y_START 0x40050300u
#define CYDEV_P3BA_YROLL 0x40050301u
#define CYDEV_P3BA_YCFG 0x40050302u
#define CYDEV_P3BA_X_START1 0x40050303u
#define CYDEV_P3BA_X_START2 0x40050304u
#define CYDEV_P3BA_XROLL1 0x40050305u
#define CYDEV_P3BA_XROLL2 0x40050306u
#define CYDEV_P3BA_XINC 0x40050307u
#define CYDEV_P3BA_XCFG 0x40050308u
#define CYDEV_P3BA_OFFSETADDR1 0x40050309u
#define CYDEV_P3BA_OFFSETADDR2 0x4005030au
#define CYDEV_P3BA_OFFSETADDR3 0x4005030bu
#define CYDEV_P3BA_ABSADDR1 0x4005030cu
#define CYDEV_P3BA_ABSADDR2 0x4005030du
#define CYDEV_P3BA_ABSADDR3 0x4005030eu
#define CYDEV_P3BA_ABSADDR4 0x4005030fu
#define CYDEV_P3BA_DATCFG1 0x40050310u
#define CYDEV_P3BA_DATCFG2 0x40050311u
#define CYDEV_P3BA_CMP_RSLT1 0x40050314u
#define CYDEV_P3BA_CMP_RSLT2 0x40050315u
#define CYDEV_P3BA_CMP_RSLT3 0x40050316u
#define CYDEV_P3BA_CMP_RSLT4 0x40050317u
#define CYDEV_P3BA_DATA_REG1 0x40050318u
#define CYDEV_P3BA_DATA_REG2 0x40050319u
#define CYDEV_P3BA_DATA_REG3 0x4005031au
#define CYDEV_P3BA_DATA_REG4 0x4005031bu
#define CYDEV_P3BA_EXP_DATA1 0x4005031cu
#define CYDEV_P3BA_EXP_DATA2 0x4005031du
#define CYDEV_P3BA_EXP_DATA3 0x4005031eu
#define CYDEV_P3BA_EXP_DATA4 0x4005031fu
#define CYDEV_P3BA_MSTR_HRDATA1 0x40050320u
#define CYDEV_P3BA_MSTR_HRDATA2 0x40050321u
#define CYDEV_P3BA_MSTR_HRDATA3 0x40050322u
#define CYDEV_P3BA_MSTR_HRDATA4 0x40050323u
#define CYDEV_P3BA_BIST_EN 0x40050324u
#define CYDEV_P3BA_PHUB_MASTER_SSR 0x40050325u
#define CYDEV_P3BA_SEQCFG1 0x40050326u
#define CYDEV_P3BA_SEQCFG2 0x40050327u
#define CYDEV_P3BA_Y_CURR 0x40050328u
#define CYDEV_P3BA_X_CURR1 0x40050329u
#define CYDEV_P3BA_X_CURR2 0x4005032au
#define CYDEV_PANTHER_BASE 0x40080000u
#define CYDEV_PANTHER_SIZE 0x00000018u
#define CYDEV_PANTHER_STCALIB_CFG 0x40080000u
#define CYDEV_PANTHER_WAITPIPE 0x40080004u
#define CYDEV_PANTHER_TRACE_CFG 0x40080008u
#define CYDEV_PANTHER_ETMFIFO 0x4008000cu
#define CYDEV_PANTHER_PVTCFG1 0x40080010u
#define CYDEV_PANTHER_PVTCFG2 0x40080014u
#define CYDEV_FLSECC_BASE 0x48000000u
#define CYDEV_FLSECC_SIZE 0x00008000u
#define CYDEV_FLSECC_DATA_MBASE 0x48000000u
#define CYDEV_FLSECC_DATA_MSIZE 0x00008000u
#define CYDEV_FLSHID_BASE 0x49000000u
#define CYDEV_FLSHID_SIZE 0x00001000u
#define CYDEV_FLSHID_RSVD_MBASE 0x49000000u
#define CYDEV_FLSHID_RSVD_MSIZE 0x00000080u
#define CYDEV_FLSHID_CUST_MDATA_MBASE 0x49000080u
#define CYDEV_FLSHID_CUST_MDATA_MSIZE 0x00000080u
#define CYDEV_FLSHID_CUST_TABLES_BASE 0x49000100u
#define CYDEV_FLSHID_CUST_TABLES_SIZE 0x00000040u
#define CYDEV_FLSHID_CUST_TABLES_Y_LOC 0x49000100u
#define CYDEV_FLSHID_CUST_TABLES_X_LOC 0x49000101u
#define CYDEV_FLSHID_CUST_TABLES_WAFER_NUM 0x49000102u
#define CYDEV_FLSHID_CUST_TABLES_LOT_LSB 0x49000103u
#define CYDEV_FLSHID_CUST_TABLES_LOT_MSB 0x49000104u
#define CYDEV_FLSHID_CUST_TABLES_WRK_WK 0x49000105u
#define CYDEV_FLSHID_CUST_TABLES_FAB_YR 0x49000106u
#define CYDEV_FLSHID_CUST_TABLES_MINOR 0x49000107u
#define CYDEV_FLSHID_CUST_TABLES_IMO_3MHZ 0x49000108u
#define CYDEV_FLSHID_CUST_TABLES_IMO_6MHZ 0x49000109u
#define CYDEV_FLSHID_CUST_TABLES_IMO_12MHZ 0x4900010au
#define CYDEV_FLSHID_CUST_TABLES_IMO_24MHZ 0x4900010bu
#define CYDEV_FLSHID_CUST_TABLES_IMO_67MHZ 0x4900010cu
#define CYDEV_FLSHID_CUST_TABLES_IMO_80MHZ 0x4900010du
#define CYDEV_FLSHID_CUST_TABLES_IMO_92MHZ 0x4900010eu
#define CYDEV_FLSHID_CUST_TABLES_IMO_USB 0x4900010fu
#define CYDEV_FLSHID_CUST_TABLES_CMP0_TR0_HS 0x49000110u
#define CYDEV_FLSHID_CUST_TABLES_CMP1_TR0_HS 0x49000111u
#define CYDEV_FLSHID_CUST_TABLES_CMP2_TR0_HS 0x49000112u
#define CYDEV_FLSHID_CUST_TABLES_CMP3_TR0_HS 0x49000113u
#define CYDEV_FLSHID_CUST_TABLES_DEC_1L 0x49000114u
#define CYDEV_FLSHID_CUST_TABLES_DEC_1H 0x49000115u
#define CYDEV_FLSHID_CUST_TABLES_DEC_4L 0x49000116u
#define CYDEV_FLSHID_CUST_TABLES_DEC_4H 0x49000117u
#define CYDEV_FLSHID_CUST_TABLES_DEC_16L 0x49000118u
#define CYDEV_FLSHID_CUST_TABLES_DEC_16H 0x49000119u
#define CYDEV_FLSHID_CUST_TABLES_DEC_P25L 0x4900011au
#define CYDEV_FLSHID_CUST_TABLES_DEC_P25H 0x4900011bu
#define CYDEV_FLSHID_CUST_TABLES_DAC0_M1 0x4900011cu
#define CYDEV_FLSHID_CUST_TABLES_DAC0_M2 0x4900011du
#define CYDEV_FLSHID_CUST_TABLES_DAC0_M3 0x4900011eu
#define CYDEV_FLSHID_CUST_TABLES_DAC0_M4 0x4900011fu
#define CYDEV_FLSHID_CUST_TABLES_DAC0_M5 0x49000120u
#define CYDEV_FLSHID_CUST_TABLES_DAC0_M6 0x49000121u
#define CYDEV_FLSHID_CUST_TABLES_DAC0_M7 0x49000122u
#define CYDEV_FLSHID_CUST_TABLES_DAC0_M8 0x49000123u
#define CYDEV_FLSHID_CUST_TABLES_DAC2_M1 0x49000124u
#define CYDEV_FLSHID_CUST_TABLES_DAC2_M2 0x49000125u
#define CYDEV_FLSHID_CUST_TABLES_DAC2_M3 0x49000126u
#define CYDEV_FLSHID_CUST_TABLES_DAC2_M4 0x49000127u
#define CYDEV_FLSHID_CUST_TABLES_DAC2_M5 0x49000128u
#define CYDEV_FLSHID_CUST_TABLES_DAC2_M6 0x49000129u
#define CYDEV_FLSHID_CUST_TABLES_DAC2_M7 0x4900012au
#define CYDEV_FLSHID_CUST_TABLES_DAC2_M8 0x4900012bu
#define CYDEV_FLSHID_CUST_TABLES_DAC1_M1 0x4900012cu
#define CYDEV_FLSHID_CUST_TABLES_DAC1_M2 0x4900012du
#define CYDEV_FLSHID_CUST_TABLES_DAC1_M3 0x4900012eu
#define CYDEV_FLSHID_CUST_TABLES_DAC1_M4 0x4900012fu
#define CYDEV_FLSHID_CUST_TABLES_DAC1_M5 0x49000130u
#define CYDEV_FLSHID_CUST_TABLES_DAC1_M6 0x49000131u
#define CYDEV_FLSHID_CUST_TABLES_DAC1_M7 0x49000132u
#define CYDEV_FLSHID_CUST_TABLES_DAC1_M8 0x49000133u
#define CYDEV_FLSHID_CUST_TABLES_DAC3_M1 0x49000134u
#define CYDEV_FLSHID_CUST_TABLES_DAC3_M2 0x49000135u
#define CYDEV_FLSHID_CUST_TABLES_DAC3_M3 0x49000136u
#define CYDEV_FLSHID_CUST_TABLES_DAC3_M4 0x49000137u
#define CYDEV_FLSHID_CUST_TABLES_DAC3_M5 0x49000138u
#define CYDEV_FLSHID_CUST_TABLES_DAC3_M6 0x49000139u
#define CYDEV_FLSHID_CUST_TABLES_DAC3_M7 0x4900013au
#define CYDEV_FLSHID_CUST_TABLES_DAC3_M8 0x4900013bu
#define CYDEV_FLSHID_MFG_CFG_BASE 0x49000180u
#define CYDEV_FLSHID_MFG_CFG_SIZE 0x00000080u
#define CYDEV_FLSHID_MFG_CFG_DAC2_TR 0x4900011fu
#define CYDEV_FLSHID_MFG_CFG_IMO_TR1 0x49000182u
#define CYDEV_FLSHID_MFG_CFG_CMP0_TR0 0x490001a8u
#define CYDEV_FLSHID_MFG_CFG_CMP1_TR0 0x490001aau
#define CYDEV_FLSHID_MFG_CFG_CMP2_TR0 0x490001acu
#define CYDEV_FLSHID_MFG_CFG_CMP3_TR0 0x490001aeu
#define CYDEV_FLSHID_MFG_CFG_DAC0_TR 0x490001beu
#define CYDEV_FLSHID_MFG_CFG_DAC1_TR 0x490001c2u
#define CYDEV_FLSHID_MFG_CFG_DAC3_TR 0x490001c4u
#define CYDEV_FLSHID_MFG_CFG_SAR0_TR0 0x490001d0u
#define CYDEV_FLSHID_MFG_CFG_SAR0_TR1 0x490001d2u
#define CYDEV_FLSHID_MFG_CFG_SAR1_TR0 0x490001d4u
#define CYDEV_FLSHID_MFG_CFG_SAR1_TR1 0x490001d6u
#define CYDEV_EXTMEM_BASE 0x60000000u
#define CYDEV_EXTMEM_SIZE 0x01000000u
#define CYDEV_EXTMEM_DATA_MBASE 0x60000000u
#define CYDEV_EXTMEM_DATA_MSIZE 0x01000000u
#define CYDEV_NVIC_BASE 0xe000e000u
#define CYDEV_NVIC_SIZE 0x00000d3cu
#define CYDEV_NVIC_SYSTICK_CTL 0xe000e010u
#define CYDEV_NVIC_SYSTICK_RELOAD 0xe000e014u
#define CYDEV_NVIC_SYSTICK_CURRENT 0xe000e018u
#define CYDEV_NVIC_SYSTICK_CAL 0xe000e01cu
#define CYDEV_NVIC_SETENA0 0xe000e100u
#define CYDEV_NVIC_CLRENA0 0xe000e180u
#define CYDEV_NVIC_SETPEND0 0xe000e200u
#define CYDEV_NVIC_CLRPEND0 0xe000e280u
#define CYDEV_NVIC_ACTIVE0 0xe000e300u
#define CYDEV_NVIC_PRI_0 0xe000e400u
#define CYDEV_NVIC_PRI_1 0xe000e401u
#define CYDEV_NVIC_PRI_2 0xe000e402u
#define CYDEV_NVIC_PRI_3 0xe000e403u
#define CYDEV_NVIC_PRI_4 0xe000e404u
#define CYDEV_NVIC_PRI_5 0xe000e405u
#define CYDEV_NVIC_PRI_6 0xe000e406u
#define CYDEV_NVIC_PRI_7 0xe000e407u
#define CYDEV_NVIC_PRI_8 0xe000e408u
#define CYDEV_NVIC_PRI_9 0xe000e409u
#define CYDEV_NVIC_PRI_10 0xe000e40au
#define CYDEV_NVIC_PRI_11 0xe000e40bu
#define CYDEV_NVIC_PRI_12 0xe000e40cu
#define CYDEV_NVIC_PRI_13 0xe000e40du
#define CYDEV_NVIC_PRI_14 0xe000e40eu
#define CYDEV_NVIC_PRI_15 0xe000e40fu
#define CYDEV_NVIC_PRI_16 0xe000e410u
#define CYDEV_NVIC_PRI_17 0xe000e411u
#define CYDEV_NVIC_PRI_18 0xe000e412u
#define CYDEV_NVIC_PRI_19 0xe000e413u
#define CYDEV_NVIC_PRI_20 0xe000e414u
#define CYDEV_NVIC_PRI_21 0xe000e415u
#define CYDEV_NVIC_PRI_22 0xe000e416u
#define CYDEV_NVIC_PRI_23 0xe000e417u
#define CYDEV_NVIC_PRI_24 0xe000e418u
#define CYDEV_NVIC_PRI_25 0xe000e419u
#define CYDEV_NVIC_PRI_26 0xe000e41au
#define CYDEV_NVIC_PRI_27 0xe000e41bu
#define CYDEV_NVIC_PRI_28 0xe000e41cu
#define CYDEV_NVIC_PRI_29 0xe000e41du
#define CYDEV_NVIC_PRI_30 0xe000e41eu
#define CYDEV_NVIC_PRI_31 0xe000e41fu
#define CYDEV_NVIC_INTR_CTRL_STATE 0xe000ed04u
#define CYDEV_NVIC_VECT_OFFSET 0xe000ed08u
#define CYDEV_NVIC_APPLN_INTR 0xe000ed0cu
#define CYDEV_NVIC_SYSTEM_CONTROL 0xe000ed10u
#define CYDEV_NVIC_CFG_CONTROL 0xe000ed14u
#define CYDEV_NVIC_SYS_PRIO_HANDLER_4_7 0xe000ed18u
#define CYDEV_NVIC_SYS_PRIO_HANDLER_8_11 0xe000ed1cu
#define CYDEV_NVIC_SYS_PRIO_HANDLER_12_15 0xe000ed20u
#define CYDEV_NVIC_SYS_HANDLER_CSR 0xe000ed24u
#define CYDEV_NVIC_MEMMAN_FAULT_STATUS 0xe000ed28u
#define CYDEV_NVIC_BUS_FAULT_STATUS 0xe000ed29u
#define CYDEV_NVIC_USAGE_FAULT_STATUS 0xe000ed2au
#define CYDEV_NVIC_HARD_FAULT_STATUS 0xe000ed2cu
#define CYDEV_NVIC_DEBUG_FAULT_STATUS 0xe000ed30u
#define CYDEV_NVIC_MEMMAN_FAULT_ADD 0xe000ed34u
#define CYDEV_NVIC_BUS_FAULT_ADD 0xe000ed38u
#define CYDEV_TPIU_BASE 0xe0040000u
#define CYDEV_TPIU_SIZE 0x000000f4u
#define CYDEV_TPIU_PROTOCOL 0xe00400f0u
#define CYDEV_FLS_SIZE CYDEV_FLASH_SIZE
#define CYDEV_ECC_BASE CYDEV_FLSECC_BASE
#define CYDEV_FLS_SECTOR_SIZE 0x00010000u
#define CYDEV_ECC_SECTOR_SIZE 0x00002000u
#define CYDEV_FLS_ROW_SIZE 0x00000100u
#define CYDEV_ECC_ROW_SIZE 0x00000020u
#define CYDEV_EEPROM_ROW_SIZE 0x00000010u
#define CYDEV_PERIPH_BASE CYDEV_CLKDIST_BASE
#define CYCLK_LD_DISABLE 0x00000004u
#define CYCLK_LD_SYNC_EN 0x00000002u
#define CYCLK_LD_LOAD 0x00000001u
#define CYCLK_PIPE 0x00000080u
#define CYCLK_SSS 0x00000040u
#define CYCLK_EARLY 0x00000020u
#define CYCLK_DUTY 0x00000010u
#define CYCLK_SYNC 0x00000008u
#define CYCLK_SRC_SEL_CLK_SYNC_D 0
#define CYCLK_SRC_SEL_SYNC_DIG 0
#define CYCLK_SRC_SEL_IMO 1
#define CYCLK_SRC_SEL_XTAL_MHZ 2
#define CYCLK_SRC_SEL_XTALM 2
#define CYCLK_SRC_SEL_ILO 3
#define CYCLK_SRC_SEL_PLL 4
#define CYCLK_SRC_SEL_XTAL_KHZ 5
#define CYCLK_SRC_SEL_XTALK 5
#define CYCLK_SRC_SEL_DSI_G 6
#define CYCLK_SRC_SEL_DSI_D 7
#define CYCLK_SRC_SEL_CLK_SYNC_A 0
#define CYCLK_SRC_SEL_DSI_A 7
#endif /* CYDEVICE_H */
